{"pageProps":{"source":{"compiledSource":"var p=Object.defineProperty,m=Object.defineProperties;var u=Object.getOwnPropertyDescriptors;var t=Object.getOwnPropertySymbols;var i=Object.prototype.hasOwnProperty,n=Object.prototype.propertyIsEnumerable;var l=(a,o,r)=>o in a?p(a,o,{enumerable:!0,configurable:!0,writable:!0,value:r}):a[o]=r,e=(a,o)=>{for(var r in o||(o={}))i.call(o,r)&&l(a,r,o[r]);if(t)for(var r of t(o))n.call(o,r)&&l(a,r,o[r]);return a},d=(a,o)=>m(a,u(o));var c=(a,o)=>{var r={};for(var s in a)i.call(a,s)&&o.indexOf(s)<0&&(r[s]=a[s]);if(a!=null&&t)for(var s of t(a))o.indexOf(s)<0&&n.call(a,s)&&(r[s]=a[s]);return r};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(r){var s=r,{components:a}=s,o=c(s,[\"components\"]);return mdx(MDXLayout,d(e(e({},layoutProps),o),{components:a,mdxType:\"MDXLayout\"}),mdx(\"h1\",e({},{id:\"m\\xF3dulo-9---procesamiento-y-an\\xE1lisis-de-r\\xE1ster\"}),mdx(\"a\",e({parentName:\"h1\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#m\\xF3dulo-9---procesamiento-y-an\\xE1lisis-de-r\\xE1ster\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"M\\xF3dulo 9 - Procesamiento y an\\xE1lisis de r\\xE1ster\"),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"Autor:\"),\" Codrina Ilie\"),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"Editor:\"),\" Ben Hur Pintor\"),mdx(\"h2\",e({},{id:\"introducci\\xF3n-pedag\\xF3gica\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#introducci\\xF3n-pedag\\xF3gica\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Introducci\\xF3n pedag\\xF3gica\"),mdx(\"p\",null,\"Este m\\xF3dulo se centra en un tipo espec\\xEDfico de modelo de datos geogr\\xE1ficos: geodatos r\\xE1ster.\"),mdx(\"p\",null,\"Al final de este m\\xF3dulo, los alumnos tendr\\xE1n la comprensi\\xF3n b\\xE1sica de los siguientes conceptos:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"modelo de datos r\\xE1ster\"),mdx(\"li\",{parentName:\"ul\"},\"punto de la cuadr\\xEDcula \",mdx(\"strong\",{parentName:\"li\"},\"vs\"),\" celda de la cuadr\\xEDcula\"),mdx(\"li\",{parentName:\"ul\"},\"bandas de un conjunto de datos r\\xE1ster\"),mdx(\"li\",{parentName:\"ul\"},\"\\xE1lgebra de mapas\"),mdx(\"li\",{parentName:\"ul\"},\"las cuatro resoluciones de un r\\xE1ster (espacial, temporal, espectral y radiom\\xE9trica)\"),mdx(\"li\",{parentName:\"ul\"},\"remuestreo\"),mdx(\"li\",{parentName:\"ul\"},\"procesamiento por lotes\"),mdx(\"li\",{parentName:\"ul\"},\"detecci\\xF3n de cambios\")),mdx(\"h2\",e({},{id:\"herramientas-y-recursos-necesarios\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#herramientas-y-recursos-necesarios\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Herramientas y recursos necesarios\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Este m\\xF3dulo se ha preparado utilizando \",mdx(\"a\",e({parentName:\"li\"},{href:\"https://qgis.org/en/site/forusers/download.html\"}),\"QGIS versi\\xF3n 3.16.1 - Hannover\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",e({parentName:\"li\"},{href:\"https://drive.google.com/drive/folders/1ZTpu7SR3aVF21TiSJt19C_Itdo5xHC_b?usp=sharing\"}),\"Datos en la carpeta module9\"),mdx(\"ul\",{parentName:\"li\"},mdx(\"li\",{parentName:\"ul\"},\"module9.gpkg\"),mdx(\"li\",{parentName:\"ul\"},\"High Resolution Settlement Layer\"),mdx(\"li\",{parentName:\"ul\"},\"SRTM Digital Elevation Model\"),mdx(\"li\",{parentName:\"ul\"},\"Global Land Cover Map 2015-2019\"))),mdx(\"li\",{parentName:\"ul\"},\"El sistema de referencia de coordenadas utilizado es el ITRF92 / M\\xE9xico zona 13N, EPSG 4486.\")),mdx(\"h2\",e({},{id:\"requisitos-previos\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#requisitos-previos\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Requisitos previos\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Conocimientos b\\xE1sicos de funcionamiento de una computadora\"),mdx(\"li\",{parentName:\"ul\"},\"Una s\\xF3lida comprensi\\xF3n de los m\\xF3dulos 0, 1, 2, 6 y 8 de este plan de estudios.\")),mdx(\"h2\",e({},{id:\"introducci\\xF3n-tem\\xE1tica\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#introducci\\xF3n-tem\\xE1tica\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Introducci\\xF3n tem\\xE1tica\"),mdx(\"h2\",e({},{id:\"desglose-de-los-conceptos\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#desglose-de-los-conceptos\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Desglose de los conceptos\"),mdx(\"h3\",e({},{id:\"el-modelo-de-datos-r\\xE1ster\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#el-modelo-de-datos-r\\xE1ster\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"El modelo de datos r\\xE1ster\"),mdx(\"p\",null,\"Un r\\xE1ster es una matriz regular de valores, como en la figura 9.1.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig91.png\",alt:\"A matrix of values\",title:\"A matrix of values\"}))),mdx(\"p\",null,\"Figura 9.1 - Una matriz de valores\"),mdx(\"p\",null,\"Los valores se pueden asignar a \",mdx(\"strong\",{parentName:\"p\"},\"puntos de la cuadr\\xEDcula\"),\", principalmente a los centroides, y en este caso, el r\\xE1ster puede denominarse enrejado o grilla. La segunda opci\\xF3n es que los valores se asignen a la totalidad de la \",mdx(\"strong\",{parentName:\"p\"},\"celda de la cuadr\\xEDcula\"),\", denominada p\\xEDxeles (ver figura 9.2). Para el primer caso, el r\\xE1ster generalmente representa un campo continuo, como elevaci\\xF3n, temperatura, precipitaciones, concentraciones qu\\xEDmicas, etc. Para el segundo caso, cuando los valores se asignan a toda el \\xE1rea del p\\xEDxel, el r\\xE1ster generalmente representa una imagen: una imagen de sat\\xE9lite, un mapa escaneado, mapas vectoriales convertidos (ver Fase 2). Cabe se\\xF1alar que este modelo de datos no es particularmente eficiente para redes y otros tipos de datos que dependen en gran medida de las l\\xEDneas, como los l\\xEDmites de las propiedades.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig92.png\",alt:\"On the left side, the values are assigned to centroids. On the right, values are assigned to the grid cell area - the pixel.\",title:\"On the left side, the values are assigned to centroids. On the right, values are assigned to the grid cell area - the pixel.\"}))),mdx(\"p\",null,\"Figura 9.2 - En el lado izquierdo, los valores se asignan a centroides.\"),mdx(\"p\",null,\"A la derecha, los valores se asignan al \\xE1rea de la celda de la cuadr\\xEDcula: el p\\xEDxel.\"),mdx(\"h3\",e({},{id:\"racionalidad-del-procesamiento-r\\xE1ster\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#racionalidad-del-procesamiento-r\\xE1ster\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Racionalidad del procesamiento r\\xE1ster\"),mdx(\"p\",null,\"Como en el caso del procesamiento de datos vectoriales, la raz\\xF3n fundamental detr\\xE1s del procesamiento de datos r\\xE1ster se basa en la misma capacidad de los sistemas de informaci\\xF3n geogr\\xE1fica para almacenar, procesar y representar informaci\\xF3n de los fen\\xF3menos del mundo real, solo que la forma en que esto se logra difiere. En lugar de tener distintos puntos, l\\xEDneas y pol\\xEDgonos almacenados como colecciones de coordenadas x e y, tenemos una matriz de valores que cubre un \\xE1rea espec\\xEDfica como una malla. Para tener una imagen m\\xE1s clara en mente, imagine los mapas de temperatura que se muestran en la televisi\\xF3n. La temperatura es un campo continuo, no hay lugares en la superficie de la Tierra sin temperatura, ya sea positiva, negativa o 0.\"),mdx(\"p\",null,\"Se pueden realizar muchas operaciones en conjuntos de datos r\\xE1ster, el concepto de geoprocesamiento detallado en el m\\xF3dulo 8 tambi\\xE9n se aplica aqu\\xED. El t\\xE9rmino utilizado para englobar las operaciones que se pueden realizar en r\\xE1steres es \",mdx(\"em\",{parentName:\"p\"},\"\\xE1lgebra de mapas\"),\".\"),mdx(\"p\",null,\"El \\xE1lgebra de mapas representa un conjunto de operaciones primitivas [^ 1] en un SIG que permite que dos o m\\xE1s capas r\\xE1ster de \",mdx(\"em\",{parentName:\"p\"},\"dimensiones similares\"),\" produzcan una nueva capa r\\xE1ster (mapa) usando varias operaciones como suma, resta, comparaci\\xF3n, etc.\"),mdx(\"p\",null,\"Hay cuatro categor\\xEDas de operaciones que se pueden realizar en r\\xE1steres, como sigue:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Operaciones aritm\\xE9ticas: suma, resta, multiplicaci\\xF3n, divisi\\xF3n.\"),mdx(\"li\",{parentName:\"ul\"},\"Operaciones estad\\xEDsticas: m\\xEDnimo, m\\xE1ximo, promedio, mediana.\"),mdx(\"li\",{parentName:\"ul\"},\"Las operaciones relacionales proporcionan comparaciones entre celdas que utilizan funciones como mayor que, menor que o igual a.\"),mdx(\"li\",{parentName:\"ul\"},\"Operaciones trigonom\\xE9tricas: seno, coseno, tangente, arcoseno entre dos o m\\xE1s conjuntos de datos r\\xE1ster.\"),mdx(\"li\",{parentName:\"ul\"},\"Las operaciones exponenciales y logar\\xEDtmicas usan funciones de exponentes y logaritmos.\")),mdx(\"p\",null,\"Para cada una de estas operaciones, existen algoritmos implementados en la mayor\\xEDa de los entornos SIG que permiten al usuario aplicarlos en sus datos. A continuaci\\xF3n, tambi\\xE9n implementaremos algunas de las operaciones m\\xE1s comunes para tener una idea de c\\xF3mo trabajar y qu\\xE9 se debe esperar de este tipo de procesamiento de datos.\"),mdx(\"p\",null,\"El concepto de \",mdx(\"em\",{parentName:\"p\"},\"dimensiones similares se\"),\" refiere a las caracter\\xEDsticas de los conjuntos de datos r\\xE1ster. Es decir, las operaciones detalladas anteriormente no se pueden realizar con resultados significativos en 2 conjuntos de datos r\\xE1ster con diferentes resoluciones espaciales, temporales o espectrales. A continuaci\\xF3n, presentaremos muy brevemente las cuatro resoluciones que son relevantes para las im\\xE1genes rasterizadas.\"),mdx(\"p\",null,\"Recordando cu\\xE1les son los 4 tipos de resoluciones de una imagen satelital (raster con valores asignados al \\xE1rea de celda - p\\xEDxeles):\"),mdx(\"ol\",null,mdx(\"li\",{parentName:\"ol\"},mdx(\"p\",{parentName:\"li\"},\"La \",mdx(\"strong\",{parentName:\"p\"},\"resoluci\\xF3n espacial\"),\" corresponde al tama\\xF1o elemental de la superficie del suelo medida, se expresa en unidades de longitud y representa la longitud de un lado del p\\xEDxel (ver figura 9.3). Por ejemplo, como ha visto en el m\\xF3dulo 3, los datos de la capa de asentamiento de alta resoluci\\xF3n tienen una resoluci\\xF3n espacial de 30 metros, es decir, cada p\\xEDxel del conjunto de datos estima el n\\xFAmero de personas que viven dentro de un metro de 30.\")),mdx(\"li\",{parentName:\"ol\"},mdx(\"p\",{parentName:\"li\"},\"La \",mdx(\"strong\",{parentName:\"p\"},\"resoluci\\xF3n temporal\"),\" est\\xE1 asociada con im\\xE1genes a\\xE9reas (im\\xE1genes adquiridas por sat\\xE9lites, aviones, helic\\xF3pteros, drones) y corresponde al per\\xEDodo entre 2 im\\xE1genes consecutivas del mismo punto exacto de la Tierra, tomadas en las mismas condiciones (tanto como sea posible), como como el mismo avi\\xF3n, la misma altitud, etc. Por ejemplo, Landsat 8 tiene una resoluci\\xF3n temporal de 16 d\\xEDas, es decir, cada punto de la Tierra es revisado por el sat\\xE9lite Landsat 8 cada 16 d\\xEDas [^ 2].\")),mdx(\"li\",{parentName:\"ol\"},mdx(\"p\",{parentName:\"li\"},mdx(\"strong\",{parentName:\"p\"},\"Resoluci\\xF3n espectral\"),\": los sensores a bordo de sat\\xE9lites o aviones capturan la radiaci\\xF3n electromagn\\xE9tica proveniente de todos los objetos de la Tierra (agua, asentamientos, bosques, carreteras, edificios, tierra desnuda, etc.) y los sensores est\\xE1n dise\\xF1ados espec\\xEDficamente para capturarla en una banda espectral conocida determinada. (o longitud de onda). El ojo humano puede ver una parte muy peque\\xF1a del espectro electromagn\\xE9tico: la luz visible (roja, verde y azul), \\xA1pero los sensores pueden 'ver' mucho m\\xE1s! (ver figura 9.4)\"))),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig94.png\",alt:\"Electromagnetic spectrum (photo credit [NASA Science](https://science.nasa.gov/ems/01_intro))\",title:\"Electromagnetic spectrum (photo credit [NASA Science](https://science.nasa.gov/ems/01_intro))\"}))),mdx(\"p\",null,\"Figura 9.4 - Espectro electromagn\\xE9tico (cr\\xE9dito de la foto NASA Science - \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://science.nasa.gov/ems/01_intro\"}),\"https://science.nasa.gov/ems/01_intro\"),\")\"),mdx(\"ol\",e({},{start:4}),mdx(\"li\",{parentName:\"ol\"},\"La \",mdx(\"strong\",{parentName:\"li\"},\"resoluci\\xF3n radiom\\xE9trica\"),\" est\\xE1 determinada por el n\\xFAmero de bits en los que se divide la radiaci\\xF3n registrada. En datos de 8 bits, los n\\xFAmeros digitales (DN) pueden oscilar entre 0 y 255 para cada p\\xEDxel (28 \\xBC 256 n\\xFAmeros posibles en total). Claramente, m\\xE1s bits significa que el sensor puede detectar cambios m\\xE1s sutiles en la energ\\xEDa que captura, lo que conduce a una imagen 'm\\xE1s clara', una mayor precisi\\xF3n radiom\\xE9trica del sensor, pero tambi\\xE9n requiere m\\xE1s espacio para almacenar los datos.\")),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"Bandas espectrales\")),mdx(\"p\",null,\"Un conjunto de datos r\\xE1ster contiene una o m\\xE1s capas llamadas bandas. Cada banda almacena otro conjunto de informaci\\xF3n sobre el \\xE1rea que cubre el r\\xE1ster. Cada banda tiene exactamente la misma extensi\\xF3n y coordenadas, pero no necesariamente la misma resoluci\\xF3n espacial. Adem\\xE1s, adem\\xE1s de los valores almacenados, hay otras propiedades clave contenidas, como: valores de celda m\\xE1ximo, m\\xEDnimo y medio e \",mdx(\"em\",{parentName:\"p\"},\"histograma\"),\" de valores de celda.\"),mdx(\"p\",null,\"Un \",mdx(\"strong\",{parentName:\"p\"},\"histograma\"),\" es una representaci\\xF3n aproximada de la distribuci\\xF3n de datos num\\xE9ricos (ver figura 9.5); de otras formas, es una forma en la que uno puede tener una idea de los datos disponibles.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig95.png\",alt:\"Example of a histogram, where x is a raster layer\",title:\"Example of a histogram, where x is a raster layer\"}))),mdx(\"p\",null,\"Figura 9.5 - Ejemplo de un histograma, donde x es una capa r\\xE1ster\"),mdx(\"p\",null,\"\\xBFPor qu\\xE9 es esto importante en nuestro contexto? Porque, como se mencion\\xF3 al principio, un r\\xE1ster es una matriz de valores num\\xE9ricos continuos (recuerde el ejemplo de temperatura) y un histograma ayuda al usuario a comprender c\\xF3mo se distribuyen los valores de sus r\\xE1steres. Cada barra agrupa los valores de celda que se encuentran en un rango espec\\xEDfico, mientras m\\xE1s alta sea la barra, m\\xE1s celdas tienen valores en ese rango espec\\xEDfico. En caso de que el r\\xE1ster tenga m\\xE1s de una banda, se calcular\\xE1 el histograma para cada una. No hay espacios entre los rangos representados en un histograma, el histograma se usa solo para datos continuos.\"),mdx(\"h2\",e({},{id:\"contenido-principal\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#contenido-principal\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Contenido principal\"),mdx(\"h3\",e({},{id:\"fase-1-comprensi\\xF3n-de-sus-datos-r\\xE1ster\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#fase-1-comprensi\\xF3n-de-sus-datos-r\\xE1ster\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Fase 1: Comprensi\\xF3n de sus datos r\\xE1ster.\"),mdx(\"p\",null,\"En las \\xFAltimas dos d\\xE9cadas, la cantidad de sat\\xE9lites que captan datos de la Tierra ha crecido exponencialmente. Adem\\xE1s, una pol\\xEDtica de acceso a datos abiertos que ha sido adoptada por diferentes agencias espaciales, como la NASA para el \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.usgs.gov/core-science-systems/nli/landsat/landsat-data-access?qt-science_support_page_related_con=0#qt-science_support_page_related_con\"}),\"programa Landsat\"),\" o la Agencia Espacial Europea para el \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.copernicus.eu/en/access-data\"}),\"programa Copernicus\"),\", lo cual ha abierto la puerta a un flujo abrumador de datos de observaci\\xF3n de la Tierra. Como consecuencia natural, el progreso cient\\xEDfico de los algoritmos, las metodolog\\xEDas y el desarrollo de herramientas m\\xE1s poderosas para procesar datos r\\xE1ster, especialmente im\\xE1genes satelitales, ha sido impresionante y extenso en campos como la agricultura, la silvicultura, el desarrollo urbano, las actividades humanitarias, el oc\\xE9ano y el mar. monitoreo de agua, seguridad y muchos m\\xE1s. En las siguientes 3 fases, presentaremos algunas de las t\\xE9cnicas de procesamiento m\\xE1s comunes y qu\\xE9 resultados esperar de ellas.\"),mdx(\"h4\",e({},{id:\"paso-1-prepare-su-entorno-de-trabajo\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#paso-1-prepare-su-entorno-de-trabajo\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Paso 1. Prepare su entorno de trabajo.\"),mdx(\"p\",null,\"Comenzaremos agregando a su proyecto QGIS todos los conjuntos de datos r\\xE1ster con los que trabajaremos, de la siguiente manera:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Datos de capa de asentamiento de alta resoluci\\xF3n\"),mdx(\"li\",{parentName:\"ul\"},'Modelo de superficie digital global ALOS \"ALOS World 3D - 30m (AW3D30)\"'),mdx(\"li\",{parentName:\"ul\"},\"Cobertura terrestre din\\xE1mica moderada: las 5 \\xE9pocas disponibles 2015, 2016, 2017, 2018 y 2019.\")),mdx(\"p\",null,\"Como los datos de la capa de asentamiento de alta resoluci\\xF3n se presentaron en un m\\xF3dulo anterior, tambi\\xE9n detallaremos informaci\\xF3n sobre los otros 2 conjuntos de datos que emplearemos en este m\\xF3dulo.\"),mdx(\"ol\",null,mdx(\"li\",{parentName:\"ol\"},mdx(\"p\",{parentName:\"li\"},\"El modelo de superficie digital global de ALOS (AW3D30) es un conjunto de datos de modelo de superficie digital global (DSM) con una resoluci\\xF3n horizontal de aproximadamente 30 metros (malla de 1 segundo de arco). Un DSM incluye la superficie del suelo, la vegetaci\\xF3n y los objetos artificiales, como edificios, puentes, etc., a diferencia del modelo de elevaci\\xF3n digital que considera estrictamente el terreno.\")),mdx(\"li\",{parentName:\"ol\"},mdx(\"p\",{parentName:\"li\"},\"Dynamic Land Cover Map (Mapa din\\xE1mico de cobertura terrestre) es un producto de Copernicus Global Land Service (CGLS) derivado de la serie de tiempo PROBA-V 100 my varios otros conjuntos de datos de cobertura terrestre. El producto proporciona clases discretas de cobertura terrestre primaria, as\\xED como capas de campo continuas para todas las clases de cobertura terrestre b\\xE1sica que proporcionan estimaciones proporcionales de vegetaci\\xF3n / cobertura terrestre para los tipos de cobertura terrestre. El producto tiene 3 bandas: discrete_classification, (clasificaci\\xF3n discreta), forest_type (tipo de bosque) y urban_coverfraction (fraccion de cobertura urbana). Las 2 tablas siguientes presentan los valores para cada clase discreta:\"))),mdx(\"p\",null,\"Tabla 1 Tabla de valores de la banda discrete_classification (clasificaci\\xF3n discreta)\"),mdx(\"table\",null,mdx(\"tr\",null,mdx(\"td\",null,\"Valor\"),mdx(\"td\",null,\"Color\"),mdx(\"td\",null,\"Descripci\\xF3n\")),mdx(\"tr\",null,mdx(\"td\",null,\"0\"),mdx(\"td\",null,\"282828\"),mdx(\"td\",null,\"Desconocido. No hay suficientes datos satelitales disponibles o no hay datos.\")),mdx(\"tr\",null,mdx(\"td\",null,\"20\"),mdx(\"td\",null,\"FFBB22\"),mdx(\"td\",null,\"Arbustos. Plantas le\\xF1osas perennes con tallos persistentes y le\\xF1osos y sin tallo principal definido que mida menos de 5 m de altura. El follaje de los arbustos puede ser perenne o caducifolio.\")),mdx(\"tr\",null,mdx(\"td\",null,\"30\"),mdx(\"td\",null,\"FFFF4C\"),mdx(\"td\",null,\"Vegetaci\\xF3n herb\\xE1cea. Plantas sin tallo persistente o brotes por encima del suelo y sin estructura firme definida. La cobertura de \\xE1rboles y arbustos es inferior al 10%.\")),mdx(\"tr\",null,mdx(\"td\",null,\"40\"),mdx(\"td\",null,\"F096FF\"),mdx(\"td\",null,\"Vegetaci\\xF3n / agricultura cultivada y gestionada. Tierras cubiertas con cultivos temporales seguidos de cosecha y un per\\xEDodo de suelo desnudo (por ejemplo, sistemas de cultivo \\xFAnico y m\\xFAltiple). Tenga en cuenta que los cultivos le\\xF1osos perennes se clasificar\\xE1n como el tipo apropiado de cobertura forestal o arbustiva.\")),mdx(\"tr\",null,mdx(\"td\",null,\"50\"),mdx(\"td\",null,\"FA0000\"),mdx(\"td\",null,\"Urbano / edificado. Terreno cubierto por edificios y otras estructuras artificiales.\")),mdx(\"tr\",null,mdx(\"td\",null,\"60\"),mdx(\"td\",null,\"B4B4B4\"),mdx(\"td\",null,\"Descubierto / escasa vegetaci\\xF3n. Tierras con suelo, arena o rocas expuestas y nunca tienen m\\xE1s del 10% de cobertura vegetal durante cualquier \\xE9poca del a\\xF1o.\")),mdx(\"tr\",null,mdx(\"td\",null,\"70\"),mdx(\"td\",null,\"F0F0F0\"),mdx(\"td\",null,\"Hielo y nieve. Aterriza bajo cubierta de nieve o hielo durante todo el a\\xF1o.\")),mdx(\"tr\",null,mdx(\"td\",null,\"80\"),mdx(\"td\",null,\"0032C8\"),mdx(\"td\",null,\"Cuerpos de agua permanentes. Lagos, embalses y r\\xEDos. Pueden ser masas de agua dulce o salada.\")),mdx(\"tr\",null,mdx(\"td\",null,\"90\"),mdx(\"td\",null,\"0096A0\"),mdx(\"td\",null,\"Humedal herb\\xE1ceo. Tierras con una mezcla permanente de agua y vegetaci\\xF3n herb\\xE1cea o le\\xF1osa. La vegetaci\\xF3n puede estar presente en agua salada, salobre o dulce.\")),mdx(\"tr\",null,mdx(\"td\",null,\"100\"),mdx(\"td\",null,\"FAE6A0\"),mdx(\"td\",null,\"Musgos y l\\xEDquenes.\")),mdx(\"tr\",null,mdx(\"td\",null,\"111\"),mdx(\"td\",null,\"58481F\"),mdx(\"td\",null,\"Bosque cerrado, hoja de aguja siempre verde. Copas de los \\xE1rboles> 70%, casi todos los \\xE1rboles con hojas de aguja permanecen verdes todo el a\\xF1o. El dosel nunca est\\xE1 exento de follaje verde.\")),mdx(\"tr\",null,mdx(\"td\",null,\"112\"),mdx(\"td\",null,\"9900\"),mdx(\"td\",null,\"Bosque cerrado, hoja ancha siempre verde. Copas de los \\xE1rboles> 70%, casi todos los \\xE1rboles de hoja ancha permanecen verdes durante todo el a\\xF1o. El dosel nunca est\\xE1 exento de follaje verde.\")),mdx(\"tr\",null,mdx(\"td\",null,\"113\"),mdx(\"td\",null,\"70663E\"),mdx(\"td\",null,\"Bosque cerrado, hoja de aguja decidua. La copa de los \\xE1rboles> 70%, consiste en comunidades de \\xE1rboles de hojas de aguja estacionales con un ciclo anual de per\\xEDodos de hojas abiertas y sin hojas.\")),mdx(\"tr\",null,mdx(\"td\",null,\"114\"),mdx(\"td\",null,\"00CC00\"),mdx(\"td\",null,\"Bosque cerrado, hoja ancha caducifolia. La copa de los \\xE1rboles> 70%, consiste en comunidades de \\xE1rboles de hoja ancha estacionales con un ciclo anual de periodos de hojas abiertas y sin hojas.\")),mdx(\"tr\",null,mdx(\"td\",null,\"115\"),mdx(\"td\",null,\"4E751F\"),mdx(\"td\",null,\"Bosque cerrado, mixto.\")),mdx(\"tr\",null,mdx(\"td\",null,\"116\"),mdx(\"td\",null,\"7800\"),mdx(\"td\",null,\"Bosque cerrado, que no coincide con ninguna de las otras definiciones.\")),mdx(\"tr\",null,mdx(\"td\",null,\"121\"),mdx(\"td\",null,\"666000\"),mdx(\"td\",null,\"Bosque abierto, hoja de aguja siempre verde. La capa superior - \\xE1rboles 15-70% y la segunda capa - mezcla de arbustos y pastizales, casi todos los \\xE1rboles de hojas de aguja permanecen verdes todo el a\\xF1o. El dosel nunca est\\xE1 exento de follaje verde.\")),mdx(\"tr\",null,mdx(\"td\",null,\"122\"),mdx(\"td\",null,\"8DB400\"),mdx(\"td\",null,\"Bosque abierto, hoja ancha siempre verde. La capa superior - \\xE1rboles 15-70% y la segunda capa - mezcla de arbustos y pastizales, casi todos los \\xE1rboles de hoja ancha permanecen verdes durante todo el a\\xF1o. El dosel nunca est\\xE1 exento de follaje verde.\")),mdx(\"tr\",null,mdx(\"td\",null,\"123\"),mdx(\"td\",null,\"8D7400\"),mdx(\"td\",null,\"Bosque abierto, hoja de aguja caducifolia. La capa superior - \\xE1rboles 15-70% y la segunda capa - mezcla de arbustos y pastizales, consiste en comunidades de \\xE1rboles de hojas de aguja estacionales con un ciclo anual de per\\xEDodos de hojas abiertas y sin hojas.\")),mdx(\"tr\",null,mdx(\"td\",null,\"124\"),mdx(\"td\",null,\"A0DC00\"),mdx(\"td\",null,\"Bosque abierto, hoja ancha caducifolia. La capa superior - \\xE1rboles 15-70% y la segunda capa - mezcla de arbustos y pastizales, consiste en comunidades de \\xE1rboles latifoliados estacionales con un ciclo anual de periodos con y sin hojas.\")),mdx(\"tr\",null,mdx(\"td\",null,\"125\"),mdx(\"td\",null,\"929900\"),mdx(\"td\",null,\"Bosque abierto, mixto.\")),mdx(\"tr\",null,mdx(\"td\",null,\"126\"),mdx(\"td\",null,\"648C00\"),mdx(\"td\",null,\"Bosque abierto, no coincide con ninguna de las otras definiciones.\")),mdx(\"tr\",null,mdx(\"td\",null,\"200\"),mdx(\"td\",null,\"80\"),mdx(\"td\",null,\"Oc\\xE9anos, mares. Pueden ser masas de agua dulce o salada.\"))),mdx(\"p\",null,\"Tabla 2: tabla de valores de la banda forest_type (tipo de bosque)\"),mdx(\"table\",null,mdx(\"tr\",null,mdx(\"td\",null,\"Valor\"),mdx(\"td\",null,\"Color\"),mdx(\"td\",null,\"Descripci\\xF3n\")),mdx(\"tr\",null,mdx(\"td\",null,\"0\"),mdx(\"td\",null,\"282828\"),mdx(\"td\",null,\"Desconocido\")),mdx(\"tr\",null,mdx(\"td\",null,\"1\"),mdx(\"td\",null,\"666000\"),mdx(\"td\",null,\"Hoja de aguja perenne\")),mdx(\"tr\",null,mdx(\"td\",null,\"2\"),mdx(\"td\",null,\"9900\"),mdx(\"td\",null,\"Hoja ancha de hoja perenne\")),mdx(\"tr\",null,mdx(\"td\",null,\"3\"),mdx(\"td\",null,\"70663E\"),mdx(\"td\",null,\"Hoja de aguja caducifolio\")),mdx(\"tr\",null,mdx(\"td\",null,\"4\"),mdx(\"td\",null,\"A0DC00\"),mdx(\"td\",null,\"Hoja ancha caducifolia\")),mdx(\"tr\",null,mdx(\"td\",null,\"5\"),mdx(\"td\",null,\"929900\"),mdx(\"td\",null,\"Mezcla de tipos de bosque\"))),mdx(\"p\",null,\"Para organizar mejor sus capas, agr\\xFApelas por categor\\xEDa, de la siguiente manera: para las 5 capas r\\xE1ster de cobertura terrestre, cree un grupo denominado Cobertura terrestre (en la tabla de contenidos, haga clic en el pictograma Agregar grupo). Para el modelo de superficie digital, cree un grupo llamado JAXA [^ 3] DSM.\"),mdx(\"p\",null,\"No olvide agregar tambi\\xE9n el l\\xEDmite del \\xE1rea de trabajo, Estado de Jalisco, que es un conjunto de datos vectoriales.\"),mdx(\"p\",null,\"Su ventana de mapa QGIS deber\\xEDa verse como en la figura 9.6, tal vez en colores ligeramente diferentes.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig96.png\",alt:\"Loaded raster datasets\",title:\"Loaded raster datasets\"}))),mdx(\"p\",null,\"Figura 9.6 - conjuntos de datos r\\xE1ster cargados\"),mdx(\"h4\",e({},{id:\"paso-2-comprenda-lo-que-est\\xE1-viendo\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#paso-2-comprenda-lo-que-est\\xE1-viendo\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Paso 2. Comprenda lo que est\\xE1 viendo.\"),mdx(\"p\",null,\"A continuaci\\xF3n, utilizaremos una serie de herramientas que nos permitir\\xE1n tener una idea de los datos con los que estamos trabajando.\"),mdx(\"p\",null,\"Despu\\xE9s de cargar todos los conjuntos de datos, verificaremos el sistema de referencia de coordenadas en el que se encuentran todos nuestros conjuntos de datos. Como sabemos por m\\xF3dulos anteriores, QGIS ofrece la posibilidad de reproyectar todos los conjuntos de datos cargados en el proyecto sobre la marcha, sin embargo, eso podr\\xEDa conducir a un geoprocesamiento. problemas en el camino. As\\xED, aunque todas las capas est\\xE9n correctamente superpuestas, como se puede decir por inspecci\\xF3n visual, procederemos a reproyectarlas todas en el sistema de coordenadas oficial de nuestra regi\\xF3n de inter\\xE9s, Estado de Jalisco - EPSG: 3123.\"),mdx(\"p\",null,\"Hay varias formas de obtener informaci\\xF3n. en las capas cargadas en QGIS, algunas proporcionan al usuario m\\xE1s detalles que otras. Para obtener una descripci\\xF3n general r\\xE1pida de los metadatos de un conjunto de datos, se debe seleccionar la capa, hacer doble clic y abrir \",mdx(\"inlineCode\",{parentName:\"p\"},\"Propiedades \\u2023 Informaci\\xF3n.\")),mdx(\"p\",null,\"Para la capa hrsl_phl_pop, la ventana de informaci\\xF3n se ver\\xEDa como en la figura 9.7.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig97.png\",alt:\"Extracting basic metadata from a raster layer\",title:\"Extracting basic metadata from a raster layer\"}))),mdx(\"p\",null,\"Figura 9.7 - Extracci\\xF3n de metadatos b\\xE1sicos de una capa r\\xE1ster\"),mdx(\"p\",null,\"Con respecto a nuestra primera pregunta sobre qu\\xE9 CRS se est\\xE1 utilizando para los conjuntos de datos que hemos cargado, podemos observar que incluso si el HRSL est\\xE1 correctamente superpuesto, la proyecci\\xF3n del conjunto de datos nativo es EPSG 4326 - WGS 84 - Geogr\\xE1fico, con unidades medidas en grados. Tambi\\xE9n identificamos que esta capa r\\xE1ster espec\\xEDfica tiene solo una banda, sin embargo, el tama\\xF1o de p\\xEDxel es dif\\xEDcil de leer ya que la medici\\xF3n est\\xE1 en grados y no en metros, lo que la har\\xEDa m\\xE1s f\\xE1cil de entender.\"),mdx(\"p\",null,\"Por lo tanto, lo primero que debe hacer es reproyectar todos los conjuntos de datos con los que trabajaremos en el mismo sistema de coordenadas - EPSG 3123.\"),mdx(\"p\",null,\"Comenzando con los conjuntos de datos HRSL, vamos a \",mdx(\"inlineCode\",{parentName:\"p\"},\"R\\xE1ster \\u2023 Proyecciones \\u2023 Deformar (Reproyectar) \"),\"(ver figura 9.8).\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig98.png\",alt:\"Reproject functionality in QGIS\",title:\"Reproject functionality in QGIS\"}))),mdx(\"p\",null,\"Figura 9.8 - Funcionalidad de reproyecci\\xF3n en QGIS\"),mdx(\"p\",null,\"Despu\\xE9s de seleccionar la funcionalidad Deformaci\\xF3n, aparecer\\xE1 una nueva ventana que le permitir\\xE1 al usuario configurar los par\\xE1metros correctos (ver figura 9.9).\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig99_a.png\",alt:\"Warp (reproject) QGIS window\",title:\"Warp (reproject) QGIS window\"}))),mdx(\"p\",null,\"Figura 9.9a - Ventana de deformaci\\xF3n (reproyectar) QGIS\"),mdx(\"p\",null,\"If you selected the output to be \",mdx(\"strong\",{parentName:\"p\"},\"[Save to temporary file]\"),\" then there will be a raster layer named \",mdx(\"inlineCode\",{parentName:\"p\"},\"Reprojected\"),\" in the Layers Panel. This is a memory layer and you can rename this layer to Reprojected_HRSL_Jalisco_Population and save it to make it persistent.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig99_b.png\",alt:\"Reprojected HRSL\",title:\"Reprojected HRSL\"}))),mdx(\"p\",null,\"Figure 9.9b - Reprojected HRSL\"),mdx(\"p\",null,'Notar\\xE1 que, a diferencia de cuando reproyect\\xF3 conjuntos de datos vectoriales, hay un nuevo par\\xE1metro que puede configurar como \"M\\xE9todo de remuestreo para usar\".'),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"Remuestreo\"),\" representa la interpolaci\\xF3n de los valores de la celda para que transforme el r\\xE1ster como lo indica el usuario. Hay varios m\\xE9todos de remuestreo disponibles dentro de la funcionalidad Deformaci\\xF3n, cada uno con su propio soporte matem\\xE1tico. Sin embargo, las explicaciones detalladas sobre cada uno no son el alcance de este ejercicio. La lectura adicional est\\xE1 disponible en las referencias.\"),mdx(\"p\",null,\"En este caso particular, queremos reproyectar datos de poblaci\\xF3n - valores num\\xE9ricos. Y seg\\xFAn el m\\xE9todo de remuestreo seleccionado (vecino m\\xE1s cercano), la coordenada de cada p\\xEDxel de salida se utilizar\\xE1 para calcular un nuevo valor a partir de los valores de p\\xEDxel cercanos en la capa de entrada (ver figura 9.10).\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig910.png\",alt:\"Resample method - nearest neighbour\",title:\"Resample method - nearest neighbour\"}))),mdx(\"p\",null,\"Figura 9.10 - M\\xE9todo de remuestreo - vecino m\\xE1s cercano (cr\\xE9dito de la foto: documentaci\\xF3n de ILWIS - \",mdx(\"a\",e({parentName:\"p\"},{href:\"http://spatial-analyst.net/ILWIS/htm/ilwisapp/resample_functionality.htm\"}),\"(http://spatial-analyst.net/ILWIS/htm/ilwisapp/resample_functionality.htm\"),\")\"),mdx(\"p\",null,\"Los p\\xEDxeles de entrada est\\xE1n representados por l\\xEDneas negras discontinuas, las coordenadas de los p\\xEDxeles de entrada por puntos negros; los p\\xEDxeles de salida est\\xE1n representados por l\\xEDneas s\\xF3lidas rojas, las coordenadas de los p\\xEDxeles de salida por signos m\\xE1s rojos. Las flechas grises indican c\\xF3mo se determinan los valores de salida. Se puede ver en la figura 9.10, algunos valores del mapa de entrada se pueden usar dos veces en el mapa de salida, mientras que otros valores de entrada pueden no usarse en absoluto. Por eso, aunque es uno de los m\\xE9todos m\\xE1s r\\xE1pidos para volver a muestrear, no es apropiado en nuestro caso, ya que estamos trabajando con datos num\\xE9ricos: datos de poblaci\\xF3n. Este m\\xE9todo de remuestreo es adecuado para datos categ\\xF3ricos, como valores de cobertura terrestre.\"),mdx(\"p\",null,\"Para reproyectar nuestro conjunto de datos r\\xE1ster de poblaci\\xF3n, utilizaremos el m\\xE9todo de interpolaci\\xF3n bilineal para volver a muestrear los valores de p\\xEDxeles (ver figura 9.11). \"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig911.png\",alt:\"Resample method - bilinear\",title:\"Resample method - bilinear\"}))),mdx(\"p\",null,\"Figura 9.11 M\\xE9todo de remuestreo - bilineal (cr\\xE9dito de la foto: ILWIS documentaci\\xF3n - \",mdx(\"a\",e({parentName:\"p\"},{href:\"http://spatial-analyst.net/ILWIS/htm/ilwisapp/resample_functionality.htm\"}),\"(http://spatial-analyst.net/ILWIS/htm/ilwisapp/resample_functionality.htm\"),\")\"),mdx(\"p\",null,\"El m\\xE9todo bilineal determina el nuevo valor de una celda basado en un promedio de distancia ponderado de los cuatro centros de celda de entrada m\\xE1s cercanos. Es \\xFAtil para datos continuos y suavizar\\xE1 los datos.\"),mdx(\"p\",null,\"Procedemos a verificar el CRS de los 5 conjuntos de datos de cobertura terrestre que hemos cargado en nuestro proyecto QGIS. Al acceder a la \",mdx(\"inlineCode\",{parentName:\"p\"},\"informaci\\xF3n de Propiedades de capa \\u2023\"),\", podemos ver que las 5 capas de cobertura terrestre se proyectan en EPSG: 3857 - WGS 84 / Pseudo-Mercator. Una soluci\\xF3n ser\\xEDa utilizar la herramienta Reproyectar y configurar para cada capa individualmente. Sin embargo, una forma m\\xE1s r\\xE1pida es utilizar la funci\\xF3n de reproyecci\\xF3n que se ejecuta como un \",mdx(\"em\",{parentName:\"p\"},\"procesamiento por lotes\"),\".\"),mdx(\"p\",null,\"El procesamiento por lotes es la capacidad de ejecutar procesos repetitivos en datos, con una m\\xEDnima interacci\\xF3n del usuario. La mayor\\xEDa de las funcionalidades de QGIS tienen esta opci\\xF3n disponible y se puede activar en la ventana del proceso cambiando a la pesta\\xF1a Ejecutar procesamiento por lotes (ver figura 9.12).\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig912.png\",alt:\"Batch processing tab on a QGIS functionality window\",title:\"Batch processing tab on a QGIS functionality window\"}))),mdx(\"p\",null,\"Figura 9.12 - Pesta\\xF1a de procesamiento por lotes en una ventana de funcionalidad QGIS\"),mdx(\"p\",null,\"Para las 5 capas r\\xE1ster de cobertura terrestre, usaremos el procesamiento por lotes y como m\\xE9todo de remuestreo del vecino m\\xE1s cercano. Para agregar una nueva capa, haga clic en el pictograma +. Para llenar autom\\xE1ticamente el CRS y los par\\xE1metros del m\\xE9todo de remuestreo, haga clic en el bot\\xF3n de autocompletar en la parte superior de las columnas correspondientes y seleccione \",mdx(\"inlineCode\",{parentName:\"p\"},\"Rellenar\"),\". Cambie el nombre de los r\\xE1steres reproyectados agregando el c\\xF3digo EPSG al final del nombre, por ejemplo, LandCover2015, se convertir\\xE1 en landCover2015_4486. Configure sus par\\xE1metros como en la figura 9.13: CRS de origen: EPSG: 4486, CRS de destino EPSG 4486, m\\xE9todo de remuestreo a utilizar: vecino m\\xE1s cercano (explicamos en el p\\xE1rrafo anterior por qu\\xE9), valor de nodata para las bandas de salida: 255 (de la ventana de informaci\\xF3n, vemos el tipo de datos - yte - entero sin signo de 8 bits - lo que significa que el valor m\\xE1ximo puede ser 255), resoluci\\xF3n de salida: 100 m (como los r\\xE1steres de cobertura terrestre iniciales). Despu\\xE9s de configurar todos los par\\xE1metros, marque la casilla en la esquina izquierda de la ventana -\",mdx(\"inlineCode\",{parentName:\"p\"},\" Cargar capas al finalizar.\"),\" Pulsa \",mdx(\"inlineCode\",{parentName:\"p\"},\"Ejecutar\"),\".\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig913_a.png\",alt:\"Batch processing to reproject the land cover rasters\",title:\"Batch processing to reproject the land cover rasters\"}))),mdx(\"p\",null,\"Figura 9.13a - Procesamiento por lotes para reproyectar los r\\xE1steres de cobertura terrestre\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig913_b.png\",alt:\"Autofill output names\",title:\"Autofill output names\"}))),mdx(\"p\",null,\"Figure 9.13b - Autofill output names\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig913_c.png\",alt:\"Reprojected land cover rasters\",title:\"Reprojected land cover rasters\"}))),mdx(\"p\",null,\"Figure 9.13c - Reprojected land cover rasters\"),mdx(\"p\",null,\"Luego vienen los r\\xE1steres del modelo de superficie digital. Como se puede observar, para cubrir nuestra regi\\xF3n de inter\\xE9s, necesit\\xE1bamos varios \",mdx(\"em\",{parentName:\"p\"},\"mosaicos r\\xE1ster\"),\". Cuando los archivos r\\xE1ster se vuelven demasiado grandes, imagine un solo archivo DSM a 30m para Europa, que tiene m\\xE1s de 10 millones de kil\\xF3metros cuadrados, se dividen en \",mdx(\"strong\",{parentName:\"p\"},\"mosaicos\"),\" porque, en \\xE1reas m\\xE1s peque\\xF1as, son m\\xE1s f\\xE1ciles de administrar.\"),mdx(\"p\",null,\"Aunque podr\\xEDamos usar la herramienta de ajuste en modo por lotes para reproyectar todos los archivos r\\xE1ster DSM, en una inspecci\\xF3n visual, tambi\\xE9n se puede notar que las delimitaciones entre cada mosaico son bastante visibles, lo que lo hace, al menos, visualmente poco atractivo. Lo que ser\\xEDa \\xFAtil es tener una visi\\xF3n completa del terreno, como un fen\\xF3meno continuo, como es, de hecho, sin interrupciones artificiales. Para obtenerlo, usaremos la herramienta de fusi\\xF3n GDAL, disponible en la barra de herramientas de Procesamiento para fusionar todos los r\\xE1steres DSM. Para abrirlo, vaya a \",mdx(\"inlineCode\",{parentName:\"p\"},\"Procesamiento \\u2023 Caja de herramientas \"),\"y en la barra de b\\xFAsqueda escriba fusionar (ver figura 9.14)\",mdx(\"inlineCode\",{parentName:\"p\"},\".\")),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig914.png\",alt:\"Finding the GDAL merge tool in the Processing Toolbox\",title:\"Finding the GDAL merge tool in the Processing Toolbox\"}))),mdx(\"p\",null,\"Figura 9.14 - Encontrar la herramienta de combinaci\\xF3n GDAL en la caja de herramientas de procesamiento\"),mdx(\"p\",null,\"En la ventana de combinaci\\xF3n que se abre, seleccione los archivos r\\xE1ster DSM que queremos volver mosaico y haga clic en ejecutar. Guarde el resultado como DSM_mosaico. El resultado deber\\xEDa verse como en la figura 9.15.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig915_a.png\",alt:\"Selecting the ASTER layers to merge\",title:\"Selecting the ASTER layers to merge\"}))),mdx(\"p\",null,\"Figure 9.15a - Selecting the ASTER layers to merge\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig915_b.png\",alt:\"Parameters of the Merge processing algorithm\",title:\"Parameters of the Merge processing algorithm\"}))),mdx(\"p\",null,\"Figure 9.15b - Parameters of the Merge processing algorithm\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig915_c.png\",alt:\"Mosaic of all DSM files corresponding to our work region\",title:\"Mosaic of all DSM files corresponding to our work region\"}))),mdx(\"p\",null,\"Figura 9.15c - Mosaico de todos los archivos DSM correspondientes a nuestra regi\\xF3n de trabajo\"),mdx(\"p\",null,\"Ahora, podemos proceder a reproyectar el mosaico - un archivo, en lugar de 6 archivos. Vaya a \",mdx(\"inlineCode\",{parentName:\"p\"},\"R\\xE1ster \\u2023 proyecci\\xF3n \\u2023 Envoltura (reproyectar)\"),\" y configure los par\\xE1metros conocidos: \"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Fuente CRS EPSG 4326, \"),mdx(\"li\",{parentName:\"ul\"},\"Objetivo CRS: EPSG: 3123, \"),mdx(\"li\",{parentName:\"ul\"},\"M\\xE9todo de remuestreo: Vecino m\\xE1s cercano, \"),mdx(\"li\",{parentName:\"ul\"},\"resoluci\\xF3n de archivo de salida - 30 m. \"),mdx(\"li\",{parentName:\"ul\"},\"Guarde el resultado como DSM_mosaico_4486.\")),mdx(\"p\",null,\"En este punto, deber\\xEDamos tener todas las capas en el mismo CRS - EPSG 4486.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig915_d.png\",alt:\"Reproject Merged raster\",title:\"Reproject Merged raster\"}))),mdx(\"p\",null,\"Figure 9.15d - Reproject Merged raster\"),mdx(\"p\",null,\"Podemos hacer otra verificaci\\xF3n para asegurarnos de que todos los r\\xE1steres con los que estamos trabajando est\\xE9n proyectados y obtener informaci\\xF3n adicional sobre los datos ejecutando un proceso por lotes de Informaci\\xF3n de trama sobre todos. Para abrir la ventana de funciones, vaya a \",mdx(\"inlineCode\",{parentName:\"p\"},\"R\\xE1ster \\u2023 Varios \\u2023 Informaci\\xF3n de r\\xE1ster\"),\". La ventana de informaci\\xF3n r\\xE1ster de procesamiento por lotes debe verse como en la figura 9.16.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig916.png\",alt:\"Batch process to extract information in a separate HTML file for multiple raster layers\",title:\"Batch process to extract information in a separate HTML file for multiple raster layers\"}))),mdx(\"p\",null,\"Figura 9.16 - Proceso por lotes para extraer informaci\\xF3n en un archivo HTML separado para m\\xFAltiples capas r\\xE1ster. \"),mdx(\"p\",null,\"Un archivo HTML de informaci\\xF3n r\\xE1ster deber\\xEDa verse como a continuaci\\xF3n. Un archivo HTML se puede abrir con cualquier editor de texto o navegador web de su elecci\\xF3n.\"),mdx(\"pre\",null,mdx(\"code\",e({parentName:\"pre\"},{}),`Driver: GTiff/GeoTIFF\nFiles: C:\\\\\\\\Users\\\\\\\\herca\\\\\\\\Documents\\\\\\\\03 Trabajo\\\\\\\\Cursos\\\\\\\\OKF\\\\\\\\modulo2_capas_qgis\\\\\\\\Mexico\\\\\\\\MDE_JALISCO_4486.tif\nSize is 15566, 13656\nCoordinate System is:\nPROJCRS[\"Mexico ITRF92 / UTM zone 13N\",\nBASEGEOGCRS[\"Mexico ITRF92\",\nDATUM[\"Mexico ITRF92\",\nELLIPSOID[\"GRS 1980\",6378137,298.257222101,\nLENGTHUNIT[\"metre\",1]]],\nPRIMEM[\"Greenwich\",0,\nANGLEUNIT[\"degree\",0.0174532925199433]],\nID[\"EPSG\",4483]],\nCONVERSION[\"UTM zone 13N\",\nMETHOD[\"Transverse Mercator\",\nID[\"EPSG\",9807]],\nPARAMETER[\"Latitude of natural origin\",0,\nANGLEUNIT[\"degree\",0.0174532925199433],\nID[\"EPSG\",8801]],\nPARAMETER[\"Longitude of natural origin\",-105,\nANGLEUNIT[\"degree\",0.0174532925199433],\nID[\"EPSG\",8802]],\nPARAMETER[\"Scale factor at natural origin\",0.9996,\nSCALEUNIT[\"unity\",1],\nID[\"EPSG\",8805]],\nPARAMETER[\"False easting\",500000,\nLENGTHUNIT[\"metre\",1],\nID[\"EPSG\",8806]],\nPARAMETER[\"False northing\",0,\nLENGTHUNIT[\"metre\",1],\nID[\"EPSG\",8807]]],\nCS[Cartesian,2],\nAXIS[\"(E)\",east,\nORDER[1],\nLENGTHUNIT[\"metre\",1]],\nAXIS[\"(N)\",north,\nORDER[2],\nLENGTHUNIT[\"metre\",1]],\nUSAGE[\nSCOPE[\"unknown\"],\nAREA[\"Mexico - 108\\xB0W to 102\\xB0W\"],\nBBOX[14.05,-108,31.79,-102]],\nID[\"EPSG\",4486]]\nData axis to CRS axis mapping: 1,2\nOrigin = (426831.833299999998417,2519690.029300000052899)\nPixel Size = (28.626103674675573,-31.007709973637965)\nMetadata:\nAREA_OR_POINT=Area\nImage Structure Metadata:\nINTERLEAVE=BAND\nCorner Coordinates:\nUpper Left ( 426831.833, 2519690.029) (105d42'46.14\"W, 22d46'59.30\"N)\nLower Left ( 426831.833, 2096248.742) (105d41'41.98\"W, 18d57'26.34\"N)\nUpper Right ( 872425.763, 2519690.029) (101d22'28.01\"W, 22d44'36.75\"N)\nLower Right ( 872425.763, 2096248.742) (101d27'53.56\"W, 18d55'29.68\"N)\nCenter ( 649628.798, 2307969.386) (103d33'42.02\"W, 20d51'57.04\"N)\nBand 1 Block=15566x1 Type=Float32, ColorInterp=Gray\n`)),mdx(\"p\",null,\"Despu\\xE9s de preparar los r\\xE1ster reproyect\\xE1ndolos en los CRS que estamos trabajando y leyendo sus metadatos para comprender mejor los archivos, es hora de profundizar en los datos reales. Para lograrlo, calcularemos e interpretaremos los histogramas (consulte la secci\\xF3n Desglose de conceptos para obtener m\\xE1s detalles) de nuestros r\\xE1steres.\"),mdx(\"p\",null,\"Para calcular un histograma, seleccione la capa r\\xE1ster que le interese, \\xE1brala haciendo doble clic en la ventana de di\\xE1logo \",mdx(\"inlineCode\",{parentName:\"p\"},\"Propiedades\"),\" y vaya a \",mdx(\"inlineCode\",{parentName:\"p\"},\"Histograma\"),\" (ver figura 9.17).\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig917.png\",alt:\"Histogram window\",title:\"Histogram window\"}))),mdx(\"p\",null,\"Figura 9.17 - Ventana de Histograma \"),mdx(\"p\",null,\"Toca el bot\\xF3n \",mdx(\"inlineCode\",{parentName:\"p\"},\"Computar histograma\"),\" y QIS lo computar\\xE1 autom\\xE1ticamente.\"),mdx(\"p\",null,\"Despu\\xE9s de computar el histograma, podemos ver que el mouse se convierte en una lupa. Es una herramienta que permite la inspecci\\xF3n del histograma, viendo como var\\xEDa la frecuencia de diferentes valores. Acerc\\xE1ndose puede ver algo como en la figura 9.18.\"),mdx(\"p\",null,\"Para volver a la vista completa, haga clic en la izquierda.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig918.png\",alt:\"Zooming in on the DSM_mosaic_5235 computed histogram\",title:\"Zooming in on the DSM_mosaic_5235 computed histogram\"}))),mdx(\"p\",null,\"Figura 9.18 - Ampliaci\\xF3n del histograma calculado DSM_mosaico_4486\"),mdx(\"p\",null,\"M\\xE1s que simplemente ver la distribuci\\xF3n de los valores num\\xE9ricos de los p\\xEDxeles, el histograma permite al usuario reclasificar los valores para la visualizaci\\xF3n del r\\xE1ster. Para ello, utilice las 2 herramientas para se\\xF1alar en el histograma los nuevos valores m\\xEDnimo y m\\xE1ximo (consulte la figura 9.19).\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig919.png\",alt:\"Selecting min and max values to reclassify the raster\",title:\"Selecting min and max values to reclassify the raster\"}))),mdx(\"p\",null,\"Figura 9.19 - Selecci\\xF3n de valores m\\xEDnimos y m\\xE1ximos para reclasificar el r\\xE1ster\"),mdx(\"p\",null,\"Despu\\xE9s de presionar Aplicar, el r\\xE1ster se representar\\xE1 utilizando el nuevo rango m\\xEDnimo-m\\xE1ximo seleccionado. Esta funcionalidad permite al usuario ignorar valores extremos que pueden estirar de forma anormal el r\\xE1ster.\"),mdx(\"p\",null,\"Aunque la siguiente herramienta que usamos es un complemento (consulte el m\\xF3dulo 1 para obtener detalles del complemento), lo consideramos muy \\xFAtil para comenzar a trabajar con r\\xE1ster. Nos referimos a la \",mdx(\"inlineCode\",{parentName:\"p\"},\"Value Tool (Herramienta de Valores)\"),\" que permite la identificaci\\xF3n inmediata de los valores de las celdas al pasar el cursor sobre capas r\\xE1ster.\"),mdx(\"p\",null,\"Vaya a\",mdx(\"inlineCode\",{parentName:\"p\"},\" Complemento \\u2023 Administrar e instalar complementos,\"),\" busque el complemento \",mdx(\"inlineCode\",{parentName:\"p\"},\"Value Tool\"),\" y haga clic en instalar. Luego, haga clic derecho en la barra de la ventana principal de QGIS para abrir todos los Paneles y Barras de Herramientas disponibles en su instalaci\\xF3n de QGIS (ver figura 9.20).\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig920.png\",alt:\"The Value Tool Panel\",title:\"The Value Tool Panel\"}))),mdx(\"p\",null,\"Figura 9.20 - Disponibilidad de paneles y barras de herramientas en QGIS\"),mdx(\"p\",null,\"La practicidad de esta herramienta reside en su simplicidad de uso, con solo unos pocos clics, uno puede extraer muy f\\xE1cilmente celdas de valor en las \\xE1reas exactas de inter\\xE9s. Adem\\xE1s, permite esto para todas las capas r\\xE1ster cargadas.\"),mdx(\"p\",null,\"Value Tool tiene 3 pesta\\xF1as: Tabla, Gr\\xE1fico, Opciones (consulte la figura 9.21).\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig921.png\",alt:\"Loaded value tool - highlight on first tab - Table\",title:\"Loaded value tool - highlight on first tab - Table\"}))),mdx(\"p\",null,\"Figura 9.21 - Value Tool cargado - resaltar en la primera pesta\\xF1a - Tabla\"),mdx(\"p\",null,'La primera pesta\\xF1a - Tabla - presenta una lista de todas las capas r\\xE1ster cargadas y los valores de las celdas, a medida que el usuario mueve el mouse. Tambi\\xE9n existe la posibilidad de seleccionar con cu\\xE1ntos decimales se deben mostrar los valores. Si el mouse se desplaza fuera de la extensi\\xF3n de una capa r\\xE1ster, en lugar de un valor, se mostrar\\xE1 un mensaje: \"fuera de extensi\\xF3n\".'),mdx(\"p\",null,\"La segunda pesta\\xF1a, Gr\\xE1fico, muestra en un gr\\xE1fico unido todos los valores que lee en la posici\\xF3n del mouse. Permite al usuario insertar valores para m\\xEDnimo y m\\xE1ximo en el eje Y, que es el eje de los valores de celda. El eje X enumera todas las bandas del r\\xE1ster que muestra en la tabla, con los n\\xFAmeros de orden correspondientes: la banda que tiene el n\\xFAmero 1 en la primera pesta\\xF1a, tambi\\xE9n ser\\xE1 la n\\xFAmero 1 en el gr\\xE1fico.\"),mdx(\"p\",null,\"La tercera pesta\\xF1a permite al usuario personalizar lo que \",mdx(\"inlineCode\",{parentName:\"p\"},\"Value Tool\"),\" muestra: qu\\xE9 capas (todas, solo las visibles o las seleccionadas) y qu\\xE9 bandas mostrar.\"),mdx(\"h4\",e({},{id:\"preguntas-de-evaluaci\\xF3n\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#preguntas-de-evaluaci\\xF3n\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Preguntas de evaluaci\\xF3n\"),mdx(\"ol\",null,mdx(\"li\",{parentName:\"ol\"},\"\\xBFSe pueden reproyectar capas r\\xE1ster en otros sistemas de coordenadas?\")),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"S\\xED.\"),mdx(\"li\",{parentName:\"ul\"},\"No\")),mdx(\"ol\",null,mdx(\"li\",{parentName:\"ol\"},\"\\xBFPuede haber espacios entre los rangos de valores de un histograma calculado para una capa r\\xE1ster?\")),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"S\\xED.\"),mdx(\"li\",{parentName:\"ul\"},\"No.\")),mdx(\"ol\",null,mdx(\"li\",{parentName:\"ol\"},\"\\xBFPueden diferentes bandas del mismo conjunto de datos r\\xE1ster tener diferentes resoluciones?\")),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"em\",{parentName:\"li\"},\"S\\xED.\")),mdx(\"li\",{parentName:\"ul\"},\"No.\")),mdx(\"h3\",e({},{id:\"fase-2-introducci\\xF3n-al-trabajo-con-datos-r\\xE1ster\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#fase-2-introducci\\xF3n-al-trabajo-con-datos-r\\xE1ster\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Fase 2: Introducci\\xF3n al trabajo con datos r\\xE1ster\"),mdx(\"p\",null,\"Ahora que hemos aprendido c\\xF3mo extraer informaci\\xF3n b\\xE1sica en los conjuntos de datos r\\xE1ster cargados, continuaremos con un procesamiento de datos r\\xE1ster m\\xE1s detallado para obtener nuevos r\\xE1steres derivados y, en consecuencia, m\\xE1s informaci\\xF3n.\"),mdx(\"p\",null,\"Como habr\\xE1 notado, debido a la estructura del modelo de datos r\\xE1ster, las capas que hemos cargado se est\\xE1n expandiendo sobre nuestra regi\\xF3n de inter\\xE9s: la Estado de Jalisco. Eso no es deseable debido a varias razones, pero principalmente porque termina procesando m\\xE1s datos de los que realmente necesita, lo que se traduce en mayores necesidades de almacenamiento y procesamiento inform\\xE1tico. Por eso, antes de seguir adelante con cualquier otro paso, nos aseguraremos de procesar exactamente la cantidad de datos que necesitamos. \",mdx(\"strong\",{parentName:\"p\"},\"Tenga en cuenta\"),\", dado que comenzar\\xE1 a trabajar en sus propios conjuntos de datos, que el tama\\xF1o de sus archivos es un factor importante cuando se trata de tiempos de procesamiento. Cuanto m\\xE1s grandes sean los archivos, se requerir\\xE1 m\\xE1s tiempo. Debido a la estructura de datos del modelo (r\\xE1ster frente a vector), los archivos r\\xE1ster suelen ser mucho m\\xE1s grandes.\"),mdx(\"p\",null,\"Como ya habr\\xE1 notado, los conjuntos de datos que cargamos en un SIG, en nuestro caso en QGIS, se pueden procesar juntos incluso si son de diferente naturaleza, como unir tablas csv a capas vectoriales para agregar informaci\\xF3n a las geometr\\xEDas. Lo mismo se aplica a los datos r\\xE1ster y vectoriales, como veremos.\"),mdx(\"p\",null,\"Para trabajar solo con capas r\\xE1ster que son relevantes para nuestro Estado de Jalisco, usaremos la capa de extensi\\xF3n vectorial (Jalisco4486) para cortar / recortar todas las capas r\\xE1ster relevantes. Vaya a\",mdx(\"inlineCode\",{parentName:\"p\"},\" R\\xE1ster \\u2023 Extracci\\xF3n \\u2023 Recortar r\\xE1ster por capa de m\\xE1scara\"),\" (consulte la figura 9.22)\",mdx(\"inlineCode\",{parentName:\"p\"},\".\")),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig922.png\",alt:\"Using a vector mask to extract the raster data on a specific region\",title:\"Using a vector mask to extract the raster data on a specific region\"}))),mdx(\"p\",null,\"Figura 9.22 - Usando una m\\xE1scara vectorial para extraer los datos r\\xE1ster en una regi\\xF3n espec\\xEDfica\"),mdx(\"p\",null,\"Dado que trabajaremos con 7 capas r\\xE1ster - las 5 capas de Cobertura Terrestre - el modelo de superficie digital y el HRSLl, usaremos el procesamiento por lotes para recortar todas las capas en una vez. Tenga en cuenta que si ha omitido el paso de reproyecci\\xF3n, tiene capas en diferentes proyecciones y el algoritmo no funcionar\\xE1 o producir\\xE1 resultados inesperados.\"),mdx(\"p\",null,\"La configuraci\\xF3n de la ventana de procesamiento por lotes deber\\xEDa verse como en la figura 9.23.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig923.png\",alt:\"Batch process cliping all required raster layers by Jalisco geometry\",title:\"Batch process cliping all required raster layers by Jalisco geometry\"}))),mdx(\"p\",null,\"Figura 9.23 - Procesamiento por lotes recortando todas las capas r\\xE1ster requeridas por geometr\\xEDa del Estado de Jalisco\"),mdx(\"p\",null,\"La configuraci\\xF3n de los par\\xE1metros es la siguiente: \"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"capa de m\\xE1scara: Jalisco, \"),mdx(\"li\",{parentName:\"ul\"},\"tanto el CRS de origen como el de destino es EPSG 4486, \"),mdx(\"li\",{parentName:\"ul\"},\"seleccione s\\xED para: \",mdx(\"inlineCode\",{parentName:\"li\"},\"hacer coincidir la extensi\\xF3n del r\\xE1ster recortado con la capa de m\\xE1scara\"),\" y \",mdx(\"inlineCode\",{parentName:\"li\"},\"mantener la resoluci\\xF3n de la capa de entrada\"),\". \"),mdx(\"li\",{parentName:\"ul\"},\"Tenga en cuenta que para DSM_mosaico tambi\\xE9n seleccionaremos s\\xED\",mdx(\"inlineCode\",{parentName:\"li\"},\" para crear una banda alfa de salida\"),\". Cargue las capas al finalizar.\")),mdx(\"p\",null,\"Si todo sali\\xF3 bien, su ventana principal de QGIS deber\\xEDa verse como en la figura 9.24.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig924.png\",alt:\"Raster layers clipped by Jalisco contour\",title:\"Raster layers clipped by Jalisco contour\"}))),mdx(\"p\",null,\"Figura 9.24 - Capas r\\xE1ster recortadas por el contorno del Estado de Jalisco.\"),mdx(\"p\",null,\"Ahora, imagine que tiene que presentar un informe sobre d\\xF3nde vive la mayor\\xEDa de las personas, pero teniendo en cuenta la altitud [^ 4]. Debes saber cu\\xE1ntas personas viven entre 0 y 200 m de altitud en el Estado de Jalisco. Hay algunos elementos a considerar. En primer lugar, cu\\xE1les son los datos que utilizaremos y cu\\xE1les son sus caracter\\xEDsticas. Para la poblaci\\xF3n, tenemos los datos de la capa de asentamiento de alta resoluci\\xF3n y para el alivio, tenemos el ALOS World 3D - 30m (AW3D30). Ambas capas r\\xE1ster tienen una resoluci\\xF3n espacial de 30 m, lo que nos permite pasar a otras consideraciones. El alivio es un fen\\xF3meno continuo, la expansi\\xF3n de la poblaci\\xF3n no lo es, sin embargo, el informe no tendr\\xEDa sentido que lo hiciera el p\\xEDxel de 30 metros. Necesitamos identificar todos los p\\xEDxeles con valores de celda de 0 a 200. Considerando el histograma de DSM_mosaico para nuestra regi\\xF3n de inter\\xE9s, hemos visto que la mayor\\xEDa de los valores de celda est\\xE1n entre 0 y 200 m. Podemos proceder a realizar un mapa de relieve b\\xE1sico en base a las siguientes divisiones:\"),mdx(\"ol\",null,mdx(\"li\",{parentName:\"ol\"},\"0 - 200m\"),mdx(\"li\",{parentName:\"ol\"},\"51 - 100m\"),mdx(\"li\",{parentName:\"ol\"},\"101 - 1200m\"),mdx(\"li\",{parentName:\"ol\"},\"151 - 200m\"),mdx(\"li\",{parentName:\"ol\"},\"250 - 600m\"),mdx(\"li\",{parentName:\"ol\"},\"600 - 1300m\")),mdx(\"p\",null,\"Usando sus conocimientos adquiridos en el m\\xF3dulo 4, puede dise\\xF1ar la capa DSM por estas categor\\xEDas. Su mapa deber\\xEDa verse como en la figura 9.25.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig925.png\",alt:\"DSM_mosaic_clipped representation\",title:\"DSM_mosaic_clipped representation\"}))),mdx(\"p\",null,\"Figura 9.25 - Representaci\\xF3n DSM_mosaico_recortado\"),mdx(\"p\",null,\"Para calcular el n\\xFAmero de personas en base a los datos raster HRSL que viven hasta 200 metros en la Estado de Jalisco, debemos ver qu\\xE9 p\\xEDxeles caen en cada una de esas categor\\xEDas. Para hacer eso, usaremos Raster Calculator. Esta es una funcionalidad que permite al usuario realizar c\\xE1lculos sobre la base de los valores de p\\xEDxeles de la trama existentes. Los resultados se escriben en una nueva capa r\\xE1ster en un formato compatible con GDAL [^ 5].\"),mdx(\"p\",null,\"There are several ways to open the raster calclulator in QGIS. You can do so from the Menu bar \",mdx(\"strong\",{parentName:\"p\"},\"Raster \\u2023 Raster Calculator\"),\" or by searching raster calculator on the Processing Toolbox or Locator bar. If we run the Raster Calculator under Raster analysis in the Processing Toolbox, the window in Figure 9.26b should appear. \"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig926_a.png\",alt:\"Opening the Raster calculator\",title:\"Opening the Raster calculator\"}))),mdx(\"p\",null,\"Figure 9.26a - Opening the Raster calculator\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig926_b.png\",alt:\"Raster calculator\",title:\"Raster calculator\"}))),mdx(\"p\",null,\"Figura 9.26b - Calculadora r\\xE1ster\"),mdx(\"p\",null,\"En esta ventana podemos reconocer las operaciones detalladas en la secci\\xF3n Conceptos, sustracciones, adiciones, comparaciones y todas las dem\\xE1s (ver p\\xE1gina 3). A continuaci\\xF3n, 'cortaremos' nuestra capa r\\xE1ster DSM_mosaico_recortado para extraer solo los p\\xEDxeles con valores de hasta 200 metros. Sabemos que las celdas de valor de DSM_mosaico_recortado representan datos num\\xE9ricos continuos (no valores discretos, como LandCover). Por lo tanto, la operaci\\xF3n que debemos emplear en este caso es una comparaci\\xF3n de valores de una celda \",\"<\",\"200 metros. Para obtenerlo, escribiremos lo siguiente en la Calculadora: \"),mdx(\"pre\",null,mdx(\"code\",e({parentName:\"pre\"},{}),`\"DSM_mosaico_recortado @ 1\" <= 200.\n`)),mdx(\"p\",null,\"Se puede observar la convenci\\xF3n de nomenclatura para los r\\xE1steres: lo que viene antes de @ es el nombre de la capa r\\xE1ster, lo que viene despu\\xE9s de @ es el n\\xFAmero de la banda. Guarde el resultado de la calculadora como DSM_recortado500.tiff. Su calculadora de r\\xE1ster deber\\xEDa verse como en la figura 9.27.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig927.png\",alt:\"Inserting a formula into the Raster Calculator\",title:\"Inserting a formula into the Raster Calculator\"}))),mdx(\"p\",null,\"Figura 9.27 - Insertar una f\\xF3rmula en la Calculadora r\\xE1ster.\"),mdx(\"p\",null,\"Su resultado deber\\xEDa verse como en la figura 9.28.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig928.png\",alt:\"Result of identify all pixel values that are below 200 meters using the Raster Calculator\",title:\"Result of identify all pixel values that are below 200 meters using the Raster Calculator\"}))),mdx(\"p\",null,\"Figura 9.28 - Resultado de identificar todos los valores de p\\xEDxeles que est\\xE1n por debajo de 500 metros usando la Calculadora R\\xE1ster.\"),mdx(\"p\",null,\"Como podemos ver en la Tabla de Contenidos, la capa r\\xE1ster que hemos obtenido tiene solo 2 valores: 0 y 1. Eso es porque hemos usado una operaci\\xF3n racional, una comparaci\\xF3n, por lo tanto, cada p\\xEDxel que est\\xE1 por debajo de 200 metros recibi\\xF3 un valor = 1 y todos los anteriores, un valor = 0. Podemos probar esto usando \",mdx(\"inlineCode\",{parentName:\"p\"},\"Value Tool\"),\". La figura 9.29 presenta solo p\\xEDxeles de valor 1, en otras palabras, los p\\xEDxeles que nos interesan para nuestro ejercicio.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig929.png\",alt:\"Spatial distribution of all pixels of value 1, meaning with altitude lower than 200 meters\",title:\"Spatial distribution of all pixels of value 1, meaning with altitude lower than 200 meters\"}))),mdx(\"p\",null,\"Figura 9.29 - Distribuci\\xF3n espacial de todos los p\\xEDxeles de valor 1, es decir, con una altitud inferior a 200 metros\"),mdx(\"p\",null,\"Yendo m\\xE1s all\\xE1, podemos mostrar la distribuci\\xF3n espacial de la poblaci\\xF3n a la resoluci\\xF3n espacial de 30 m solo en esta regi\\xF3n geogr\\xE1fica espec\\xEDfica que hemos seleccionado - Estado de Jalisco , por debajo de 200 m. Para hacer eso, volvemos a emplear la Calculadora r\\xE1ster.\"),mdx(\"p\",null,\"La f\\xF3rmula es bastante simple, dado que todos los valores de celda DSM que nos interesan tienen el valor 1.\"),mdx(\"p\",null,\"Abra la Calculadora e inserte la siguiente f\\xF3rmula: \"),mdx(\"pre\",null,mdx(\"code\",e({parentName:\"pre\"},{}),`\"DSM_recortado200 @ 1\" * \"hsrl_recortado @ 1\"\n`)),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig930.png\",alt:\"Using raster calculator to identify population distribution classes based on altitude of up to 200m\",title:\"Using raster calculator to identify population distribution classes based on altitude of up to 200m\"}))),mdx(\"p\",null,\"Figura 9.30 - Uso de la calculadora r\\xE1ster para identificar la distribuci\\xF3n de la poblaci\\xF3n clases basadas en una altitud de hasta 500 m\"),mdx(\"p\",null,\"A diferencia del uso anterior de la calculadora r\\xE1ster, hemos utilizado 2 conjuntos de datos r\\xE1ster diferentes para obtener el resultado deseado, sin embargo, observar\\xE1 que incluso si hay p\\xEDxeles que caen fuera de MDE_menor500.tif en el resultado, su valor es 0. Utilice Value Tool para comprobar (consulte la figura 9.31).\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig931.png\",alt:\"Using Value Tool to check results of Raster Calculator\",title:\"Using Value Tool to check results of Raster Calculator\"}))),mdx(\"p\",null,\"Figura 9.31 - Usando Value Tool para verificar los resultados de la Calculadora r\\xE1ster\"),mdx(\"p\",null,\"Puede ver que incluso si hrsl_recortado tiene valores en esta ubicaci\\xF3n espec\\xEDfica del mouse, el r\\xE1ster obtenido con la Calculadora r\\xE1ster hrsl_dsm_recortado tiene el valor 0.\"),mdx(\"p\",null,\"A continuaci\\xF3n, presentamos la distribuci\\xF3n espacial de la poblaci\\xF3n que vive por debajo de 500 m en el Estado de Jalisco. Para elegir una clasificaci\\xF3n adecuada, calculamos el histograma. Podemos notar que la mayor\\xEDa de los valores se encuentran entre 0,1 y 200 personas por 30 m. La clasificaci\\xF3n que hemos elegido es visible en la figura 9.32.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig932.png\",alt:\"Distribution of population that lives below 50 in Colombo district, represented at a 30m resolution\",title:\"Distribution of population that lives below 200m in Colombo district, represented at a 30m resolution\"}))),mdx(\"p\",null,\"Figura 9.32 - Distribuci\\xF3n de la poblaci\\xF3n que vive por debajo de los 200 m en el Estado de Jalisco, representada con una resoluci\\xF3n de 30 m.\"),mdx(\"p\",null,\"Si estamos interesados \\u200B\\u200Ben el n\\xFAmero total de personas que viven por debajo de 200 m en la Estado de Jalisco y no en la distribuci\\xF3n geogr\\xE1fica por 30 m de resoluci\\xF3n espacial, entonces necesitamos sumar todos los valores de p\\xEDxeles de la capa r\\xE1ster hrsl_dsm_recortado. Una forma de obtener este n\\xFAmero es transformar el MDE_menor500 de r\\xE1ster a vector. \"),mdx(\"p\",null,\"Para hacer eso, vaya a \",mdx(\"inlineCode\",{parentName:\"p\"},\"R\\xE1ster \\u2023 Conversi\\xF3n Poligonizar (R\\xE1ster a Vector) \"),\"(ver figura 9.33).\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig933_a.png\",alt:\"Raster to vector conversion\",title:\"Raster to vector conversion\"}))),mdx(\"p\",null,\"Figura 9.33a - Conversi\\xF3n de r\\xE1ster a vector\"),mdx(\"p\",null,\"Recuerde que esta capa r\\xE1ster ten\\xEDa solo 2 valores - 0 y 1, as\\xED que elija como par\\xE1metro por el cual construir el vector el DN (n\\xFAmero digital). \"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig933_b.png\",alt:\"Raster to vector conversion parameters\",title:\"Raster to vector conversion parameters\"}))),mdx(\"p\",null,\"Figure 9.33b - Raster to vector conversion parameters\"),mdx(\"p\",null,\"Note that it's possible that you will have multiple features in the vectorized layer instead of just 2. In order to just have 2 features, you can run the \",mdx(\"strong\",{parentName:\"p\"},\"Dissolve\"),\" algorithm and choose \",mdx(\"strong\",{parentName:\"p\"},\"DN\"),\" as the Dissolve Field. This will result in having just 2 features in the layer. Also, don't forget to fix invalide geometries using the \",mdx(\"strong\",{parentName:\"p\"},\"Fix invalid geometries\"),\" algorithm if you encounter some geometry issues. Your result should look like in figure 9.34. \"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig934.png\",alt:\"Result of converting a raster dataset to a vector dataset\",title:\"Result of converting a raster dataset to a vector dataset\"}))),mdx(\"p\",null,\"Figura 9.34 - Resultado de convertir un conjunto de datos r\\xE1ster en uno vectorial.\"),mdx(\"p\",null,\"Elimina la geometr\\xEDa de valor 0.\"),mdx(\"p\",null,\"Para encontrar nuestra respuesta usaremos \",mdx(\"inlineCode\",{parentName:\"p\"},\"Estad\\xEDsticas zonales\"),'. Para encontrar r\\xE1pidamente esta funcionalidad, abra la Caja de herramientas de procesamiento y escriba en el cuadro de b\\xFAsqueda \"zonal\" (consulte la figura 9.35).'),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig935.png\",alt:\"Identifying Zonal Statistics in the Processing Toolbox\",title:\"Identifying Zonal Statistics in the Processing Toolbox\"}))),mdx(\"p\",null,\"Figura 9.35 - Identificaci\\xF3n de estad\\xEDsticas zonales en la caja de herramientas de procesamiento\"),mdx(\"p\",null,\"En la ventana que se ha abierto, seleccione los par\\xE1metros como en la figura 9.36. A medida que se calculan las estad\\xEDsticas, seleccione: recuento, suma, m\\xEDnimo y m\\xE1ximo.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig936.png\",alt:\"Setting the parameters for Zonal Statistics\",title:\"Setting the parameters for Zonal Statistics\"}))),mdx(\"p\",null,\"Figura 9.36 - Configuraci\\xF3n de los par\\xE1metros para Estad\\xEDsticas zonales\"),mdx(\"p\",null,\"La capa resultante es una capa vectorial que tiene como atributos las estad\\xEDsticas que hemos seleccionado (ver figura 9.37).\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig937.png\",alt:\"Resulting vector layer of Zonal Statistics\",title:\"Resulting vector layer of Zonal Statistics\"}))),mdx(\"p\",null,\"Figura 9.37 - Capa vectorial resultante de Estad\\xEDsticas zonales\"),mdx(\"p\",null,\"Y con este paso final, respondimos a nuestro ejercicio, cu\\xE1ntas personas (y d\\xF3nde) viven por debajo de los 200 m en la Estado de Jalisco.\"),mdx(\"h4\",e({},{id:\"preguntas-de-evaluaci\\xF3n-1\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#preguntas-de-evaluaci\\xF3n-1\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),mdx(\"strong\",{parentName:\"h4\"},\"Preguntas de evaluaci\\xF3n\")),mdx(\"ol\",null,mdx(\"li\",{parentName:\"ol\"},\"\\xBFSe pueden recortar los datos r\\xE1ster?\")),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"em\",{parentName:\"li\"},\"S\\xED.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"em\",{parentName:\"li\"},\"No.\"))),mdx(\"ol\",null,mdx(\"li\",{parentName:\"ol\"},\"\\xBFSe pueden usar conjuntos de datos vectoriales cargados en el proyecto QGIS en Raster Calculator?\")),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"em\",{parentName:\"li\"},\"S\\xED.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"em\",{parentName:\"li\"},\"No.\"))),mdx(\"ol\",null,mdx(\"li\",{parentName:\"ol\"},\"\\xBFSe pueden convertir conjuntos de datos r\\xE1ster en vectoriales?\")),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"em\",{parentName:\"li\"},\"S\\xED.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"em\",{parentName:\"li\"},\"No.\"))),mdx(\"h3\",e({},{id:\"fase-3-trabajo-con-datos-raster-y-vectoriales\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#fase-3-trabajo-con-datos-raster-y-vectoriales\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Fase 3: Trabajo con datos raster y vectoriales.\"),mdx(\"p\",null,\"En la fase anterior, hemos visto c\\xF3mo podemos procesar 2 conjuntos de datos r\\xE1ster para derivar nueva informaci\\xF3n. Hemos utilizado el modelo de superficie digital y la capa de asentamiento de alta resoluci\\xF3n para averiguar cu\\xE1ntas personas viven por debajo de los 200m en la provincia de Pampanga. Antes de hacer cualquier an\\xE1lisis, nos aseguramos de que los conjuntos de datos estuvieran en la misma proyecci\\xF3n y, adem\\xE1s, si los r\\xE1steres tienen la misma resoluci\\xF3n espacial para que los resultados que obtuvimos sean viables. Al referirse al sistema de referencia de coordenadas, el razonamiento es claro, pero \\xBFpor qu\\xE9 la misma resoluci\\xF3n espacial?\"),mdx(\"p\",null,\"Recordando la resoluci\\xF3n espacial, es el tama\\xF1o de la superficie del suelo medido en unidades de longitud, en otras palabras, el tama\\xF1o del p\\xEDxel medido en el suelo. Si un r\\xE1ster tiene una resoluci\\xF3n de 30 m, eso significa que el objeto lineal m\\xE1s peque\\xF1o que pudimos detectar en esa imagen es de 30 m, m\\xE1s peque\\xF1o y no pudimos detectarlo. Continuando con la analog\\xEDa, podemos compararla con la escala de un mapa. Si un mapa tiene una escala de 1: 25000, eso significa que 1 unidad de longitud en el mapa representa 25000 unidades en el suelo, es decir, 1 cm son 25000 cm, 1 cm en el mapa equivale a 250 m en el suelo. Por ejemplo, una carretera de 2 km tendr\\xEDa 8 cm en el mapa.\"),mdx(\"p\",null,\"\\xBFPor qu\\xE9 es tan importante cuando se trabaja con conjuntos de datos r\\xE1ster? La figura 9.38 podr\\xEDa ofrecer una explicaci\\xF3n.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig938.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.38 - Ejemplo de diferentes resoluciones espec\\xEDficas para diferentes im\\xE1genes satelitales - Landsat y SPOT - para la misma \\xE1rea\"),mdx(\"p\",null,\"(Cr\\xE9dito de la foto: Congedo, L. y Munaf\\xF2, M, (2013) Evaluaci\\xF3n del cambio de cobertura terrestre mediante sensores remotos: objetivos, m\\xE9todos y Resultados, Roma: Universidad Sapienza. Disponible en: \",mdx(\"a\",e({parentName:\"p\"},{href:\"http://www.planning4adaptation.eu/\"}),\"http://www.planning4adaptation.eu/ La\")),mdx(\"p\",null,\"Figura 9.38 detalla la relaci\\xF3n entre la resoluci\\xF3n de las im\\xE1genes satelitales y la informaci\\xF3n de cobertura terrestre extra\\xEDda de estas im\\xE1genes capturadas. Recuerde como detallamos al principio que el valor de la celda de p\\xEDxel se atribuye a toda el \\xE1rea que cubre, pero eso no significa que esa sea la realidad en el terreno. Estas representan decisiones tomadas por los expertos de EO que derivan varios productos basados \\u200B\\u200Ben im\\xE1genes de observaci\\xF3n de la Tierra, todos documentados en art\\xEDculos revisados \\u200B\\u200Bpor pares y descripciones de algoritmos. M\\xE1s explicaciones est\\xE1n m\\xE1s all\\xE1 del alcance de este m\\xF3dulo, pero es importante tener en cuenta la relaci\\xF3n entre lo que un sensor a bordo de un sat\\xE9lite captura y los productos que utilizamos.\"),mdx(\"p\",null,\"Volviendo a nuestra regi\\xF3n de inter\\xE9s, el Estado de Jalisco, podemos probar estas diferencias con los datos que tenemos a mano. Hemos cargado en nuestro proyecto QGIS las 5 capas r\\xE1ster de LandCover durante 5 a\\xF1os: 2015, 2016, 2017, 2018 y 2019. A continuaci\\xF3n, cargaremos un mosaico de im\\xE1genes Sentinel-2 [^ 6]. Cargaremos la capa WMS EOX Sentinel-2 sin nubes, disponible \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://s2maps.eu/\"}),\"aqu\\xED\"),\". Recordando el m\\xF3dulo 2, para agregar una capa WMS, vaya a Capa \\u2023 Agregar capa \\u2023 Agregar capa WMS / WMTS.\"),mdx(\"p\",null,\"Cuando se abra la ventana de agregar, use los siguientes par\\xE1metros:\"),mdx(\"pre\",null,mdx(\"code\",e({parentName:\"pre\"},{}),`Name: EOX Sentinel-2\nURL: https://tiles.maps.eox.at/wms?service=wms&request=getcapabilities\n`)),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig939.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.39 - Adici\\xF3n de una capa WMS a QGIS\"),mdx(\"p\",null,\"Despu\\xE9s de conectarnos a la capa WMS reci\\xE9n agregada, cargaremos la capa llamada Sentinel-2 cloudless layer para 2019 por EOX - 4326 en QGIS. Despu\\xE9s de hacer zoom a la extensi\\xF3n de la regi\\xF3n de inter\\xE9s, la ventana de su mapa deber\\xEDa verse como en la figura 9.40.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig940.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.40 - Capa sin nubes Sentinel-2 para 2019 por EOX - 4326 para el Estado de Jalisco\"),mdx(\"p\",null,\"Aunque los productos LandCover se han obtenido utilizando otros datos satelitales (Proba-V), compararemos las 2 capas para que podamos tener una idea de las diferentes resoluciones significar. Recuerde que el producto LandCover est\\xE1 a 100 m y las im\\xE1genes de Sentinel 2 a 10m. Para lograrlo, abriremos cortado_LandCover2019_5347 y la capa WMS. Para hacer comparaciones entre 2 capas, usaremos un nuevo plugin que deber\\xE1s instalar. Por lo tanto, vaya a Complementos \\u2023 administrar e instalar complementos y escriba en el cuadro de b\\xFAsqueda MapSwipe Tool. Una vez que lo instale, deber\\xEDa aparecer como un nuevo pictograma en su barra de herramientas ((\",mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/mapswipe-btn.png\",alt:\"MapSwipe Tool button\",title:\"MapSwipe Tool button\"})),\")).\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig941.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.41 - Comparaci\\xF3n de 2 capas r\\xE1ster usando el complemento de la herramienta MapSwipe\"),mdx(\"p\",null,\"Para activar la herramienta MapSwipe, haga clic en ella mientras la capa r\\xE1ster que desea cubrir est\\xE1 seleccionada en el Panel de capas. Las diferencias de resoluci\\xF3n son obvias, as\\xED como el hecho de que el producto de sat\\xE9lite (Land Cover) se ha desarrollado utilizando una imagen de sat\\xE9lite (PROBA-V) de una resoluci\\xF3n m\\xE1s gruesa. Sin embargo, las clases generales m\\xE1s grandes est\\xE1n bien identificadas, como se puede ver en la figura 9.42.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig942.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.42 - LandCover2019 obtenido de PROBA-V (100 m) y Sentinel 2 (30 m).\"),mdx(\"p\",null,\"Al agregar el HRSL al mapa, se mostrar\\xE1 una buena coincidencia entre HRSL y LandCover. El espacio urbano est\\xE1 representado en rojo y, como se puede ver en la figura 9.43, est\\xE1 cubierto casi por completo por la capa HRSL.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig943.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.43 - HRSL agregado en la parte superior de cortado_LandCover2019_5347.\"),mdx(\"p\",null,\"Sin embargo, al hacer zoom, puede ver la diferencia en la resoluci\\xF3n entre los 2 productos r\\xE1ster, como en la figura 9.44.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig944.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.44 - Diferencia en la resoluci\\xF3n espacial entre HRSL (30m - blanco) y cortado_LandCover2019 (100m - colores verde, naranja y violeta)\"),mdx(\"p\",null,\"Ahora, si se hiciera alg\\xFAn an\\xE1lisis usando estos r\\xE1steres, estos resultados no ser\\xEDan viables, porque estar\\xEDamos comparando valores que se aplican a diferentes resoluciones. Como fase de preprocesamiento, el usuario debe volver a muestrear uno de los 2 para que coincida.\"),mdx(\"p\",null,\"El remuestreo se refiere a cambiar los valores de celda debido a cambios en la cuadr\\xEDcula de celdas r\\xE1ster y solo hay 2 opciones: (1) el muestreo superior se refiere a los casos en los que estamos convirtiendo a celdas m\\xE1s peque\\xF1as / de mayor resoluci\\xF3n y (2) el muestreo reducido es un remuestreo a una resoluci\\xF3n m\\xE1s baja / tama\\xF1os de celda m\\xE1s grandes.\"),mdx(\"p\",null,\"Imaginemos el siguiente ejercicio. Necesitamos identificar los n\\xFAmeros de poblaci\\xF3n para cada categor\\xEDa de cobertura terrestre que hemos definido en la provincia de Pampanga. Como se explic\\xF3 anteriormente, necesitamos preprocesar los datos que tenemos para obtener resultados viables de nuestro an\\xE1lisis, es decir, en nuestro caso, necesitamos llevar nuestros dos conjuntos de datos r\\xE1ster a la misma resoluci\\xF3n espacial. Como se detalla anteriormente, podemos aumentar o disminuir las dimensiones de los p\\xEDxeles. Debe destacarse que volver a muestrear, con escala ascendente o descendente, implicar\\xE1 un proceso de interpolaci\\xF3n (consulte la p\\xE1gina 12 para obtener m\\xE1s detalles), por lo que el resultado introduce un error estad\\xEDstico. La pr\\xE1ctica habitual es volver a muestrear todos los r\\xE1steres para que se correspondan con el r\\xE1ster con la resoluci\\xF3n m\\xE1s baja, pero nuevamente esta decisi\\xF3n debe tomarse teniendo en cuenta todos los factores. Detallar el proceso de toma de decisiones para remuestrear capas r\\xE1ster excede con mucho el alcance de este plan de estudios.\"),mdx(\"p\",null,\"Debe destacarse una diferencia entre los 2 productos: el producto LandCover cubre toda el \\xE1rea de la extensi\\xF3n considerada, a diferencia del producto HSRL, donde la capa r\\xE1ster contiene estrictamente la celda donde existen valores superiores a 0. Esta situaci\\xF3n plantea problemas cuando se vuelven a muestrear los valores de las celdas de interpolaci\\xF3n, porque sin importar el m\\xE9todo de interpolaci\\xF3n elegido, eso tomar\\xEDa en consideraci\\xF3n los p\\xEDxeles circundantes, siguiendo un algoritmo espec\\xEDfico bien definido y, en esta situaci\\xF3n particular, los p\\xEDxeles de borde no est\\xE1n en el borde de la regi\\xF3n de estudio, pero dentro de ella. Por lo tanto, en nuestro caso de demostraci\\xF3n, consideraremos aumentar el muestreo del producto Land Cover de una resoluci\\xF3n de 100m a 30 m para que coincida con la resoluci\\xF3n del producto LandCover. El m\\xE9todo de remuestreo que elegimos es crucial, ya que los resultados pueden variar significativamente. Para fines de demostraci\\xF3n, volveremos a muestrear el producto LandCover utilizando 2 m\\xE9todos diferentes: Vecino m\\xE1s cercano y Modo.\"),mdx(\"p\",null,\"Para volver a muestrear, vaya a R\\xE1ster \\u2023 Proyecciones \\u2023 Ajustar (reproyectar). En la ventana de funcionalidad, configure los siguientes par\\xE1metros:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"capa de entrada: cortado_LandCover2019\"),mdx(\"li\",{parentName:\"ul\"},\"CRS de origen y CRS de destino: EPSG:4486,\"),mdx(\"li\",{parentName:\"ul\"},\"M\\xE9todo de remuestreo: Vecino m\\xE1s pr\\xF3ximo,\"),mdx(\"li\",{parentName:\"ul\"},\"Sin datos: 255, resoluci\\xF3n de archivo de salida: 30,\"),mdx(\"li\",{parentName:\"ul\"},\"Tipo de datos de salida: usar datos de capa de entrada tipo,\"),mdx(\"li\",{parentName:\"ul\"},\"extensi\\xF3n de georeferencia: seleccione la capa cortado_LandCover2019_4486.\")),mdx(\"p\",null,\"Guarde la capa de salida como LC2019_NearestNeighbour.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig945.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.45 - Remuestreo de la capa de Cobertura Terrestre\"),mdx(\"p\",null,\"Siga los pasos exactos, excepto que para el par\\xE1metro del m\\xE9todo de remuestreo elija Modo. Guarde la capa de salida como LC2019_Mode.\"),mdx(\"p\",null,\"Ahora, comparemos los resultados: consulte las figuras 9.45 y 9.46.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig946_a.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.46a - Producto de remuestreo de cobertura terrestre usando el m\\xE9todo de remuestreo del vecino m\\xE1s cercano\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig946_b.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.46b - Producto de remuestreo de cobertura terrestre usando el m\\xE9todo de remuestreo de modo\"),mdx(\"p\",null,\"Ambos r\\xE1steres tienen aplicada la misma simbolog\\xEDa y podemos observar que en la figura 9.45 hay valores que no caen en ninguna categor\\xEDa, los p\\xEDxeles no se muestran. Sin embargo, sabemos que el producto Land Cover es una capa uniforme: no tiene espacios entre las mismas categor\\xEDas definidas. Profundicemos y observemos los histogramas de las tres capas. Para eso, vaya a Propiedades \\u2023 Histograma y elija Prefs / Acciones para mostrar solo la Banda seleccionada. Guarde el histograma haciendo clic en el icono de guardar en el lado derecho de la ventana (consulte la figura 9.47).\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig947.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.47 - Mostrar valores solo para una banda seleccionada en el histograma.\"),mdx(\"p\",null,\"La figura 9.48 (a), (b) y (c) presenta los 3 histogramas de inter\\xE9s.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig948_a.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig948_b.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig948_c.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.48 - Histogramas de (a) cortado_LandCover2019_5347 (100m), (b) LC2019_NearestNeighbour y (c) LC2019_Mode\"),mdx(\"p\",null,\"Podemos observar las diferencias en la distribuci\\xF3n de valores para los 3 conjuntos de datos, \\xE9nfasis en (b), donde usamos el vecino m\\xE1s cercano m\\xE9todo de remuestreo, que resulta, como era de esperar, en valores de p\\xEDxeles calculados y, por lo tanto, da como resultado valores que no se corresponden con ning\\xFAn valor en el producto Land Cover (ver tabla 1, p\\xE1gina 7). De ah\\xED los espacios en blanco: p\\xEDxeles sin color asignado en la figura 9.45. Como se infiere, el m\\xE9todo de remuestreo de modo, o m\\xE9todo de remuestreo mayoritario, selecciona el valor que aparece con m\\xE1s frecuencia.\"),mdx(\"p\",null,\"En este punto, las ventanas de su mapa deber\\xEDan verse como en la figura 9.49.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig949.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.49 - Los 2 productos r\\xE1ster: Land Cover 2019 y HRSL superpuestos.\"),mdx(\"p\",null,\"Volviendo a nuestro ejercicio, los requisitos eran identificar los n\\xFAmeros de poblaci\\xF3n para cada categor\\xEDa de cobertura terrestre que hemos definido en la provincia de Pampanga. En este punto, hemos preprocesado nuestros datos r\\xE1ster, para tenerlos en el mismo sistema de coordenadas, con la misma resoluci\\xF3n espacial. Continuaremos con un algoritmo de conversi\\xF3n, transformaremos el dataset r\\xE1ster Land Cover en un dataset vectorial - tipo pol\\xEDgono. Esto nos permitir\\xE1 identificar m\\xE1s f\\xE1cilmente el recuento de poblaci\\xF3n para cada categor\\xEDa de cobertura terrestre.\"),mdx(\"p\",null,\"Para conversiones, de r\\xE1ster a pol\\xEDgono, as\\xED como de vector a pol\\xEDgono, vaya a R\\xE1ster \\u2023 Conversi\\xF3n y aqu\\xED tenemos m\\xE1s opciones. Elegiremos Polygonize (Raster to vector). Convertiremos a vector el \\xFAltimo dataset r\\xE1ster que hayamos obtenido: LC2019_Mode. Su resultado deber\\xEDa verse como en la figura 9.50b.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig950_a.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.50a - Poligonizaci\\xF3n de la capa r\\xE1ster LC2019_Mode (30m)\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig950_b.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.50b - Resultado de poligonizar la capa r\\xE1ster LC2019_Mode (30m)\"),mdx(\"p\",null,\"Como podemos observar, cada p\\xEDxel - cada grupo de p\\xEDxeles adyacentes con el mismo c\\xF3digo de categor\\xEDa (ver tabla 1, p\\xE1gina 7) se convirti\\xF3 en un pol\\xEDgono. Sin embargo, no estamos interesados \\u200B\\u200Ben cada regi\\xF3n distinta, sino en toda la categor\\xEDa. As\\xED, disolveremos la capa vectorial que hemos obtenido usando la identificaci\\xF3n de clase como atributo com\\xFAn (Vector \\u2023 Herramientas de geoprocesamiento \\u2023 Disolver - para m\\xE1s detalles, ver el m\\xF3dulo 8).\"),mdx(\"p\",null,\"Adjuntando el mismo estilo que para el r\\xE1ster, notaremos que las mismas clases vectoriales corresponden a las del r\\xE1ster (ver figura 9.51).\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig951.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.51 - LC2019_Mode poligonos\"),mdx(\"p\",null,\"Como podemos observar, los p\\xEDxeles de la HRSL, como se esperaba, no est\\xE1n perfectamente contenidos en un pol\\xEDgono del producto de cobertura terrestre (ver imagen 9.52).\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig952.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.52 - Discordancia de p\\xEDxeles HRSl y el conjunto de datos vectoriales de cobertura terrestre\"),mdx(\"p\",null,\"Para eliminar este inconveniente, tambi\\xE9n vectorizamos la capa HRSL, solo que esta vez transferiremos el valor de la celda del p\\xEDxel a un punto: el centro geom\\xE9trico de cada p\\xEDxel.\"),mdx(\"p\",null,\"Vaya a Procesamiento \\u2023 Caja de herramientas. En la barra de b\\xFAsqueda, escriba las palabras clave punto r\\xE1ster y elija el P\\xEDxeles r\\xE1ster a puntos algoritmo (consulte la figura 9.53a). Guarde la salida como HRSL_puntos.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig953_a.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.53a - P\\xEDxeles r\\xE1ster a puntos\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig953_b.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.53b - Ejecuci\\xF3n del algoritmo P\\xEDxeles r\\xE1ster a puntos\"),mdx(\"p\",null,\"Teniendo en cuenta la extensi\\xF3n de su \\xE1rea de estudio, esta operaci\\xF3n puede prolongarse significativamente en el tiempo. La Figura 9.54 muestra cu\\xE1ntos puntos hemos obtenido para la Estado de Jalisco.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig954.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.54 - Carga de datos vectoriales puntuales obtenidos\"),mdx(\"p\",null,\"El n\\xFAmero de caracter\\xEDsticas es considerablemente alto y sin importarlo a una base de datos, cualquier tipo de procesamiento o visualizaci\\xF3n requerir\\xEDa demasiado tiempo. En este tipo de situaciones, la soluci\\xF3n razonable es dividir los conjuntos de datos que tenemos que procesar en fragmentos manejables. Por lo tanto, consideraremos procesar los c\\xE1lculos necesarios en \\xE1reas m\\xE1s peque\\xF1as y bien definidas. Para dividir la capa HRSL usaremos la opci\\xF3n para crear un VRT. Seleccione la capa HRSL y elija Exportar como .. En la nueva ventana, marque la opci\\xF3n Crear VRT y configure los siguientes par\\xE1metros: busque una carpeta donde se exportar\\xE1 el r\\xE1ster dividido, CRS: EPSG: 5347, mosaicos VRT: m\\xE1x. columnas 1000, filas m\\xE1ximas: 1000 (consulte la figura 9.55).\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig955.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.55 - Creaci\\xF3n de un archivo VRT con mosaicos r\\xE1ster espec\\xEDficos\"),mdx(\"p\",null,\"Despu\\xE9s de exportar, cargue todos los mosaicos r\\xE1ster en su proyecto QGIS. El resultado deber\\xEDa verse como en la figura 9.56.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig956.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.56 - Mosaicos r\\xE1ster para la HRSL del departamento de Rosario \"),mdx(\"p\",null,\"A continuaci\\xF3n, volveremos a ejecutar el algoritmo de p\\xEDxeles r\\xE1ster a puntos para cada uno de los mosaicos r\\xE1ster. Debido a que tenemos varios mosaicos, usaremos la funci\\xF3n de procesamiento por lotes (ver figura 9.57).\",mdx(\"sup\",e({parentName:\"p\"},{id:\"fnref-1\"}),mdx(\"a\",e({parentName:\"sup\"},{href:\"#fn-1\",className:\"footnote-ref\"}),\"1\")),\" \"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig957.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.57 - Ejecuci\\xF3n de r\\xE1ster a puntos para todos los mosaicos r\\xE1ster\"),mdx(\"p\",null,\"Los puntos vectoriales resultantes deben verse como en la figura 9.58.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig958.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.58 - Conjunto de datos de vectores de puntos para la capa HRSL con valores de p\\xEDxeles almacenados en la columna VALOR\"),mdx(\"p\",null,\"Al observar m\\xE1s de cerca los resultados del algoritmo, podemos ver que los puntos vectoriales caen exactamente en el centro del p\\xEDxel del que extraen el valor ( ver figura 9.59.).\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig959.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.59 - Verificaci\\xF3n de los valores de los datos vectoriales de puntos frente a los valores de los p\\xEDxeles de la trama\"),mdx(\"p\",null,\"Para resolver el ejercicio, se debe calcular la suma de los valores de los puntos extra\\xEDdos del producto HRSL que se encuentran dentro de cada pol\\xEDgono del producto de cobertura terrestre. Para hacer eso, usaremos una funci\\xF3n que est\\xE1 disponible en la Calculadora de campo: aggregate(). Esta funci\\xF3n es bastante poderosa ya que hace uniones espaciales sobre la marcha permitiendo varios c\\xE1lculos. En nuestro caso, la funci\\xF3n debe identificar los puntos que caen en cada pol\\xEDgono y luego sumar los valores de esos puntos. Para hacer eso, vaya a la tabla de atributos del conjunto de datos vectoriales LC2019_Mode\",mdx(\"sup\",e({parentName:\"p\"},{id:\"fnref-2\"}),mdx(\"a\",e({parentName:\"sup\"},{href:\"#fn-2\",className:\"footnote-ref\"}),\"2\")),\" y abra la calculadora de campo. Creando un nuevo campo, introduzca la siguiente expresi\\xF3n:\"),mdx(\"p\",null,`aggregate(\nlayer:= 'hrsl_rosario1',\naggregate:='sum',\nexpression:=VALUE,\nfilter:=intersects($geometry, geometry(@parent))`),mdx(\"p\",null,\")\"),mdx(\"p\",null,\"Donde capa es el nombre del conjunto de datos del que queremos extraer informaci\\xF3n (en nuestro caso, el conjunto de datos puntuales que contiene los valores de p\\xEDxeles de la capa r\\xE1ster HRSL), agregado: indica la acci\\xF3n que se realizar\\xE1 una vez que se confirme la uni\\xF3n espacial (suma, recuento, media, mediana, concatenar, etc.), expresi\\xF3n: indica de qu\\xE9 columna queremos extraer datos, filtro: indica la funci\\xF3n de geometr\\xEDa (intersecci\\xF3n, dentro, etc.) (ver figura 9.60).\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig960.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.60 - Uso de funciones integradas con calculadora de campo\"),mdx(\"p\",null,\"Los resultados, como se esperaba, se guardan en la tabla de atributos del LC2019_Mode. Y as\\xED, se ha completado el ejercicio.\"),mdx(\"p\",null,\"\\xA1Por favor, tenga cuidado! \\xA1Este \\xFAltimo paso puede ser excesivamente largo dependiendo del volumen de sus datos! Pruebe para encontrar sus mejores dimensiones de mosaico.\"),mdx(\"p\",null,\"Si usa la Calculadora de campo y la funci\\xF3n agregada no funciona, tambi\\xE9n podemos usar el algoritmo Unir atributos por ubicaci\\xF3n (resumen) para calcular la suma de los valores de los puntos dentro de las caracter\\xEDsticas LC_Mode_vector.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig961.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.61 - Par\\xE1metros del algoritmo Unir atributos por ubicaci\\xF3n (resumen)\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/mexico/module9/media/fig962.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Figura 9.62 - Salida del algoritmo Unir atributos por ubicaci\\xF3n (resumen)\"),mdx(\"p\",null,'En esta tercera fase de nuestro m\\xF3dulo 9, hemos trabajado con raster, as\\xED como con datos vectoriales. Hemos analizado m\\xE1s de cerca lo que significa el remuestreo y cu\\xE1les son las implicaciones de las caracter\\xEDsticas de los r\\xE1steres, como el sistema de referencia de coordenadas, la resoluci\\xF3n espacial, etc. La mayor\\xEDa de las veces, se debe trabajar con conjunto de datos r\\xE1ster y vectoriales y, por lo tanto, es importante saber que es posible de varias formas. Tambi\\xE9n probamos varias conversiones, de r\\xE1ster a vector y viceversa. Sin embargo, en nuestro procesamiento no debemos perder de vista los fen\\xF3menos que estamos estudiando, as\\xED como la escala inicial a la que se han recolectado los datos, ya sea vectorial o raster. Al realizar conversiones, es importante conocer la correspondencia entre la escala de un mapa y la resoluci\\xF3n de la trama. Seg\\xFAn el cart\\xF3grafo Waldo Tobler \\u201Cla regla es dividir el denominador de la escala del mapa por 1000 para obtener el tama\\xF1o detectable en metros. La resoluci\\xF3n es la mitad de esta cantidad \". En otras palabras, la f\\xF3rmula ser\\xEDa: escala del mapa = resoluci\\xF3n de la trama (en m) X 2 X 1000.'),mdx(\"p\",null,\"Las soluciones dadas a nuestros ejercicios en este m\\xF3dulo, como tambi\\xE9n en el m\\xF3dulo 8, son solo una forma de resolver los requisitos. A medida que se avanza en el estudio de las herramientas de c\\xF3digo abierto para geoespacial, se descubre que hay varias posibilidades de llegar al mismo resultado, algunas mejores que otras.\"),mdx(\"h4\",e({},{id:\"preguntas-de-evaluaci\\xF3n-2\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#preguntas-de-evaluaci\\xF3n-2\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Preguntas de evaluaci\\xF3n\"),mdx(\"ol\",null,mdx(\"li\",{parentName:\"ol\"},\"\\xBFCu\\xE1l es el nombre del proceso mediante el cual la resoluci\\xF3n de un dataset r\\xE1ster se puede aumentar o disminuir?\")),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Remuestreo.\")),mdx(\"ol\",null,mdx(\"li\",{parentName:\"ol\"},\"\\xBFQu\\xE9 nos muestra un histograma?\")),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"La frecuencia de los valores de los p\\xEDxeles, organizados en rangos de valores adyacentes.\")),mdx(\"ol\",null,mdx(\"li\",{parentName:\"ol\"},\"\\xBFSe puede convertir un dataset r\\xE1ster en un pol\\xEDgono? \\xBFQu\\xE9 acerca del otro camino alrededor?\")),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"S\\xED y s\\xED.\")),mdx(\"h2\",e({},{id:\"referencias\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#referencias\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Referencias:\"),mdx(\"p\",null,\"Centro para la Red Internacional de Informaci\\xF3n sobre Ciencias de la Tierra - CIESIN - Universidad de Columbia. 2018. Gridded Population of the World, Versi\\xF3n 4 (GPWv4): Densidad de poblaci\\xF3n, Revisi\\xF3n 11. Palisades, NY: Centro de Aplicaciones y Datos Socioecon\\xF3micos de la NASA (SEDAC). \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://doi.org/10.7927/H49C6VHW\"}),\"https://doi.org/10.7927/H49C6VHW\"),\".\"),mdx(\"p\",null,\"M\\xE9todos de remuestreo: \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://gisgeography.com/raster-resampling/\"}),\"https://gisgeography.com/raster-resampling/\")),mdx(\"h2\",e({},{id:\"notas\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#notas\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Notas\"),mdx(\"p\",null,\"[^ 1]: Una operaci\\xF3n primitiva es un c\\xE1lculo b\\xE1sico realizado por un algoritmo.\"),mdx(\"p\",null,\"[^ 2]: la resoluci\\xF3n temporal depende de la latitud. \"),mdx(\"p\",null,\"[^ 3]: JAXA es la Agencia de Exploraci\\xF3n Aeroespacial de Jap\\xF3n \"),mdx(\"p\",null,\"[^ 4]: Por el bien de este ejercicio, consideraremos el DSM como un modelo de elevaci\\xF3n digital. Para obtener m\\xE1s detalles sobre las diferencias, consulte la secci\\xF3n Desglose de conceptos \"),mdx(\"p\",null,\"[^ 5]: La Biblioteca de abstracci\\xF3n de datos geoespaciales (GDAL) es una biblioteca de software de computadora para leer y escribir formatos de datos geoespaciales raster y vectoriales. \"),mdx(\"p\",null,\"[^ 6]: Sentinel-2 es una misi\\xF3n de observaci\\xF3n de la Tierra del Programa Copernicus que adquiere sistem\\xE1ticamente im\\xE1genes \\xF3pticas a alta resoluci\\xF3n espacial (10 ma 60 m) sobre tierra y aguas costeras. Para m\\xE1s detalles, vaya \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://sentinel.esa.int/web/sentinel/missions/sentinel-2\"}),\"aqu\\xED\"),\".\"),mdx(\"h2\",e({},{id:\"notes\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#notes\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Notes\"),mdx(\"div\",e({},{className:\"footnotes\"}),mdx(\"hr\",{parentName:\"div\"}),mdx(\"ol\",{parentName:\"div\"},mdx(\"li\",e({parentName:\"ol\"},{id:\"fn-1\"}),\" Se recomienda hacer el proceso por lotes en s\\xF3lo una porci\\xF3n del territorio de la provincia para evitar procesar demasiadas capas (Departamento de Rosario)\",mdx(\"a\",e({parentName:\"li\"},{href:\"#fnref-1\",className:\"footnote-backref\"}),\"\\u21A9\")),mdx(\"li\",e({parentName:\"ol\"},{id:\"fn-2\"}),\" Se puede usar un recorte por departamento al igual que los p\\xEDxel a raster\",mdx(\"a\",e({parentName:\"li\"},{href:\"#fnref-2\",className:\"footnote-backref\"}),\"\\u21A9\")))))}MDXContent.isMDXComponent=!0;\n","scope":{"slug":"mexico","title":"mexico","language":"spanish","description":"Mdulo 9 - Procesamiento y anlisis de rster","date":"","author":"Codrina","prev":"/es/mexico/module/module8","next":"","mods":["Introduccin suave a los conceptos de SIG (Sistema de Informacin Geogrfica)[/es/mexico/module/module0]","Introduccin to QGIS[/es/mexico/module/module1]","Capas (capas) en QGIS[/es/mexico/module/module2]","OpenStreetMap y la Capa de Alta Resolucin de Asentamientos[/es/mexico/module/module3]","Mdulo 4 - Estilo de Capas (Styling Layers)[/es/mexico/module/module4]","Creacin de mapas[/es/mexico/module/module5]","Atributos de capa[/es/mexico/module/module6]","Creacin y edicin de capas[/es/mexico/module/module7]","Procesamiento y anlisis de vectores[/es/mexico/module/module8]","Procesamiento y anlisis de rster[/es/mexico/module/module9]"]}},"frontMatter":{"slug":"mexico","title":"mexico","language":"spanish","description":"Mdulo 9 - Procesamiento y anlisis de rster","date":"","author":"Codrina","prev":"/es/mexico/module/module8","next":"","mods":["Introduccin suave a los conceptos de SIG (Sistema de Informacin Geogrfica)[/es/mexico/module/module0]","Introduccin to QGIS[/es/mexico/module/module1]","Capas (capas) en QGIS[/es/mexico/module/module2]","OpenStreetMap y la Capa de Alta Resolucin de Asentamientos[/es/mexico/module/module3]","Mdulo 4 - Estilo de Capas (Styling Layers)[/es/mexico/module/module4]","Creacin de mapas[/es/mexico/module/module5]","Atributos de capa[/es/mexico/module/module6]","Creacin y edicin de capas[/es/mexico/module/module7]","Procesamiento y anlisis de vectores[/es/mexico/module/module8]","Procesamiento y anlisis de rster[/es/mexico/module/module9]"]},"isInRequestedLanguage":true,"_nextI18Next":{"initialI18nStore":{"es":{"countrylevel":{"language":"IDIOMA","region":"REGIN","next":"Prximo","back":"Atrs","content_page":"Pagina de contenido","outlines":"Contornos","content_menu":"Men de contenido","back_to_home":"Volver a la pgina de inicio"}},"en":{"countrylevel":{"language":"LANGUAGE","region":"REGION","next":"Next","back":"Back","content_page":"Contents Page","outlines":"Outlines","content_menu":"Content Menu","back_to_home":"Back to Home Page"}}},"initialLocale":"es","userConfig":{"i18n":{"defaultLocale":"en","locales":["en","ar","es"],"defaultCountry":"philippines","countries":["philippines","united-arab-emirates","mexico"]},"reloadOnPrerender":true,"default":{"i18n":{"defaultLocale":"en","locales":["en","ar","es"],"defaultCountry":"philippines","countries":["philippines","united-arab-emirates","mexico"]},"reloadOnPrerender":true}}}},"__N_SSG":true}