{
  "welcome_to": "Willkommen auf der Open GIS-Curriculum-Website der School of Data",
  "welcome_sub_description": "So können Sie die auf dieser Website verfügbaren Lernmaterialien verwenden:",
  "localization_available": "Verfügbare Lokalisierungen:",
  "projects_showcase": "Projektpräsentation:",
  "select_language": "Sprache auswählen",
  "select_lang_homepage": "Wählen Sie die Sprache der Startseite aus",
  "select_curriculum": "Wählen Sie die Lehrplanlokalisierung aus",
  "select_curriculum_view": "Wählen Sie den Studienplan aus, den Sie anzeigen möchten",
  "select_localization": "Wählen Sie Lokalisierung",
  "read_more": "Weiterlesen",
  "view_all_showcase": "Alle Projektpräsentationen anzeigen",
  "filters": "Filter",
  "site_title": "Open Geodata Training Curriculum",
  "site_desc": "Data for Good at Meta hat sich mit der Open Knowledge Foundation zusammengetan, um eine Schulung zu entwerfen, zu entwickeln und durchzuführen, die sich darauf konzentriert, wie Regierungen und gemeinnützige Organisationen auf der ganzen Welt kostenlose und offene Geodaten und Geosoftware nutzen können. Diese Website enthält einen Schulungslehrplan, der auf dem leistungsstarken kostenlosen und Open-Source-GIS QGIS basiert, um zu lernen, wie man kostenlose und offene Geodaten wie OpenStreetMap (OSM) und Metas High Resolution Settlement Layer (HRSL) nutzt. Der Lehrplan ist für 16 Länder lokalisiert und in 7 Sprachen verfügbar (Amharisch, Arabisch, Englisch, Deutsch, Portugiesisch, Spanisch und Vietnamesisch). Sie können unten die Sprache und die Länderlokalisierung auswählen.",
  "site_desc2": "Auf der Showcase-Seite finden Sie auch Beispielprojekte, die von Personen erstellt wurden, die anhand des Lehrplans geschult wurden.",
  "country" : "Land",
  "language" : "Sprache",
  "themes_keywords" : "Themen und Schlüsselwörter",
  "algorithms" : "Algorithmen",
  "tools" : "Werkzeug",
  "author": "Autoren",
  "project_summary": "Projektübersicht",
  "datasets": "Datensätze",
  "read_full_report": "Vollständigen Bericht lesen",
  "clear_all_filters": "Alle Filter löschen"
}