{"pageProps":{"_nextI18Next":{"initialI18nStore":{"es":{"common":{"welcome_to":"Bienvenido al sitio web del plan de estudios SIG abierto de School of Data","welcome_sub_description":"Así es como puede utilizar los materiales de aprendizaje disponibles en este sitio:","localization_available":"Ubicaciones disponibles:","projects_showcase":"Escaparate de proyectos:","select_language":"Seleccione el idioma","select_lang_homepage":"Seleccione el idioma de la página de inicio","select_curriculum":"Seleccione la localización del plan de estudios","select_curriculum_view":"Seleccione el plan de estudios que desea ver","select_localization":"Seleccionar localización","read_more":"Lee mas","view_all_showcase":"Ver todos los escaparates de proyectos","filters":"filtros","site_title":"Plan de estudios de formación de geodatos abiertos","site_desc":"Data for Good at Meta se asoció con Open Knowledge Foundation para diseñar, desarrollar y brindar una capacitación centrada en cómo los gobiernos y las organizaciones sin fines de lucro de todo el mundo pueden utilizar datos geoespaciales y software geoespacial gratuitos y abiertos. Este sitio web contiene un plan de estudios de capacitación creado en torno al potente SIG gratuito y de código abierto, QGIS, para aprender a utilizar datos geoespaciales gratuitos y abiertos como OpenStreetMap (OSM) y la capa de liquidación de alta resolución (HRSL) de Meta. El plan de estudios está localizado para 16 países y está disponible en 7 idiomas (amárico, árabe, inglés, alemán, portugués, español y vietnamita). Puede seleccionar el idioma y la localización del país a continuación.","site_desc2":"También puede encontrar proyectos de muestra realizados por personas capacitadas utilizando el plan de estudios en la página de presentación.","country":"País","language":"Idioma","themes_keywords":"Palabras clave del tema","algorithms":"Algoritmos","tools":"Instrumentos","author":"Autores","project_summary":"Resumen del proyecto","datasets":"conjuntos de datos","read_full_report":"Leer informe completo","clear_all_filters":"Borrar todos los filtros"}},"en":{"common":{"welcome_to":"Welcome to School of Data Open GIS Curriculum Website","welcome_sub_description":"Here is how you can use the learning materials available on this site:","localization_available":"Localisations available:","projects_showcase":"Projects showcase:","select_language":"Select Language","select_lang_homepage":"Select the language of the homepage","select_curriculum":"Select curriculum localization","select_curriculum_view":"Select the curriculum you want to view","select_localization":"Select Localization","read_more":"Read More","view_all_showcase":"View all Project Showcase","filters":"Filters","site_title":"Open Geodata Training Curriculum","site_desc":"Data for Good at Meta has partnered with the Open Knowledge Foundation to design, develop, and deliver a training focused on how governments and nonprofits around the world can utilise free and open geospatial data and geospatial software. This website contains a training curriculum built around the powerful free and open source GIS, QGIS, for learning how to utilize free and open geospatial data such as OpenStreetMap (OSM) and Meta's High Resolution Settlement Layer (HRSL). The curriculum is localized for 16 countries and available in 7 languages (Amharic, Arabic, English, German, Portuguese, Spanish, and Vietnamese). You can select the language and country localization below.","site_desc2":"You can also find sample projects made by those trained using the curriculum in the Showcase Page.","country":"Country","language":"Language","themes_keywords":"Theme Keywords","algorithms":"Algorithms","tools":"Tools","author":"Authors","project_summary":"Project Summary","datasets":"Datasets","read_full_report":"Read full report","clear_all_filters":"Clear All filters"}}},"initialLocale":"es","userConfig":{"i18n":{"defaultLocale":"en","locales":["en","ar","es"],"defaultCountry":"philippines","countries":["kenya","mexico","philippines","united-arab-emirates"]},"reloadOnPrerender":true,"default":{"i18n":{"defaultLocale":"en","locales":["en","ar","es"],"defaultCountry":"philippines","countries":["kenya","mexico","philippines","united-arab-emirates"]},"reloadOnPrerender":true}}}},"__N_SSG":true}