{"pageProps":{"source":{"compiledSource":"var p=Object.defineProperty,u=Object.defineProperties;var m=Object.getOwnPropertyDescriptors;var r=Object.getOwnPropertySymbols;var n=Object.prototype.hasOwnProperty,t=Object.prototype.propertyIsEnumerable;var l=(a,o,i)=>o in a?p(a,o,{enumerable:!0,configurable:!0,writable:!0,value:i}):a[o]=i,e=(a,o)=>{for(var i in o||(o={}))n.call(o,i)&&l(a,i,o[i]);if(r)for(var i of r(o))t.call(o,i)&&l(a,i,o[i]);return a},d=(a,o)=>u(a,m(o));var c=(a,o)=>{var i={};for(var s in a)n.call(a,s)&&o.indexOf(s)<0&&(i[s]=a[s]);if(a!=null&&r)for(var s of r(a))o.indexOf(s)<0&&t.call(a,s)&&(i[s]=a[s]);return i};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(i){var s=i,{components:a}=s,o=c(s,[\"components\"]);return mdx(MDXLayout,d(e(e({},layoutProps),o),{components:a,mdxType:\"MDXLayout\"}),mdx(\"h1\",e({},{id:\"m\\xF3dulo-8---procesamiento-y-an\\xE1lisis-de-vectores\"}),mdx(\"a\",e({parentName:\"h1\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#m\\xF3dulo-8---procesamiento-y-an\\xE1lisis-de-vectores\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"M\\xF3dulo 8 - Procesamiento y an\\xE1lisis de vectores\"),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"Autor:\"),\" Codrina Ilie\"),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"Editor:\"),\" Ben Hur Pintor\"),mdx(\"h2\",e({},{id:\"introducci\\xF3n-pedag\\xF3gica\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#introducci\\xF3n-pedag\\xF3gica\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Introducci\\xF3n pedag\\xF3gica\"),mdx(\"p\",null,\"Este m\\xF3dulo se centra en un tipo espec\\xEDfico de modelo de datos geogr\\xE1ficos: geodatos vectoriales.\"),mdx(\"p\",null,\"Al final de este m\\xF3dulo, los alumnos tendr\\xE1n la comprensi\\xF3n b\\xE1sica de los siguientes conceptos:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"modelo de datos vectoriales\"),mdx(\"li\",{parentName:\"ul\"},\"metadatos\"),mdx(\"li\",{parentName:\"ul\"},\"procesamiento de vectores\"),mdx(\"li\",{parentName:\"ul\"},\"an\\xE1lisis de datos espaciales\"),mdx(\"li\",{parentName:\"ul\"},\"geoestad\\xEDstica\"),mdx(\"li\",{parentName:\"ul\"},\"topolog\\xEDa\"),mdx(\"li\",{parentName:\"ul\"},\"geoprocesamiento\")),mdx(\"p\",null,\"Tambi\\xE9n adquirir\\xE1n las siguientes habilidades:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Verificaci\\xF3n de la calidad del conjunto de datos vectoriales geom\\xE9tricos usando algoritmos para verificar la topolog\\xEDa de datos vectoriales y realizar correcciones autom\\xE1ticas b\\xE1sicas;\"),mdx(\"li\",{parentName:\"ul\"},\"Trabajar con algoritmos para identificar errores en la tabla de atributos;\"),mdx(\"li\",{parentName:\"ul\"},\"Procesamiento de datos vectoriales: \\xBFejecutar algoritmos de geoprocesamiento simples para responder a los requisitos potenciales, como cu\\xE1ntos edificios p\\xFAblicos hay en mi regi\\xF3n administrativa?\"),mdx(\"li\",{parentName:\"ul\"},\"Procesamiento de datos vectoriales: uso de algoritmos geoestad\\xEDsticos para completar los datos faltantes.\")),mdx(\"h2\",e({},{id:\"herramientas-y-recursos-necesarios\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#herramientas-y-recursos-necesarios\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Herramientas y recursos necesarios\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Este m\\xF3dulo se ha preparado utilizando \",mdx(\"a\",e({parentName:\"li\"},{href:\"https://qgis.org/en/site/forusers/download.html\"}),\"QGIS versi\\xF3n 3.16 - Hannover\")),mdx(\"li\",{parentName:\"ul\"},\"module8.gpkg which contains the following layers:\",mdx(\"ul\",{parentName:\"li\"},mdx(\"li\",{parentName:\"ul\"},\"pois (point)\"),mdx(\"li\",{parentName:\"ul\"},\"pofw (point)\"),mdx(\"li\",{parentName:\"ul\"},\"road (line)\"),mdx(\"li\",{parentName:\"ul\"},\"waterways (line)\"),mdx(\"li\",{parentName:\"ul\"},\"buildings (polygon)\"),mdx(\"li\",{parentName:\"ul\"},\"landuse (polygon)\"),mdx(\"li\",{parentName:\"ul\"},\"admin_boundary (polygon)\"))),mdx(\"li\",{parentName:\"ul\"},\"El sistema de referencia de coordenadas utilizado es el PRS92 / Filipinas zona 3, EPSG 3123. Al ser un sistema de coordenadas proyectadas, permite c\\xE1lculos geom\\xE9tricos.\")),mdx(\"h2\",e({},{id:\"requisitos-previos\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#requisitos-previos\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Requisitos previos\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Conocimientos b\\xE1sicos de funcionamiento de una computadora\"),mdx(\"li\",{parentName:\"ul\"},\"Una s\\xF3lida comprensi\\xF3n de los m\\xF3dulos 0, 1 y 2 y 6 de este plan de estudios. El m\\xF3dulo 0 introduce la noci\\xF3n de modelo de datos vectoriales que es el n\\xFAcleo de esta secci\\xF3n actual. La comprensi\\xF3n previa de los m\\xF3dulos 1, 2 y 6 le permite concentrarse estrictamente en las nuevas nociones y funcionalidades de QGIS introducidas en esta nueva secci\\xF3n, sin tener que preguntarse c\\xF3mo podr\\xEDa cargar una nueva capa en su proyecto o c\\xF3mo trabajar con la tabla de atributos de su conjunto de datos.\")),mdx(\"p\",null,\"Como parte de este m\\xF3dulo, aprender\\xE1 a trabajar de manera eficiente con conjuntos de datos geogr\\xE1ficos vectoriales para poder extraer nueva informaci\\xF3n. Esto incluye una comprensi\\xF3n m\\xE1s profunda de qu\\xE9 son los datos vectoriales, qu\\xE9 est\\xE1ndares de calidad deben cumplir para que sean realmente \\xFAtiles, cu\\xE1les son las operaciones m\\xE1s comunes que se realizan con datos vectoriales (geoprocesamiento, geoestad\\xEDstica).\"),mdx(\"h2\",e({},{id:\"recursos-adicionales\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#recursos-adicionales\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Recursos adicionales:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",e({parentName:\"li\"},{href:\"https://docs.qgis.org/latest/en/docs/user_manual/working_with_vector/functions_list.html\"}),\"https://docs.qgis.org/latest/en/docs/user_manual/working_with_vector/functions_list.html\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",e({parentName:\"li\"},{href:\"http://www.geo.hunter.cuny.edu/~jochen/gtech361/lectures/lecture12/concepts/01%20What%20is%20geoprocessing.htm\"}),\"http://www.geo.hunter.cuny.edu/~jochen/gtech361/lectures/lecture12/concepts /01%20What%20is%20geoprocessing.htm\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",e({parentName:\"li\"},{href:\"https://link.springer.com/referencework/10.1007/978-3-319-17885-1\"}),\"Enciclopedia de SIG, Edici\\xF3n 2017, Editores: Shashi Shekhar, Hui Xiong, Xun Zhou\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",e({parentName:\"li\"},{href:\"https://www.geo-train.eu/modules/metadata/pdf/Metadata.pdf\"}),\"Metadata And Catalog Services\"),\", autora Mariana Belgiu, UNIGIS Salzburg;\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",e({parentName:\"li\"},{href:\"https://www.fgdc.gov/resources/factsheets/documents/GeospatialMetadata-July2011.pdf\"}),\"Conceptos b\\xE1sicos de metadatos\"),\" del Comit\\xE9 Federal de Datos Geogr\\xE1ficos;\")),mdx(\"h2\",e({},{id:\"introducci\\xF3n-tem\\xE1tica\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#introducci\\xF3n-tem\\xE1tica\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Introducci\\xF3n tem\\xE1tica\"),mdx(\"p\",null,\"Comencemos con un ejemplo: acabas de aterrizar para tu escapada urbana a Rosario, Santa F\\xE9, Argentina y necesitas ir del aeropuerto a su hotel. No tienes conocimiento de d\\xF3nde se encuentra el aeropuerto con respecto a la ciudad, ni d\\xF3nde est\\xE1 el hotel, por lo que lo primero que debes hacer es abrir un mapa que te ayude a navegar por esta nueva y excitante ciudad. Sacas tu tel\\xE9fono, abres una aplicaci\\xF3n de mapas y seleccionas el punto de inicio - el aeropuerto - y el punto final - tu hotel - luego preguntas por la ruta, a pie, en coche o en transporte p\\xFAblico. En cuesti\\xF3n de segundos, la aplicaci\\xF3n de enrutamiento te ofrece la mejor soluci\\xF3n para que puedas ir del punto A al punto B y lo resalta trazando una l\\xEDnea distinta siguiendo las calles y callejones, como se ve en la figura 8.1.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig81.png\",alt:\"Getting from point A to B using Openstreetmap\",title:\"Getting from point A to B using Openstreetmap\"}))),mdx(\"p\",null,\"Figura 8.1 - Ir del punto A al B usando Openstreetmap\"),mdx(\"h2\",e({},{id:\"desglose-de-los-conceptos\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#desglose-de-los-conceptos\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Desglose de los conceptos\"),mdx(\"p\",null,\"Este es un ejemplo cl\\xE1sico del uso de datos vectoriales y se divide en varios conceptos que definiremos a continuaci\\xF3n.\"),mdx(\"p\",null,\"Los datos utilizados son espaciales: tiene una ubicaci\\xF3n muy bien definida en la Tierra, sus atributos tambi\\xE9n est\\xE1n bien identificados. Por lo tanto, un punto con longitud y latitud y el nombre de atributo = Aeropuerto Internacional de Clark - representa el punto de inicio A y un punto con otro par de longitud y latitud y el nombre de atributo = Hotel Boss representa el punto final B. Las calles est\\xE1n representadas por l\\xEDneas compuesto por segmentos y v\\xE9rtices (representados por peque\\xF1os c\\xEDrculos azules en la figura 8.2), con atributos como nombre, direcci\\xF3n, limitaci\\xF3n de velocidad, etc.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig82.png\",alt:\"Vector lines representing streets and the associated attribute table\",title:\"Vector lines representing streets and the associated attribute table\"}))),mdx(\"p\",null,\"Figura 8.2 - L\\xEDneas vectoriales que representan calles y la tabla de atributos asociada. Las calles representan un modelo de red que es b\\xE1sicamente una colecci\\xF3n de entidades puntuales y lineales topol\\xF3gicamente interconectadas. Los resultados del algoritmo que calcula la ruta del punto A al punto B - en nuestro caso del aeropuerto al hotel - dependen en gran medida de la calidad de los vectores, tanto en geometr\\xEDa - se respetan las reglas de topolog\\xEDa - como en atributos - si una carretera es unidireccional y debe indicarse para que la ruta no lo lleve por el camino equivocado.\"),mdx(\"h3\",e({},{id:\"el-modelo-de-datos-vectoriales\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#el-modelo-de-datos-vectoriales\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"El modelo de datos vectoriales\"),mdx(\"p\",null,\"Como se present\\xF3 en el m\\xF3dulo 0, hay 2 modelos de datos utilizados en un sistema de informaci\\xF3n geogr\\xE1fica: SIG: raster y vectorial. Los datos geoespaciales siempre incluyen un componente espacial que indica la ubicaci\\xF3n o la distribuci\\xF3n espacial del fen\\xF3meno en cuesti\\xF3n y un componente de atributo que describe sus propiedades. La elecci\\xF3n entre utilizar el modelo de datos r\\xE1ster o vectorial para una situaci\\xF3n particular depende de la fuente de los datos, as\\xED como de su uso previsto.\"),mdx(\"p\",null,\"El modelo de datos vectoriales se utiliza para representar \\xE1reas, l\\xEDneas y puntos (Figura 8.3).\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig83.png\",alt:\"vector data with attribute table\",title:\"vector data with attribute table\"}))),mdx(\"p\",null,\"Figura 8.3 - Datos vectoriales con tabla de atributos\"),mdx(\"h3\",e({},{id:\"metadatos\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#metadatos\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Metadatos\"),mdx(\"p\",null,\"Los metadatos se definen m\\xE1s simplemente como datos sobre datos. Caracterizan, en diferentes niveles de detalle, el conjunto de datos al que est\\xE1n asociados, incluyendo categor\\xEDas como: qui\\xE9n es el proveedor / propietario del conjunto de datos, cu\\xE1l es la licencia, en qu\\xE9 idioma est\\xE1n escritos los atributos, cu\\xE1l era el sistema de coordenadas utilizado, qu\\xE9 \\xE1rea geogr\\xE1fica describe y cu\\xE1l es el a\\xF1o de referencia, palabras clave, cu\\xE1les son las limitaciones conocidas, nivel de precisi\\xF3n, cu\\xE1l era el alcance original del conjunto de datos y muchos m\\xE1s.\"),mdx(\"p\",null,\"Los metadatos son primordiales porque una comprensi\\xF3n clara de los datos que se utilizar\\xE1n en un an\\xE1lisis espec\\xEDfico puede marcar la diferencia entre una decisi\\xF3n correcta o sesgada. Si uno debe identificar d\\xF3nde colocar un nuevo hospital temporal, pero los datos de la carretera son antiguos y ya no reflejan la realidad en el sitio, entonces cualquier decisi\\xF3n basada en ellos ser\\xE1 inexacta.\"),mdx(\"p\",null,\"Debido a la importancia de los metadatos, sus categor\\xEDas (sus definiciones, nombre, qu\\xE9 tipo de informaci\\xF3n pueden almacenar, etc.) siguen estructuras bien definidas y estandarizadas. Estos archivos de metadatos bien estructurados pueden luego integrarse en cat\\xE1logos dedicados, lo que permite a un usuario buscar y encontrar datos geogr\\xE1ficos solo consultando las caracter\\xEDsticas que le interesan, sin descargar y analizar los datos por s\\xED misma. Existen numerosos cat\\xE1logos de metadatos y, cuando est\\xE1n estandarizados, se puede acceder a ellos a trav\\xE9s de diferentes funcionalidades dentro del software SIG. Un ejemplo de eso se presentar\\xE1 en el M\\xF3dulo 9 Complementos de QGIS.\"),mdx(\"p\",null,\"Hay que decir que los metadatos no son una especificidad de los recursos geoespaciales, pero se aplican a cualquier tipo de datos.\"),mdx(\"h3\",e({},{id:\"racionalidad-del-procesamiento-vectorial\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#racionalidad-del-procesamiento-vectorial\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Racionalidad del procesamiento vectorial\"),mdx(\"p\",null,\"El poder de los SIG radica en su capacidad \\xFAnica de conectar propiedades geom\\xE9tricas que definen objetos y fen\\xF3menos reales en nuestro mundo y sus atributos - ya sean observados, medidos o calculados - y permitiendo a trav\\xE9s de software especializado realizar operaciones en sus geometr\\xEDas, en sus atributos o ambos para obtener nueva informaci\\xF3n valiosa.\"),mdx(\"p\",null,\"Aunque en la mayor\\xEDa de los casos, los SIG est\\xE1n estrechamente asociados con mapas que simplemente muestran informaci\\xF3n geogr\\xE1fica, sus funcionalidades van mucho m\\xE1s all\\xE1 de la creaci\\xF3n de representaciones cartogr\\xE1ficas, ya sean din\\xE1micas o est\\xE1ticas.\"),mdx(\"p\",null,\"El an\\xE1lisis de datos espaciales (sin\\xF3nimos: an\\xE1lisis espacial, an\\xE1lisis geoespacial, an\\xE1lisis geogr\\xE1fico, interacci\\xF3n espacial) es un t\\xE9rmino general que se refiere a cualquier t\\xE9cnica dise\\xF1ada para identificar patrones, detectar anomal\\xEDas y probar teor\\xEDas basadas en datos espaciales. Un an\\xE1lisis es espacial si y solo si los resultados son sensibles a la reubicaci\\xF3n de los objetos analizados; en pocas palabras, la ubicaci\\xF3n importa. A medida que evolucion\\xF3 la tecnolog\\xEDa de la informaci\\xF3n, los cient\\xEDficos comenzaron a aplicar diversas t\\xE9cnicas, desde la literatura de estad\\xEDstica, geometr\\xEDa, topolog\\xEDa y otras ciencias al an\\xE1lisis de datos geogr\\xE1ficos para estudiar patrones y fen\\xF3menos en la superficie de la Tierra.\"),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"Geoestad\\xEDstica\"),\" es una rama de las estad\\xEDsticas que se aplica a los datos espaciales. Los m\\xE9todos empleados m\\xE1s comunes est\\xE1n relacionados con la interpolaci\\xF3n, que es un proceso matem\\xE1tico que permite la estimaci\\xF3n de valores desconocidos en base a los conocidos.\"),mdx(\"p\",null,\"La topolog\\xEDa es una rama de las matem\\xE1ticas que permite al usuario de SIG controlar las relaciones geom\\xE9tricas entre caracter\\xEDsticas y mantener la integridad geom\\xE9trica. La topolog\\xEDa se entiende mejor como un conjunto de reglas que aseguran la calidad de los datos espaciales que se pueden aplicar a la misma capa vectorial o m\\xE1s. Las reglas est\\xE1n dise\\xF1adas para respetar las relaciones del mundo real que representan las capas vectoriales. Por ejemplo, no puede haber espacios entre los pol\\xEDgonos que representan parcelas catastrales en una regi\\xF3n, o ning\\xFAn punto perteneciente a la capa vectorial que representa \\xE1rboles individuales no puede estar contenido en ning\\xFAn pol\\xEDgono de la capa vectorial que representa edificios dentro de una regi\\xF3n.\"),mdx(\"p\",null,\"El software SIG ofrece funcionalidades que permiten al usuario definir reglas de topolog\\xEDa relevantes, as\\xED como algoritmos para verificar si se aplican y limpiar la capa vectorial donde se identifican inconsistencias.\"),mdx(\"p\",null,\"El geoprocesamiento es un t\\xE9rmino general que se utiliza para definir cualquier operaci\\xF3n (proceso) que se aplica a un conjunto de datos geogr\\xE1ficos, con el alcance de obtener un conjunto de datos derivado que abre nuevas perspectivas sobre los datos. Las operaciones comunes de geoprocesamiento son la superposici\\xF3n de caracter\\xEDsticas geogr\\xE1ficas, la selecci\\xF3n y an\\xE1lisis de caracter\\xEDsticas, el procesamiento de topolog\\xEDa y la conversi\\xF3n de datos. El geoprocesamiento permite definir, administrar y analizar informaci\\xF3n geogr\\xE1fica para respaldar la toma de decisiones.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig84.png\",alt:\"elements of a geoprocessing operation\",title:\"elements of a geoprocessing operation\"}))),mdx(\"p\",null,\"Figura 8.4: elementos de una operaci\\xF3n de geoprocesamiento\"),mdx(\"h2\",e({},{id:\"contenido-principal\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#contenido-principal\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Contenido principal:\"),mdx(\"h3\",e({},{id:\"fase-1-comprensi\\xF3n-de-sus-datos\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#fase-1-comprensi\\xF3n-de-sus-datos\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Fase 1: Comprensi\\xF3n de sus datos.\"),mdx(\"p\",null,\"Hay muchas operaciones de geoprocesamiento que se pueden realizar en datos vectoriales, entre las que se incluyen la superposici\\xF3n de caracter\\xEDsticas geogr\\xE1ficas, la selecci\\xF3n y an\\xE1lisis de caracter\\xEDsticas, el procesamiento de topolog\\xEDa y la conversi\\xF3n de datos. En esta primera fase, nos familiarizaremos con algunos de ellos, entendiendo c\\xF3mo funcionan y qu\\xE9 resultados podemos esperar.\"),mdx(\"h4\",e({},{id:\"paso-1-prepare-su-entorno-de-trabajo\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#paso-1-prepare-su-entorno-de-trabajo\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Paso 1. Prepare su entorno de trabajo.\"),mdx(\"p\",null,\"Abra QGIS, configure el sistema de referencia de coordenadas en el que trabajar\\xE1 - EPSG:5345 - y agregue las siguientes capas de datos:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Pol\\xEDgonos - l\\xEDmites administrativos; edificios; uso del suelo;\"),mdx(\"li\",{parentName:\"ul\"},\"L\\xEDneas: carreteras, r\\xEDos;\"),mdx(\"li\",{parentName:\"ul\"},\"Puntos: lugares de culto, lugares de inter\\xE9s\")),mdx(\"p\",null,\"En este punto, la ventana de su mapa QGIS deber\\xEDa verse como en la figura 8.5, por supuesto, lo m\\xE1s probable es que en otros colores.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig85.png\",alt:\"Loaded vector data sets: points, line and polygons\",title:\"Loaded vector data sets: points, line and polygons\"}))),mdx(\"p\",null,\"Figura 8.5 - Conjuntos de datos vectoriales cargados: puntos, l\\xEDneas y pol\\xEDgonos\"),mdx(\"p\",null,\"\\xA1Compruebe! Todas las capas est\\xE1n en el mismo sistema de coordenadas (EPSG:5345) mirando en la esquina derecha inferior. Si es as\\xED, entonces est\\xE1 viendo 7 capas de datos vectoriales superpuestas.\"),mdx(\"h4\",e({},{id:\"paso-2-comprenda-lo-que-est\\xE1-mirando\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#paso-2-comprenda-lo-que-est\\xE1-mirando\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Paso 2. Comprenda lo que est\\xE1 mirando.\"),mdx(\"p\",null,\"En este punto, tenemos 7 capas vectoriales cargadas en nuestro proyecto QGIS. Los pr\\xF3ximos pasos nos ayudar\\xE1n a comprender nuestros datos.\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Compruebe cu\\xE1ntas caracter\\xEDsticas tenemos en una capa; hay varias formas de hacerlo:\"),mdx(\"ul\",{parentName:\"li\"},mdx(\"li\",{parentName:\"ul\"},\"Haga doble clic en la capa de inter\\xE9s - Propiedades - Informaci\\xF3n - N\\xFAmero de Objetos\"),mdx(\"li\",{parentName:\"ul\"},\"Abra la tabla de atributos de la capa de inter\\xE9s y observe el lado superior central \")))),mdx(\"p\",null,\"Antes de ejecutar cualquier estad\\xEDstica b\\xE1sica, completemos la tabla de atributos con algunos atributos geom\\xE9tricos (consulte el M\\xF3dulo 6 para obtener m\\xE1s detalles):\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Capa de carreteras: calcule la longitud de cada segmento de carretera y almac\\xE9nela en la tabla de atributos\",mdx(\"ul\",{parentName:\"li\"},mdx(\"li\",{parentName:\"ul\"},\"nombre del campo de salida: longitud\"),mdx(\"li\",{parentName:\"ul\"},\"tipo: n\\xFAmero decimal\"),mdx(\"li\",{parentName:\"ul\"},\"expresi\\xF3n: \",mdx(\"inlineCode\",{parentName:\"li\"},\"round($length, 2)\")))),mdx(\"li\",{parentName:\"ul\"},\"Capa de edificios: calcula el \\xE1rea de cada edificio y gu\\xE1rdalo en la tabla de atributos\",mdx(\"ul\",{parentName:\"li\"},mdx(\"li\",{parentName:\"ul\"},\"nombre del campo de salida: area\"),mdx(\"li\",{parentName:\"ul\"},\"tipo: n\\xFAmero decimal\"),mdx(\"li\",{parentName:\"ul\"},\"expresi\\xF3n: \",mdx(\"inlineCode\",{parentName:\"li\"},\"round($area, 2)\"))))),mdx(\"p\",null,\"Ahora, los campos de atributo est\\xE1n llenos, pero si no est\\xE1 seguro de en qu\\xE9 unidad de medida QGIS ha calculado la longitud de los segmentos de carreteras y las \\xE1reas de los edificios, la verificaci\\xF3n de la informaci\\xF3n del sistema de coordenadas podr\\xEDa ayudarte.\"),mdx(\"p\",null,\"Haga clic en la esquina inferior derecha de la ventana del mapa QGIS, en EPSG:5345 y aparecer\\xE1 una ventana como la de la figura 8.6.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig86.png\",alt:\"Specifications of the coordinate reference system used in the QGIS project\",title:\"Specifications of the coordinate reference system used in the QGIS project\"}))),mdx(\"p\",null,\"Figura 8.6 - Especificaciones del sistema de referencia de coordenadas utilizado en el proyecto QGIS\"),mdx(\"p\",null,\"As\\xED, encontramos que la unidad de medida es el metro, por lo tanto las longitudes se miden en metros y las \\xE1reas en metros cuadrados.\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Ejecute estad\\xEDsticas b\\xE1sicas en las capas cargadas para controlar mejor sus datos (figura 8.7):\"),mdx(\"ul\",{parentName:\"li\"},mdx(\"li\",{parentName:\"ul\"},\"Men\\xFA Vector \\u2023 Men\\xFA Herramientas de an\\xE1lisis \\u2023 Estad\\xEDsticas b\\xE1sicas para campos\"),mdx(\"li\",{parentName:\"ul\"},\"Ventana de caja de herramientas de procesamiento \\u2023 buscar 'estad\\xEDsticas'\")))),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig87.png\",alt:\"Basics statistics for fields\",title:\"Basics statistics for fields\"}))),mdx(\"p\",null,\"Figura 8.7 - Estad\\xEDsticas b\\xE1sicas para campos\"),mdx(\"p\",null,\"Las estad\\xEDsticas devueltas dependen del tipo de campo que elegimos y se generan como un archivo HTML.\"),mdx(\"p\",null,\"Ejec\\xFAtelo en nuestra capa de carreteras y veamos qu\\xE9 resultados obtenemos. Complete la ventana, como en la figura 8.8.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig88.png\",alt:\"Preparing to run basics statistics for roads layer\",title:\"Preparing to run basics statistics for roads layer\"}))),mdx(\"p\",null,\"Figura 8.8 - Preparaci\\xF3n para ejecutar estad\\xEDsticas b\\xE1sicas para la capa de carreteras\"),mdx(\"p\",null,\"El archivo de salida es un html que se puede abrir con cualquier navegador (Firefox, Chrome, Safari, etc.) que deber\\xEDa verse a continuaci\\xF3n:\"),mdx(\"pre\",null,mdx(\"code\",e({parentName:\"pre\"},{}),`Campo analizado: longitud\nRecuento: 91716\nValores \\xFAnicos: 59262\nValores NULOS (faltan): 0\nValor m\\xEDnimo: 0.16\nValor m\\xE1ximo: 111147.86\nIntervalo: 111147.7\nSuma: 95435635.54999979\nValor medio: 1040.556015853284\nMediana: 249.09\nDesviaci\\xF3n est\\xE1ndar: 2600.362277406611\nCoeficiente de variaci\\xF3n: 2.499012295147075\nMinor\\xEDa (valor m\\xE1s raro presente): 0.16\nMayor\\xEDa (valor presente con m\\xE1s frecuencia): 35.78\nPrimer cuartil: 97.555\nTercer cuartil: 709.805\nIntervalo intercuartil (IQR): 612.25\n`)),mdx(\"p\",null,\"A partir de estas estad\\xEDsticas b\\xE1sicas, encontramos que hay \",mdx(\"inlineCode\",{parentName:\"p\"},\"91716\"),\" tramos de carretera en la capa cargada, donde el m\\xE1s corto tiene \",mdx(\"inlineCode\",{parentName:\"p\"},\"0,16\"),\" my el m\\xE1s largo \",mdx(\"inlineCode\",{parentName:\"p\"},\"111147,86\"),\" m - mas de 111 km. Descubrimos que la suma de carreteras en Santa Fe es de casi 95 mil km (\",mdx(\"inlineCode\",{parentName:\"p\"},\"95.435.635,55\"),\" m). Dado que la media es mayor que la mediana, nos dice que la segunda mitad del conjunto de datos contiene segmentos de carretera m\\xE1s largos y que supera los segmentos de carretera en la primera mitad. Sin embargo, la mediana muestra que la mayor\\xEDa de los tramos de carretera tienen una longitud de alrededor de 250 m.\"),mdx(\"p\",null,\"Ejecutando las estad\\xEDsticas b\\xE1sicas en la capa Edificios para el campo type, obtenemos lo siguiente:\"),mdx(\"pre\",null,mdx(\"code\",e({parentName:\"pre\"},{}),`Campo analizado: type\nRecuento: 24437\nValores \\xFAnicos: 70\nValores NULOS (faltan): 13894\nValor m\\xEDnimo: abandoned\nValor m\\xE1ximo: warehouse\nLongitud m\\xEDnima: 0\nLongitud m\\xE1xima: 17\nLongitud media: 3.2224086426320744\n`)),mdx(\"p\",null,\"Los resultados no parecen iguales, no tenemos media, ni mediana ni desviaci\\xF3n est\\xE1ndar. Esto se debe a que el campo de atributo en el que ejecutamos el algoritmo es diferente, no tenemos n\\xFAmeros, sino palabras, tipos de edificios. Descubrimos que de \",mdx(\"inlineCode\",{parentName:\"p\"},\"24437\"),\" edificios en Santa Fe, para \",mdx(\"inlineCode\",{parentName:\"p\"},\"13894\"),\" no sabemos el tipo de edificio. Tambi\\xE9n descubrimos que hay 70 categor\\xEDas \\xFAnicas.\"),mdx(\"h4\",e({},{id:\"paso-3-comprobaciones-b\\xE1sicas-para-encontrar-r\\xE1pidamente-errores-en-sus-datos\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#paso-3-comprobaciones-b\\xE1sicas-para-encontrar-r\\xE1pidamente-errores-en-sus-datos\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Paso 3. Comprobaciones b\\xE1sicas para encontrar r\\xE1pidamente errores en sus datos.\"),mdx(\"p\",null,\"Los conjuntos de datos perfectos e impecables son el equivalente al gas ideal en f\\xEDsica. No existe tal cosa, pero muchos pueden acercarse bastante. Por tanto, antes de hacer cualquier tipo de an\\xE1lisis para extraer informaci\\xF3n, al menos son necesarias algunas comprobaciones b\\xE1sicas sobre qu\\xE9 tan limpios est\\xE1n los datos que tenemos.\"),mdx(\"p\",null,\"Existen muchos tipos de errores que pueden afectar la calidad de tus datos y, dado el alcance de tu an\\xE1lisis geoespacial, su influencia en el resultado final puede ser m\\xE1s o menos importante. Por ejemplo, si utiliza datos geoespaciales para enrutar desde el punto A al punto B en autom\\xF3vil, entonces tener una capa de carreteras completa con atributos en los que las calles son de una sola v\\xEDa o cerradas al tr\\xE1fico rodado, es esencial para obtener un resultado viable. Sin embargo, si su ruta es a pie, entonces esa informaci\\xF3n no es crucial para su resultado.\"),mdx(\"p\",null,\"Cuando se hace referencia a errores de datos geoespaciales, hay 2 t\\xE9rminos principales que deben entenderse bien: \"),mdx(\"p\",null,\"La exactitud es el grado en que la informaci\\xF3n de un mapa coincide con los valores del mundo real y se aplica tanto a la geometr\\xEDa como a los atributos.\"),mdx(\"p\",null,\"La precisi\\xF3n se refiere al nivel de medici\\xF3n y exactitud de la descripci\\xF3n en un conjunto de datos geoespaciales.\"),mdx(\"p\",null,\"Un error abarca tanto la imprecisi\\xF3n de los datos como sus inexactitudes. \",mdx(\"strong\",{parentName:\"p\"},\" La calidad de los datos \"),\" se refiere al nivel de precisi\\xF3n y exactitud de los conjuntos de datos y, con mayor frecuencia, se documenta en los informes de calidad de los datos.\"),mdx(\"p\",null,\"Analizar y \",mdx(\"em\",{parentName:\"p\"},\"limpiar\"),\" un conjunto de datos geoespaciales puede ser una tarea engorrosa y que consume mucho tiempo, sin embargo, como se muestra en el ejemplo anterior, es esencial. En esta secci\\xF3n, presentamos algunas funcionalidades de SIG que permiten al usuario realizar verificaciones r\\xE1pidas de datos vectoriales y sacar un conjunto de conclusiones preliminares sobre su calidad.\"),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"Comprobaciones de topolog\\xEDa.\")),mdx(\"p\",null,\"QGIS ofrece una funcionalidad central que permite al usuario realizar una serie de comprobaciones topol\\xF3gicas en los conjuntos de datos vectoriales cargados, denominada Topology Checker. Se puede encontrar como uno de los paneles (figura 8.9.a) y una vez activada su ventana se ve como en la figura 8.9.b.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig89_a.png\",alt:\"Topology checker plugin\",title:\"Topology checker plugin\"}))),mdx(\"p\",null,\"Figure 8.9.a - Topology checker plugin\"),mdx(\"p\",null,\"To show the Topology Checker, enable it as a panel under \",mdx(\"strong\",{parentName:\"p\"},\"View \\u2023 Panels \\u2023 Topology Checker\"),\" (figure 8.9.b). If it does not appear in the Panels menu, you can enable it by clicking the Topology Checker button \",mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig89_btn.png\",alt:\"Topology checker button\",title:\"Topology checker button\"})),\" on the Plugins toolbar. Once activated it\\u2019s window looks like in figure 8.9.c. \"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig89_b.png\",alt:\"Topology checker panel\",title:\"Topology checker panel\"}))),mdx(\"p\",null,\"Figura 8.9.b - Panel de verificaci\\xF3n de topolog\\xEDa; \"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig89_c.png\",alt:\"Topology checker window\",title:\"Topology checker window\"}))),mdx(\"p\",null,\"Figura 8.9.c - Ventana del verificador de topolog\\xEDa\"),mdx(\"p\",null,\"To define the topology rules, click on the third icon \",mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig810_btn.png\",alt:\"Topology rule settings button\",title:\"Topology rule settings button\"})),\", opening a window as in figure 8.10. \"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig810.png\",alt:\"Topology rule settings window\",title:\"Topology rule settings window\"}))),mdx(\"p\",null,\"Figura 8.10 - Ventana de configuraci\\xF3n de reglas de topolog\\xEDa\"),mdx(\"p\",null,\"Estableceremos una serie de reglas para las capas que hemos cargado en nuestro proyecto QGIS, considerando los objetos del mundo real que representan: carreteras, edificios, l\\xEDneas fluviales en la provincia de Santa Fe.\"),mdx(\"p\",null,\"La configuraci\\xF3n de la topolog\\xEDa es sencilla, ya que las reglas que se pueden aplicar en funci\\xF3n de la capa seleccionada ya est\\xE1n integradas en esta funcionalidad, como se muestra en la figura 8.11.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig811.png\",alt:\"Topology rules dropdown menu based on the selected layer\",title:\"Topology rules dropdown menu based on the selected layer\"}))),mdx(\"p\",null,\"Figura 8.11 - Men\\xFA desplegable de reglas de topolog\\xEDa seg\\xFAn la capa seleccionada.\"),mdx(\"p\",null,\"Elija las reglas de topolog\\xEDa como se muestra en la figura 8.12, luego haga clic en el primer icono de la ventana para ejecutar y espere los resultados.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig812.png\",alt:\"Topology rules to be set\",title:\"Topology rules to be set\"}))),mdx(\"p\",null,\"Figura 8.12 - Reglas de topolog\\xEDa que se establecer\\xE1n\"),mdx(\"p\",null,\"Click on the first icon \",mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig813_btn.png\",alt:\"Validate rules button\",title:\"Validate rules button\"})),\" on the Topology Checker window to run and wait for the results. After running the topology check, your map windows should look like in figure 8.13. \"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig813.png\",alt:\"Topology check results\",title:\"Topology check results\"}))),mdx(\"p\",null,\"Figura 8.13 - Resultados de la comprobaci\\xF3n de topolog\\xEDa\"),mdx(\"p\",null,\"En la esquina inferior derecha, la ventana del comprobador de topolog\\xEDa enumera todos los errores identificados seg\\xFAn las reglas que hemos definido en la fase anterior. Si la casilla de verificaci\\xF3n Mostrar errores est\\xE1 marcada, los errores se resaltar\\xE1n en rojo en el mapa. Al hacer doble clic en un error seleccionado, se mover\\xE1 el mapa a su ubicaci\\xF3n.\"),mdx(\"p\",null,\"El proceso de corregir los errores en un conjunto de datos, ya sea relacionado con la geometr\\xEDa (duplicados, huecos, etc.) o en el atributo relacionado (valores faltantes, mal escrito, etc.) se denomina limpieza de un conjunto de datos y la mayor\\xEDa de las veces es tan engorroso como necesario. Aunque existen funcionalidades para respaldar un proceso de limpieza semiautom\\xE1tico, a menudo es necesaria la entrada del usuario. Por ejemplo, en la figura 8.14, hemos ampliado un error en nuestra capa de puntos de inter\\xE9s, un punto duplicado. Como se puede ver, hay 2 puntos que representan un restaurant que se llama Tomasso.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig814.png\",alt:\"Duplicate point error in points of interest vector layer\",title:\"sDuplicate point error in points of interest vector layer\"}))),mdx(\"p\",null,\"Figura 8.14 - Error de punto duplicado en la capa vectorial de puntos de inter\\xE9s\"),mdx(\"p\",null,\"En este caso particular, la decisi\\xF3n del usuario probablemente ser\\xEDa eliminar el punto duplicado, ya que puede insertar un error en un an\\xE1lisis espacial posterior. Por ejemplo, si un funcionario de la ciudad quiere saber cu\\xE1ntos restaurantes y caf\\xE9s hay en un vecindario espec\\xEDfico, el punto duplicado insertar\\xE1 un error en los resultados y eso eventualmente podr\\xEDa llevar a decisiones enga\\xF1osas.\"),mdx(\"p\",null,\"Por tanto, procederemos a la eliminaci\\xF3n autom\\xE1tica de los puntos duplicados. Para hacerlo, usaremos una funcionalidad central de QGIS - Eliminar geometr\\xEDas duplicadas - que se encuentra en la caja de herramientas de procesamiento. Su QGIS deber\\xEDa verse como en la figura 8.15.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig815.png\",alt:\" Delete duplicate geometries on layer points of interest\",title:\" Delete duplicate geometries on layer points of interest\"}))),mdx(\"p\",null,\"Figura 8.15 - Eliminar geometr\\xEDas duplicadas en puntos de inter\\xE9s de capa\"),mdx(\"p\",null,\"Despu\\xE9s de ejecutar el algoritmo, la ventana de funcionalidad presenta los resultados, ha identificado 50 puntos duplicados, al igual que el verificador de topolog\\xEDa, e informa al usuario que los ha eliminado todos, dejando el Capa de puntos de inter\\xE9s con 8416 entidades.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig816.png\",alt:\"Result of running delete duplicate geometries\",title:\"Result of running delete duplicate geometries\"}))),mdx(\"p\",null,\"Figura 8.16 - Resultado de ejecutar eliminar geometr\\xEDas duplicadas\"),mdx(\"p\",null,\"Volver a ejecutar el verificador de topolog\\xEDa dar\\xE1 como resultado un resultado de 0 errores con respecto a la regla de topolog\\xEDa de no duplicados geom\\xE9tricos para la capa de puntos de inter\\xE9s.\"),mdx(\"p\",null,\"\\xA1Atenci\\xF3n! El algoritmo considera solo geometr\\xEDas, ignorando el atributo. Si, tal es nuestro caso, existen algunas diferencias en el atributo de los duplicados, el usuario no tiene control sobre cu\\xE1l se mantendr\\xE1. Por lo tanto, si es necesario conservar toda la informaci\\xF3n, primero debe copiarse en todas las geometr\\xEDas, de modo que cuando se elimine una entidad duplicada no se pierda informaci\\xF3n.\"),mdx(\"p\",null,\"Ejecutemos otra verificaci\\xF3n de topolog\\xEDa, esta vez en nuestra capa de usos del suelo (landuse). Configure las siguientes reglas:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Sin duplicados\"),mdx(\"li\",{parentName:\"ul\"},\"Sin geometr\\xEDas no v\\xE1lidas\")),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig817_a.png\",alt:\"Topology check on the buildings vector layer\",title:\"Topology check on the buildings vector layer\"}))),mdx(\"p\",null,\"Figure 8.17a - Topology checker rules on the buildings vector layer\"),mdx(\"p\",null,\"Ejecute el algoritmo.\"),mdx(\"p\",null,\"El resultado deber\\xEDa parecerse a la figura 8.17b.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig817_b.png\",alt:\"Results of topology check on the buildings vector layer\",title:\"Results of topology check on the buildings vector layer\"}))),mdx(\"p\",null,\"Figura 8.17b - Resultados de la verificaci\\xF3n de topolog\\xEDa en la capa vectorial de edificios\"),mdx(\"p\",null,\"Limpie la entidad duplicada mediante el proceso indicado anteriormente (figura 8.18a)\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig818_a.png\",alt:\"Remove duplicate geometries on the buildings vector layer\",title:\"Remove duplicate geometries on the buildings vector layer\"}))),mdx(\"p\",null,\"Figure 8.18a - Remove duplicate geometries on the buildings vector layer\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig818_b.png\",alt:\"Results of remove duplicate geometries on the buildings vector layer\",title:\"Results of remove duplicate geometries on the buildings vector layer\"}))),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig818_c.png\",alt:\"Results of Delete duplicate geometries\",title:\"Results of Delete duplicate geometries\"}))),mdx(\"p\",null,\"Figura 8.18b - Resultados de Eliminar geometr\\xEDas duplicadas\"),mdx(\"p\",null,\"Una limpieza completa de los conjuntos de datos vectoriales utilizados para este m\\xF3dulo est\\xE1 fuera de alcance. Su complejidad lo transforma en un m\\xF3dulo m\\xE1s avanzado en s\\xED mismo.\"),mdx(\"h4\",e({},{id:\"paso-4-observe-m\\xE1s-de-cerca-la-informaci\\xF3n-adjunta-a-los-puntos-l\\xEDneas-y-pol\\xEDgonos\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#paso-4-observe-m\\xE1s-de-cerca-la-informaci\\xF3n-adjunta-a-los-puntos-l\\xEDneas-y-pol\\xEDgonos\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Paso 4. Observe m\\xE1s de cerca la informaci\\xF3n adjunta a los puntos, l\\xEDneas y pol\\xEDgonos.\"),mdx(\"p\",null,\"Ejecutemos un algoritmo m\\xE1s para tener una idea de cu\\xE1les son los atributos de nuestras capas de Pampanga. Una vez que hayamos identificado cu\\xE1ntas caracter\\xEDsticas tiene cada capa, veamos cu\\xE1ntas y cu\\xE1les son los atributos \\xFAnicos en los siguientes casos:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"capa osm_buildings - atributo type;\"),mdx(\"li\",{parentName:\"ul\"},\"capa osm_pois_limpia - atributo fclass;\"),mdx(\"li\",{parentName:\"ul\"},\"capa osm_waterways - atributo fclass;\"),mdx(\"li\",{parentName:\"ul\"},\"capa osm_pofw - atributo fclass;\"),mdx(\"li\",{parentName:\"ul\"},\"capa osm_roads -attribute fclass;\"),mdx(\"li\",{parentName:\"ul\"},\"capa osm_landuse_limpia - atributo fclass;\")),mdx(\"p\",null,\"Para eso, vaya a Vector \\u2023 Herramientas de an\\xE1lisis \\u2023 Lista de valores \\xFAnicos (figura 8.19a)\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig819_a.png\",alt:\"List unique values in a vector layer functionality\",title:\"List unique values in a vector layer functionality\"}))),mdx(\"p\",null,\"Figura 8.19a - Lista de valores \\xFAnicos en una funcionalidad de capa vectorial\"),mdx(\"p\",null,\"En la ventana que se abre, inserte, uno a la vez, cada nombre de capa y atributo de inter\\xE9s como enumerados en la lista anterior y deber\\xEDa tener los siguientes resultados:\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig819_b.png\",alt:\"List unique values in a vector layer functionality (Batch Processing)\",title:\"List unique values in a vector layer functionality (Batch Processing)\"}))),mdx(\"p\",null,\"Figure 8.19b - List unique values in a vector layer functionality (Batch Processing)\"),mdx(\"table\",null,mdx(\"tr\",null,mdx(\"td\",null,\"Nombre de capa\"),mdx(\"td\",null,\"Cantidad de valores \\xFAnicos\"),mdx(\"td\",null,\"Valores \\xFAnicos\")),mdx(\"tr\",null,mdx(\"td\",null,\"osm_buildings\"),mdx(\"td\",null,\"70\"),mdx(\"td\",null,\"desused; NULL; shed; stable; religious; toilets; church; hotel; silo; stilt_house; cabin; temple; college; abandoned; ruins; chapel; roof; transportation; storage_tank; boathouse; hospital; manufacture; utility; stadium; theatre; grandstand; garages; parking; house; disused; service; kiosk; farm; civic; hangar; garage; school; construction; gasometer; bungalow; greenhouse; industrial; hut; apartments; barn; university; public; office; residential; sports_centre; boat_storage; pavilion; detached; commercial; cathedral; no; farm_auxiliary; station; retail; warehouse; kindergarten; apartment; carport; collapsed; government; transformer_tower; terrace; shrine; supermarket; train_station\")),mdx(\"tr\",null,mdx(\"td\",null,\"osm_pois_limpia\"),mdx(\"td\",null,\"123\"),mdx(\"td\",null,\"archaeological; police; hairdresser; shelter; town_hall; chemist; sports_shop; track; park; observation_tower; swimming_pool; guesthouse; hospital; camera_surveillance; dentist; beverages; kiosk; veterinary; wayside_cross; school; vending_parking; fountain; car_dealership; vending_any; garden_centre; telephone; fast_food; attraction; bicycle_shop; bookshop; water_works; golf_course; nightclub; pub; biergarten; water_tower; bank; monument; courthouse; atm; library; tower; travel_agent; stadium; post_office; restaurant; outdoor_shop; artwork; embassy; memorial; motel; car_wash; drinking_water; battlefield; kindergarten; greengrocer; post_box; wastewater_plant; computer_shop; mall; supermarket; toilet; cafe; theme_park; prison; recycling_glass; hostel; recycling_clothes; comms_tower; optician; hotel; chalet; laundry; doityourself; stationery; tourist_info; college; ruins; convenience; arts_centre; windmill; wayside_shrine; water_well; vending_machine; viewpoint; dog_park; bar; camp_site; beauty_shop; playground; alpine_hut; university; mobile_phone_shop; butcher; sports_centre; pharmacy; jeweller; bakery; clothes; car_rental; recycling; shoe_shop; waste_basket; bicycle_rental; pitch; bench; food_court; gift_shop; department_store; cinema; caravan_site; fire_station; toy_shop; theatre; furniture_shop; picnic_site; recycling_paper; doctors; newsagent; community_centre; nursing_home; florist; museum\")),mdx(\"tr\",null,mdx(\"td\",null,\"osm_waterways\"),mdx(\"td\",null,\"4\"),mdx(\"td\",null,\"stream; canal; drain; river\")),mdx(\"tr\",null,mdx(\"td\",null,\"osm_pofw\"),mdx(\"td\",null,\"6\"),mdx(\"td\",null,\"christian_orthodox; christian; christian_protestant; christian_evangelical; christian_catholic; jewish\")),mdx(\"tr\",null,mdx(\"td\",null,\"osm_roads\"),mdx(\"td\",null,\"27\"),mdx(\"td\",null,\"track_grade3; path; primary; track_grade2; secondary; track; bridleway; pedestrian; living_street; tertiary_link; tertiary; trunk; trunk_link; track_grade5; service; track_grade4; primary_link; unknown; footway; motorway_link; steps; residential; unclassified; motorway; cycleway; track_grade1; secondary_link\")),mdx(\"tr\",null,mdx(\"td\",null,\"osm_landuse_limpia\"),mdx(\"td\",null,\"20\"),mdx(\"td\",null,\"allotments; forest; quarry; park; meadow; farmland; orchard; recreation_ground; military; farmyard; industrial; nature_reserve; grass; residential; scrub; commercial; retail; vineyard; heath; cemetery\"))),mdx(\"p\",null,\"Tabla 8.1 - Tabla que identifica cu\\xE1ntos y cu\\xE1les son los valores \\xFAnicos para los atributos seleccionados\"),mdx(\"p\",null,\"Para un an\\xE1lisis m\\xE1s profundo de los atributos de nuestras capas vectoriales, usaremos el complemento Group Stats. Fue desarrollado para admitir el c\\xE1lculo de estad\\xEDsticas para grupos de caracter\\xEDsticas en una capa vectorial, lo que lo hace muy \\xFAtil para comprender mejor sus datos, as\\xED como para detectar posibles errores en los atributos.\"),mdx(\"p\",null,\"Para abrir la ventana Group Stats, vaya a Vector \\u2023 Group Stats \\u2023 GroupStats.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig820_a.png\",alt:\"GroupStats plugin\",title:\"GroupStats plugin\"}))),mdx(\"p\",null,\"Figure 8.20a - GroupStats plugin\"),mdx(\"p\",null,\"Deber\\xEDa abrirse una nueva ventana como la de la figura 8.20b.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig820_b.png\",alt:\"GroupStats window\",title:\"GroupStats window\"}))),mdx(\"p\",null,\"Figura 8.20b - Ventana Group Stats\"),mdx(\"p\",null,\"Seg\\xFAn el an\\xE1lisis realizado anteriormente, hemos visto que para los edificios de capa tenemos 74 tipos diferentes de edificios, pero \\xBFcu\\xE1ntos de cada uno y cu\\xE1l es el \\xE1rea construida total tomada por cada categor\\xEDa? \\xBFCu\\xE1nto espacio para escuelas, mercados, casas? Group Stats puede ayudarnos a responder esta pregunta. En el lado derecho de la ventana, est\\xE1 el panel de control, donde elegimos lo que queremos calcular, as\\xED como c\\xF3mo se deben ordenar los datos. Usando arrastrar y soltar, siga la disposici\\xF3n en la figura 8.21, luego presione calcular.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig821.png\",alt:\"Running GroupStats on the building layer\",title:\"Running GroupStats on the building layer\"}))),mdx(\"p\",null,\"Figura 8.21 - Ejecuci\\xF3n de Group Stats en la capa de edificios.\"),mdx(\"p\",null,\"Al observar el resultado, podemos extraer informaci\\xF3n importante sobre nuestros datos. Por ejemplo, para fines residenciales en la regi\\xF3n provincia de Santa Fe, contamos con 13.894 edificios con una superficie total construida de 17.612.835,95 metros cuadrados, aprox. 1762 hect\\xE1reas. Tambi\\xE9n averiguamos que el m\\xE1s grande tiene 219709 metros cuadrados mientras que el m\\xE1s peque\\xF1o tiene menos de 1 metro cuadrado. Y se puede continuar el an\\xE1lisis para obtener m\\xE1s informaci\\xF3n valiosa.\"),mdx(\"p\",null,\"Otro an\\xE1lisis interesante se puede ejecutar en la capa vectorial de carreteras. La figura 8.22 muestra c\\xF3mo calcular las longitudes de las carreteras clasificadas por tipo de carretera (primaria, residencial, autopista, etc.) y la velocidad m\\xE1xima permitida.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig822.png\",alt:\"Running GroupStats on the roads layer\",title:\"Running GroupStats on the roads layer\"}))),mdx(\"p\",null,\"Figura 8.22 - Ejecuci\\xF3n de Group Stats en la capa de carreteras.\"),mdx(\"h4\",e({},{id:\"preguntas-del-cuestionario\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#preguntas-del-cuestionario\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Preguntas del cuestionario\"),mdx(\"ol\",null,mdx(\"li\",{parentName:\"ol\"},\"\\xBFSon importantes los metadatos?\")),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"S\\xED, porque da una idea de los datos geogr\\xE1ficos que de otro modo no se podr\\xEDan obtener.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"em\",{parentName:\"li\"},\"No, es solo burocracia \"))),mdx(\"ol\",e({},{start:2}),mdx(\"li\",{parentName:\"ol\"},\"\\xBFLa topolog\\xEDa es relevante para la geometr\\xEDa o para la tabla de atributos de una capa vectorial?\")),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"em\",{parentName:\"li\"},\" Lo es para la geometr\\xEDa de la capa vectorial.\"))),mdx(\"ol\",e({},{start:3}),mdx(\"li\",{parentName:\"ol\"},\"\\xBFQu\\xE9 es m\\xE1s importante, la geometr\\xEDa o los datos de los atributos?\")),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Geometr\\xEDa.\"),mdx(\"li\",{parentName:\"ul\"},\"Datos de atributos.\"),mdx(\"li\",{parentName:\"ul\"},\"Ambos.\")),mdx(\"h3\",e({},{id:\"fase-2-introducci\\xF3n-al-procesamiento-de-vectores\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#fase-2-introducci\\xF3n-al-procesamiento-de-vectores\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Fase 2: Introducci\\xF3n al procesamiento de vectores\"),mdx(\"p\",null,\"La primera fase del m\\xF3dulo de vectores hizo una breve introducci\\xF3n a los pasos que se deben realizar para tener una comprensi\\xF3n b\\xE1sica de los datos geoespaciales que se tienen a mano.\"),mdx(\"p\",null,\"Esta segunda fase del m\\xF3dulo lo lleva a un trabajo m\\xE1s profundo para procesar datos vectoriales con el fin de extraer informaci\\xF3n valiosa para ayudar a la toma de decisiones. Siguiendo los conceptos descritos al comienzo de este m\\xF3dulo, el geoprocesamiento representa cualquier proceso aplicado a un conjunto de datos geogr\\xE1ficos, con el alcance de obtener un conjunto de datos derivado que abre nuevos conocimientos sobre los datos. Y esto es lo que intentaremos hacer a continuaci\\xF3n.\"),mdx(\"p\",null,\"Hay muchas operaciones que se pueden realizar en uno o m\\xE1s conjuntos de datos geoespaciales y durante este primer paso, ejecutaremos algunas de las m\\xE1s comunes para comprender c\\xF3mo funcionan.\"),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"B\\xFAfer\"),\" Imagina que necesitas analizar una nueva legislaci\\xF3n que pide que en un \\xE1rea de 30 metros\",mdx(\"sup\",e({parentName:\"p\"},{id:\"fnref-1\"}),mdx(\"a\",e({parentName:\"sup\"},{href:\"#fn-1\",className:\"footnote-ref\"}),\"1\")),\" alrededor de los lugares de culto no se pueda construir nada. Querr\\xE1 ver d\\xF3nde est\\xE1n exactamente esas delimitaciones y tal vez incluso cu\\xE1ntos metros cuadrados hay para su distrito. El primer paso es definir una zona de influencia alrededor de los lugares de culto: Vector, herramientas de geoprocesamiento, zona de influencia. Cuando se abra la ventana del b\\xFAfer, configure los par\\xE1metros como en la figura 8.23:\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig823.png\",alt:\"Setting the parameters for a 30 m buffer around the places of worship\",title:\"Setting the parameters for a 30 m buffer around the places of worship\"}))),mdx(\"p\",null,\"Figura 8.23 \\u200B\\u200B- Configuraci\\xF3n de los par\\xE1metros para un b\\xFAfer de 30 m alrededor de los lugares de culto\"),mdx(\"p\",null,\"Un detalle del resultado del geoprocesamiento se muestra en la figura 8.24:\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig824.png\",alt:\"Running buffer on a point vector layer\",title:\"Running buffer on a point vector layer\"}))),mdx(\"p\",null,\"Figura 8.24 - B\\xFAfer de una capa vectorial de puntos\"),mdx(\"p\",null,\"Para responder completamente a la pregunta inicial, el siguiente paso es calcular las \\xE1reas para todas las zonas de influencia y resumirlas (ver Fase 1, paso 4) - figura 8.25.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig825.png\",alt:\"Calculate area for the newly obtained layer, then calculate using GroupStats the total sum\",title:\"Running buffer on Calculate area for the newly obtained layer, then calculate using GroupStats the total sum point vector layer\"}))),mdx(\"p\",null,\"Figura 8.25 - Calcule el \\xE1rea para la capa reci\\xE9n obtenida, luego calcule usando Group Stats la suma total.\"),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"Cortar.\"),\" Imagine que desea saber d\\xF3nde est\\xE1n todas las \\xE1reas industriales delimitadas en su distrito y tambi\\xE9n cu\\xE1ntos edificios hay dentro de ese per\\xEDmetro. Al inspeccionar visualmente sus datos vectoriales, observe que tiene varias \\xE1reas industriales que contienen varios edificios. Desea separar esos edificios y usarlos m\\xE1s. El primer paso es seleccionar todas las caracter\\xEDsticas en la capa osm_landuse_limpia que tienen como atributo industrial (consulte el m\\xF3dulo 6 para saber c\\xF3mo hacerlo). Luego, vaya a Vector \\u2023 Herramientas de geoprocesamiento \\u2023 Cortar y elija como capa para recortar osm_buildings. Sus resultados deber\\xEDan verse como en la figura 8.27b.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig826_a.png\",alt:\"Figure 8.26a - Select landuse fclass = industrial\",title:\"Figure 8.26a - Select landuse fclass = industrial\"}))),mdx(\"p\",null,\"Figure 8.26a - Select landuse fclass = industrial. \"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig826_b.png\",alt:\"Reduced selection of a few buildings and industrial landuse, so the computation can finish faster\",title:\"Reduced selection of a few buildings and industrial landuse, so the computation can finish faster\"}))),mdx(\"p\",null,\"Figura 8.26b - Selecci\\xF3n reducida de algunos edificios y uso de suelo industrial, por lo que el c\\xE1lculo puede terminar m\\xE1s r\\xE1pido.\"),mdx(\"p\",null,\"Run the Clip algorithm. Make sure to check \",mdx(\"strong\",{parentName:\"p\"},\"Selected features only\"),\" box for the Overlay layer (landuse). This will ensure that only the currently selected features will be used for clipping and speed up the computations.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig827_a.png\",alt:\"Running the Clip algorithm\",title:\"Running the Clip algorithm\"}))),mdx(\"p\",null,\"Figure 8.27a - Running the Clip algorithm\"),mdx(\"p\",null,\"Despu\\xE9s de ejecutar el algoritmo, sus resultados deber\\xEDan verse como en la figura 8.27b. Los edificios recortados est\\xE1n coloreados de rosa. En el per\\xEDmetro que hemos elegido hay 298 edificios que ocupan una superficie de casi 30 hect\\xE1reas. \\xBFCu\\xE1ntos edificios industriales ha recortado?\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig827_b.png\",alt:\"Results of the clip functionality\",title:\"Results of the clip functionality\"}))),mdx(\"p\",null,\"Figura 8.27b - Resultados de la funcionalidad de clip\"),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"Pol\\xEDgonos de Thiessen (Voronoi).\"),\" Imagine que tiene que tomar una serie de decisiones administrativas en su distrito en funci\\xF3n de la cantidad de escuelas que hay y las \\xE1reas espec\\xEDficas a las que sirven. El an\\xE1lisis geoespacial puede ser de ayuda. Puede comenzar calculando los pol\\xEDgonos de Thiessen. Basado en un \\xE1rea que contiene al menos dos puntos, un pol\\xEDgono Thiessen es una forma bidimensional cuyos l\\xEDmites contienen todo el espacio que est\\xE1 m\\xE1s cerca de un punto dentro del \\xE1rea que cualquier otro punto sin el \\xE1rea. Un buen ejemplo de uso es la meteorolog\\xEDa, donde las estaciones meteorol\\xF3gicas son puntos discretos, pero se considera que la informaci\\xF3n recopilada se mide en la superficie en funci\\xF3n de los pol\\xEDgonos de thiessen.\"),mdx(\"p\",null,`Para responder a la pregunta anterior, ejecutaremos el algoritmo solo para los puntos que cumplan con  \"fclass\"  =  'school'. Por lo tanto, haga la selecci\\xF3n como se indica en el m\\xF3dulo 6. Deber\\xEDa tener 519 entidades seleccionadas en la capa osm_pois. Vaya a Vectorial \\u2023 Herramientas de geometr\\xEDa \\u2023 Pol\\xEDgonos de Voronoi... Despu\\xE9s de configurar los par\\xE1metros, seleccione la capa de puntos para la que queremos que se calculen los pol\\xEDgonos de Voronoi y una extensi\\xF3n del 30% para que toda la provincia de Santa Fe est\\xE9 contenida, deber\\xEDa ver un resultado como en la figura 8.28d.`),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig828_a.png\",alt:\"Filtering the poi layer to get all schools\",title:\"Filtering the poi layer to get all schools\"}))),mdx(\"p\",null,\"Figure 8.28a - Filtering the poi layer to get all schools\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig828_b.png\",alt:\"All schools in the poi layer\",title:\"All schools in the poi layer\"}))),mdx(\"p\",null,\"Figure 8.28b - All schools in the poi layer\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig828_c.png\",alt:\"Running the Voronoi polygon algorithm\",title:\"Running the Voronoi polygon algorithm\"}))),mdx(\"p\",null,\"Figure 8.28c - Running the Voronoi polygon algorithm\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig828_d.png\",alt:\"Results of applying Thiessen (Voronoi) polygons algorithm to a point vector layer\",title:\"Results of applying Thiessen (Voronoi) polygons algorithm to a point vector layer\"}))),mdx(\"p\",null,\"Figura 8.28d - Resultados de la aplicaci\\xF3n del algoritmo de pol\\xEDgonos de Thiessen (Voronoi) a una capa vectorial de puntos\"),mdx(\"p\",null,\"A veces, las necesidades imponen el requisito de tener informaci\\xF3n en \\xE1reas m\\xE1s peque\\xF1as, claramente definidas e iguales y no para toda una gran regi\\xF3n, como un pa\\xEDs o una gran ciudad. Por lo tanto, los datos deben analizarse y visualizarse de manera dividida y bien definida, lo que permite una comparaci\\xF3n que, de otro modo, podr\\xEDa resultar dif\\xEDcil sin una referencia com\\xFAn.\"),mdx(\"p\",null,\"Supongamos que tiene que presentar un informe que permitir\\xE1 realizar comparaciones para unidades de 10X10 km sobre la unidad administrativa, incluyendo:\"),mdx(\"ol\",null,mdx(\"li\",{parentName:\"ol\"},\"densidad de espacios verdes (parques, bosques) en informe al espacio edificado por unidad;\"),mdx(\"li\",{parentName:\"ol\"},\"longitud total de calles para cada unidad;\"),mdx(\"li\",{parentName:\"ol\"},\"longitud total de v\\xEDas fluviales para cada unidad;\"),mdx(\"li\",{parentName:\"ol\"},\"n\\xFAmero total de edificios p\\xFAblicos para cada unidad (escuelas, jardines de infancia, hospitales, ayuntamientos, etc.).\")),mdx(\"p\",null,\"Hemos visto que existen herramientas que pueden ayudarnos a calcular la superficie total ocupada por un cierto tipo de caracter\\xEDstica, sin embargo, el primer paso es crear nuestras unidades 10X10: cuadr\\xEDculas de celdas. Para hacerlo, vaya a: Vectorial \\u2023 Herramientas de investigaci\\xF3n \\u2023 Crear cuadr\\xEDcula. Establezca los par\\xE1metros en: tipo de cuadr\\xEDcula - Rect\\xE1ngulo (pol\\xEDgono), Extensi\\xF3n de la cuadr\\xEDcula - desde la capa de Provincia, Espaciado horizontal - 10 km, Espaciado vertical - 10 km y deber\\xEDa obtener un resultado como en la figura 8.29.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig829_a.png\",alt:\"Creating a 10X10km vector grid for Santa Fe\",title:\"Creating a 10X10km vector grid for Santa Fe\"}))),mdx(\"p\",null,\"Figura 8.29 - Creaci\\xF3n de una cuadr\\xEDcula vectorial de 10X10km para la provincia de Santa Fe\"),mdx(\"p\",null,\"You should get a result like in figure 8.29b. \"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig829_b.png\",alt:\"10X10km vector grid for Santa Fe\",title:\"10X10km vector grid for Santa Fe\"}))),mdx(\"p\",null,\"Figure 8.29b - 10X10km vector grid for Santa Fe\"),mdx(\"p\",null,\"Para avanzar m\\xE1s en la respuesta a las preguntas de nuestro ejercicio, debemos hacer lo siguiente:\"),mdx(\"ol\",null,mdx(\"li\",{parentName:\"ol\"},\"espacios verdes (parques, bosques) espacio construido por relaci\\xF3n unitaria:\")),mdx(\"p\",null,\"Los espacios verdes y los espacios construidos son datos contenidos por la capa vectorial osm_landuse, tipo pol\\xEDgono. Para saber exactamente cu\\xE1les son los 'espacios verdes', necesitamos ver cu\\xE1les son las categor\\xEDas incluidas en el conjunto de datos. Para eso, ejecutamos el algoritmo de lista de valores \\xFAnicos en el atributo fclass y descubrimos que tenemos las siguientes clases 'verdes': forest; quarry; park; meadow; farmland; orchard; recreation_ground;  farmyard; industrial; nature_reserve; grass; scrub; vineyard y las siguientes clases de 'espacio construido': military; residential; commercial; retail; heath; allotments; cemetery. La figura 8.30b presenta una visualizaci\\xF3n de nuestras selecciones:\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig830_a.png\",alt:\"Filtering green areas and built-up space in Santa Fe\",title:\"Filtering green areas and built-up space in Santa Fe \"}))),mdx(\"p\",null,\"Figure 8.30a - Filtering green areas and built-up space in Santa Fe \"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig830_b.png\",alt:\"Spatial distribution of the green areas and built-up space in Santa Fe\",title:\"Spatial distribution of the green areas and built-up space in Santa Fe\"}))),mdx(\"p\",null,\"Figura 8.30b - Distribuci\\xF3n espacial de las \\xE1reas verdes y el espacio edificado en Santa Fe\"),mdx(\"p\",null,\"El segundo paso para responder al requisito es identificar cu\\xE1nto espacio verde y cu\\xE1nto espacio construido hay en cada 10 x 10 km. Para obtenerlo, debemos intersecar las 2 capas vectoriales de pol\\xEDgonos superpuestas. El algoritmo extrae las porciones superpuestas de entidades en la entrada, la capa de uso del suelo y la capa de superposici\\xF3n, la capa de cuadr\\xEDcula. Vaya a Vectorial - Herramientas de geoprocesamiento - Intersecar. Establezca los par\\xE1metros del algoritmo como en la figura 8.31.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig831.png\",alt:\"Parameters for the intersect algorithm\",title:\"Parameters for the intersect algorithm\"}))),mdx(\"p\",null,\"Figura 8.31 - Par\\xE1metros para el algoritmo de intersecci\\xF3n\"),mdx(\"p\",null,\"El resultado deber\\xEDa verse como en la figura 8.32. Tenga en cuenta que el algoritmo de intersecci\\xF3n se aplic\\xF3 a toda la capa osm_landuse, que contiene m\\xE1s caracter\\xEDsticas que las que seleccionamos para nuestro ejercicio.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig832.png\",alt:\"Result of running the intersection algorithm to clip the landuse vector polygons to the grid layer\",title:\"Result of running the intersection algorithm to clip the landuse vector polygons to the grid layer\"}))),mdx(\"p\",null,\"Figura 8.32 - Resultado de ejecutar el algoritmo de intersecci\\xF3n para recortar los pol\\xEDgonos vectoriales de uso del suelo a la capa de la cuadr\\xEDcula.\"),mdx(\"p\",null,\"Ahora, para cada unidad de 10 x 10 km, tenemos las caracter\\xEDsticas de uso del suelo con las que podemos trabajar. La tabla de atributos tambi\\xE9n almacena esta informaci\\xF3n, ya que cada celda de la cuadr\\xEDcula (unidad) tiene una identificaci\\xF3n \\xFAnica, consulte la figura 8.33.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig833.png\",alt:\"Landuse features clipped per each grid cell and it's associated attribute table\",title:\"Landuse features clipped per each grid cell and it's associated attribute table\"}))),mdx(\"p\",null,\"Figura 8.33 - Caracter\\xEDsticas del uso del suelo recortadas por cada celda de la cuadr\\xEDcula y su tabla de atributos asociada.\"),mdx(\"p\",null,`Ahora que tenemos todas las caracter\\xEDsticas de uso del suelo por unidad de 10 x 10 km, continuaremos separando las geometr\\xEDas de las que componen el espacio verde y el espacio edificado como se defini\\xF3 anteriormente, para cada celda de la cuadr\\xEDcula. Por lo tanto, para el espacio verde, seleccionaremos todas las caracter\\xEDsticas que tengan el valor de atributo para fclass: forest; quarry; park; meadow; farmland; orchard; recreation_ground;  farmyard. En la tabla de atributos, en la expresi\\xF3n, escriba: \"fclass\" = 'forest' OR \"fclass\" = 'quarry' OR \"fclass\" = 'park' OR \"fclass\" = 'meadow' OR \"fclass\" = 'farmland' OR \"fclass\" = 'orchard' OR \"fclass\" = 'recreation_ground' OR \"fclass\" = 'farmyard' y exporte las objetos seleccionados como espacios_verdes_cuadriculados (consulte el m\\xF3dulo 6 para obtener m\\xE1s detalles). Su nueva salida deber\\xEDa tener 12260 objetos. Haga lo mismo con el espacio construido. Seleccione las caracter\\xEDsticas en osm_landuse que tienen el valor de atributo para fclass lo siguiente: industrial; nature_reserve; grass; scrub; vineyard; military; residential; commercial; retail; heath; allotments; cemetery, escribiendo la siguiente expresi\\xF3n en la ventana de filtro basado en Expresi\\xF3n: \"fclass\" = 'industrial' OR \"fclass\" = 'nature_reserve' OR \"fclass\" =  'grass' OR \"fclass\" = 'scrub' OR \"fclass\" = 'vineyard' OR \"fclass\" = 'military' OR \"fclass\" = 'residential' OR \"fclass\" = 'commercial' OR \"fclass\" = 'retail' OR \"fclass\" = 'heath' OR \"fclass\" = 'allotments' OR \"fclass\" = 'cemetery'. Seleccione las geometr\\xEDas filtradas y exp\\xF3rtelas como espacios_construidos_cuadriculados. Su nueva salida deber\\xEDa tener 4973 funciones. `),mdx(\"p\",null,\"Alternatively, you can also use a filter instead of a selection.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig834_a.png\",alt:\"Selecting the green spaces\",title:\"Selecting the green spaces\"}))),mdx(\"p\",null,\"Figure 8.34a - Selecting the green spaces.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig834_b.png\",alt:\"Selected green spaces\",title:\"Selected green spaces\"}))),mdx(\"p\",null,\"Figure 8.34b - Selected green spaces.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig834_c.png\",alt:\"Green and Built-up spaces\",title:\"Green and Built-up spaces\"}))),mdx(\"p\",null,\"Figure 8.34c - Green and Built-up spaces.\"),mdx(\"p\",null,\"A continuaci\\xF3n, calcule el \\xE1rea ocupada por cada caracter\\xEDstica de las 2 capas. Vaya a la tabla de atributos de cada capa y luego agregue el \\xE1rea de la columna geom\\xE9trica insertando la expresi\\xF3n \",mdx(\"inlineCode\",{parentName:\"p\"},\"round($area, 2)\"),\" en la calculadora de campo. (consulte el m\\xF3dulo 6 para obtener m\\xE1s detalles, si es necesario). Sin embargo, la cuadr\\xEDcula de 10X10km de la provincia de Santa Fe tiene un n\\xFAmero conocido de celdas de cuadr\\xEDcula, y eso es 3066. Por lo tanto, necesitamos resumir las \\xE1reas para todo tipo de espacios verdes (bosques, parques, etc.) y espacios urbanizados (comerciales , residencial, etc.) y \\xFAnala en consecuencia a las 42 celdas de la cuadr\\xEDcula. Para hacer esto, usaremos el complemento Group Stats para resumir para cada id_cuadr\\xEDcula todas las categor\\xEDas verdes, respectivamente todas las categor\\xEDas construidas. Para la capa vectorial espacios_verdes_cuadriculados, configure los par\\xE1metros como en la figura 8.34e.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig834_d.png\",alt:\"Computing the area of each feature\",title:\"Computing the area of each feature\"}))),mdx(\"p\",null,\"Figure 8.34d - Computing the area of each feature.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig834_e.png\",alt:\"GroupStat parameters setup to sum up the green areas per each 10X10km grid cell\",title:\"GroupStat parameters setup to sum up the green areas per each 10X10km grid cell\"}))),mdx(\"p\",null,\"Figura 8.34e - Configuraci\\xF3n de los par\\xE1metros de Group Stat para resumir las \\xE1reas verdes por cada celda de cuadr\\xEDcula de 10X10km.\"),mdx(\"p\",null,\"Luego, guarde los resultados como un archivo .csv llamado espacios_verdes_cuadriculados. Vaya al men\\xFA \",mdx(\"inlineCode\",{parentName:\"p\"},\"Data - Save all to CSV file.\")),mdx(\"p\",null,\"Ejecute GroupStats para el espacio construido de la misma manera y luego gu\\xE1rdelo como un archivo csv llamado espacios_construidos_cuadriculados.\"),mdx(\"p\",null,\"A continuaci\\xF3n, traeremos los 2 archivos csv calculados con Group Stat a QGIS (Capa - Agregar capa - Agregar capa de texto delimitado - vea m\\xE1s detalles en el m\\xF3dulo 2). \"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig835_a.png\",alt:\"Loading green_spaces_gridded CSV\",title:\"Loading green_spaces_gridded CSV\"}))),mdx(\"p\",null,\"Figure 8.35a - Loading green_spaces_gridded CSV\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig835_b.png\",alt:\"The green_spaces_gridded CSV attribute table\",title:\"The green_spaces_gridded CSV attribute table\"}))),mdx(\"p\",null,\"Figure 8.35b - The green_spaces_gridded CSV attribute table\"),mdx(\"p\",null,\"A continuaci\\xF3n, debemos unir los espacios calculados (verdes y urbanizados) a cada cuadr\\xEDcula de celdas de 10x10 km. Para eso, seleccione la capa vectorial Cuadr\\xEDcula, abra la ventana de propiedades y vaya a Uniones. Esta funcionalidad le permite unirse por un campo de atributo com\\xFAn, otros. En nuestro caso, utilizando el valor com\\xFAn de cuadr\\xEDcula_id uniremos, la suma de las \\xE1reas edificadas y los espacios verdes de los 2 archivos csv obtenidos en la etapa anterior.\"),mdx(\"p\",null,\"En la ventana Unir, presione el bot\\xF3n verde m\\xE1s abajo y configure los par\\xE1metros como en la figura 8.35c, para espacios verdes. Luego repita para espacios construidos.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig835_c.png\",alt:\"Setting the parameters to join by common field grid_id/id the sums of green and built-up spaces for each grid cell - 10X10km unit\",title:\"Setting the parameters to join by common field grid_id/id the sums of green and built-up spaces for each grid cell - 10X10km unit\"}))),mdx(\"p\",null,\"Figura 8.35c - Configuraci\\xF3n de los par\\xE1metros para unir por campo com\\xFAn grid_id / id las sumas de espacios verdes y construidos para cada celda de la cuadr\\xEDcula - unidad de 10X10km.\"),mdx(\"p\",null,\"Repeat for built-up spaces. \"),mdx(\"p\",null,\"Los resultados de las dos combinaciones son visibles en la tabla de atributos, como se puede ver en la figura 8.36. Hemos mantenido el grid_id en ambas combinaciones, para asegurarnos de que no se produzcan errores. Podemos verificar visualmente r\\xE1pidamente para asegurarnos de que los 3 campos de atributos: id, verdes_grid_id y construidos_grid_id sean exactamente iguales.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig836_a.png\",alt:\"Green and built-up CSV joined to Grid\",title:\"Green and built-up CSV joined to Grid\"}))),mdx(\"p\",null,\"Figure 8.36a - Green and built-up CSV joined to Grid. \"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig836_b.png\",alt:\"Attribute table of the grid10km vector layer containing the total areas for green and built-up spaces\",title:\"Attribute table of the grid10km vector layer containing the total areas for green and built-up spaces\"}))),mdx(\"p\",null,\"Figura 8.36b - Tabla de atributos de la capa vectorial Cuadricula que contiene las \\xE1reas totales para espacios verdes y construidos.\"),mdx(\"p\",null,\"Como hemos reunido toda la informaci\\xF3n necesaria para los espacios verdes y construidos en la tabla de atributos de la capa de la cuadr\\xEDcula, todo lo que tenemos que hacer es calcular el porcentaje de estos espacios dentro de la celda de la cuadr\\xEDcula de 10X10 km. Lo calcularemos usando la calculadora de campo, usando la siguiente expresi\\xF3n: \",mdx(\"inlineCode\",{parentName:\"p\"},' (\"verdes_None\" * 100/$area)'),\" y \",mdx(\"inlineCode\",{parentName:\"p\"},' ( \"construidos_None\"  * 100/$area)'),'. A continuaci\\xF3n, a\\xF1adimos un nuevo campo en el que calculamos el informe del  \"verdes_por\"  /  \"constr_por\" , y as\\xED llegar a la respuesta a nuestra solicitud: ratio espacios verdes (parques, bosques) espacio edificado por unidad: ',mdx(\"inlineCode\",{parentName:\"p\"},'\"verdes_por\"  /  \"constr_por\"'),\".  To have a clear overview of our dataset, in cases where there is no built-up space in the grid cell - we insert the value 1000 in the attribute table, in cases where there is no green space, we will insert value 999, while in case both values are NULL then we insert 1001. For this we can use the expression:\"),mdx(\"pre\",null,mdx(\"code\",e({parentName:\"pre\"},{}),`CASE \nWHEN (greenPer is NULL) and (builtupPer is not NULL) then 999\nWHEN (builtupPer is NULL) and (greenPer is not NULL) then 1000\nWHEN (greenPer is NULL) and (builtupPer is NULL) then 1001\nELSE round(greenPer / builtupPer, 5)\nEND\n`)),mdx(\"p\",null,\"El resultado final se ver\\xEDa como en la figura 8.37e.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig837_a.png\",alt:\"Percentage of green area in the 10km x 10km grid\",title:\"Percentage of green area in the 10km x 10km grid\"}))),mdx(\"p\",null,\"Figure 8.37a - Percentage of green area in the 10km x 10km grid\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig837_b.png\",alt:\"Computed percentage of green and built-up area\",title:\"Computed percentage of green and built-up area\"}))),mdx(\"p\",null,\"Figure 8.37b - Computed percentage of green and built-up area\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig837_c.png\",alt:\"Computing for the ratio of green and built-up areas\",title:\"Computing for the ratio of green and built-up areas\"}))),mdx(\"p\",null,\"Figure 8.37c - Computing for the ratio of green and built-up areas\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig837_d.png\",alt:\"Computed ratio of green and built-up areas\",title:\"Computed ratio of green and built-up areas\"}))),mdx(\"p\",null,\"Figure 8.37d - Computed ratio of green and built-up areas\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig837_e.png\",alt:\"Ratio of green and built-up areas in the 10km x 10km grid\",title:\"Ratio of green and built-up areas in the 10km x 10km grid\"}))),mdx(\"p\",null,\"Figura 8.37e - Distribuci\\xF3n espacial de la raci\\xF3n de espacios verdes vs urbanizados por 10X10 km en Santa Fe\"),mdx(\"ol\",e({},{start:2}),mdx(\"li\",{parentName:\"ol\"},\"Longitud total de calles y v\\xEDas fluviales para cada unidad;\")),mdx(\"p\",null,\"Para lograr esta tarea, QGIS ofrece un algoritmo que toma una capa de pol\\xEDgono y una capa de l\\xEDnea y mide la longitud total de l\\xEDneas y el n\\xFAmero total de ellas que cruzan cada pol\\xEDgono. La capa resultante tiene las mismas caracter\\xEDsticas que la capa de pol\\xEDgono de entrada, pero con dos atributos adicionales que contienen la longitud y el recuento de las l\\xEDneas en cada pol\\xEDgono. Vaya a Herramientas de an\\xE1lisis - Sumar longitudes de l\\xEDnea y configure los par\\xE1metros de la siguiente manera: pol\\xEDgonos - Cuadricula, osm_roads, longitud de l\\xEDneas nombre de campo - caminosL, recuento de l\\xEDneas nombre de campo - caminosC. \"),mdx(\"p\",null,\"Puede crear una capa temporal o guardarla como un archivo en su computadora. Si para la representaci\\xF3n utiliza rupturas naturales, su mapa deber\\xEDa verse como en la figura 8.38c.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig838_a.png\",alt:\"Sum Line Lengths parameters\",title:\"Sum Line Lengths parameters\"}))),mdx(\"p\",null,\"Figure 8.38a - Sum Line Lengths parameters\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig838_b.png\",alt:\"Road lengths and counts per Grid cell\",title:\"Road lengths and counts per Grid cell\"}))),mdx(\"p\",null,\"Figure 8.38b - Road lengths and counts per Grid cell\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig838_c.png\",alt:\"Spatial distribution of 10X10km units with most roads\",title:\"Spatial distribution of 10X10km units with most roads\"}))),mdx(\"p\",null,\"Figura 8.38c - Distribuci\\xF3n espacial de unidades de 10 X 10 km con la mayor\\xEDa de las carreteras\"),mdx(\"p\",null,\"Ahora, repita el mismo procedimiento para las longitudes de las v\\xEDas fluviales en cada celda de cuadr\\xEDcula. Ejecutar el proceso en el archivo de cuadr\\xEDcula obtenido anteriormente le ayudar\\xE1 a tener toda la informaci\\xF3n obtenida hasta ahora adjunta a la misma geometr\\xEDa. Le recomendamos que guarde este archivo en su computadora con longitudes_de_linea_cuadriculadas. Si para la representaci\\xF3n utiliza rupturas naturales, su mapa deber\\xEDa verse como en la figura 8.39.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig839.png\",alt:\"Spatial distribution of 10X10km units with most waterways\",title:\"Spatial distribution of 10X10km units with most waterway\"}))),mdx(\"p\",null,\"Figura 8.39 - Distribuci\\xF3n espacial de unidades de 10 x 10 km con la mayor\\xEDa de las v\\xEDas fluviales\"),mdx(\"ol\",e({},{start:3}),mdx(\"li\",{parentName:\"ol\"},\"n\\xFAmero total de edificios p\\xFAblicos para cada unidad (escuelas, jardines de infancia, hospitales, ayuntamientos, etc.).\")),mdx(\"p\",null,`Para contar el n\\xFAmero total de edificios p\\xFAblicos en la unidad 10X10, usaremos osm_pois_limpia. Primero, ejecutamos Listar valores \\xFAnicos ... (Herramientas de an\\xE1lisis) y decidimos qu\\xE9 edificio consideramos p\\xFAblico. Seleccionaremos de nuestra capa de datos de puntos vectoriales las siguientes caracter\\xEDsticas (ejemplo): \"fclass\" = 'police' OR \"fclass\" = 'hospital' OR \"fclass\" = 'school' OR \"fclass\" = 'monument' OR \"fclass\" = 'courthouse' OR \"fclass\" = 'embassy' OR \"fclass\" = 'memorial' OR \"fclass\" = 'prison' OR \"fclass\" = 'playground' OR \"fclass\" = 'doctors' OR \"fclass\" = 'archaeological' OR \"fclass\" = 'university' OR \"fclass\" = 'town_hall' OR \"fclass\" = 'park'. Su selecci\\xF3n debe tener 1514 objetos espaciales en total. `),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig840_a.png\",alt:\"Selecting towns and cities POIs\",title:\"Selecting towns and cities POIs\"}))),mdx(\"p\",null,\"Figure 8.40a - Selecting towns and cities POI\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig840_b.png\",alt:\"Selected towns and cities POIs\",title:\"Selected towns and cities POIs\"}))),mdx(\"p\",null,\"Figure 8.40b - Selected towns and cities POIs\"),mdx(\"p\",null,\"Para responder a nuestra solicitud, usaremos Contar puntos en un pol\\xEDgono, disponible en Herramientas de an\\xE1lisis. Este algoritmo toma una capa de puntos y una capa de pol\\xEDgono y cuenta el n\\xFAmero de puntos del primero en cada uno de los pol\\xEDgonos del segundo. Se genera una nueva capa de pol\\xEDgonos, con exactamente el mismo contenido que la capa de pol\\xEDgonos de entrada, pero que contiene un campo adicional con el recuento de puntos correspondiente a cada pol\\xEDgono. Establece la capa de puntos en osm_pois_limpia y la capa de pol\\xEDgono la capa de cuadr\\xEDcula con la informaci\\xF3n calculada en la ronda anterior. Para los puntos, marque la casilla de verificaci\\xF3n Solo caracter\\xEDsticas seleccionadas, por lo que el algoritmo calcula solo los puntos seleccionados: los edificios p\\xFAblicos. Guarde el archivo de salida como info_cuadr\\xEDcula.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig840_c.png\",alt:\"Count towns and cities POIs in each 10km x 10km grid\",title:\"Count towns and cities POIs in each 10km x 10km grid\"}))),mdx(\"p\",null,\"Figure 8.40c - Count towns and cities POIs in each 10km x 10km grid\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig840_d.png\",alt:\"Spatial distribution of towns and cities POIs density per unit 10X10km\",title:\"Spatial distribution of towns and cities POIs density per unit 10X10km\"}))),mdx(\"p\",null,\"Figura 8.40d - Distribuci\\xF3n espacial de la densidad de edificios p\\xFAblicos por unidad 10X10km\"),mdx(\"h3\",e({},{id:\"preguntas-de-evaluaci\\xF3n\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#preguntas-de-evaluaci\\xF3n\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Preguntas de evaluaci\\xF3n\"),mdx(\"p\",null,\"P: Si tengo 2 capas vectoriales, una representa la extensi\\xF3n de la ciudad en la que estoy trabajando y la segunda, las carreteras construidas en todo el pa\\xEDs, \\xBFqu\\xE9 herramienta de procesamiento usar\\xEDa para extraer solo las carreteras de mi ciudad: b\\xFAfer o clip?\"),mdx(\"p\",null,\"A: Clip.\"),mdx(\"p\",null,\"P. \\xBFEs \\xFAtil la herramienta de zona de influencia en el siguiente caso: tengo una capa vectorial poligonal con monumentos hist\\xF3ricos en mi regi\\xF3n y quiero dibujar un \\xE1rea de protecci\\xF3n de 50 m alrededor de ellos?\"),mdx(\"p\",null,\"A: S\\xED\"),mdx(\"p\",null,\"P: \\xBFCu\\xE1l de las tres herramientas de geoprocesamiento usar\\xEDa para fusionar dos capas vectoriales similares? \\xBFPol\\xEDgonos de Voronoi, disoluci\\xF3n, intersecci\\xF3n?\"),mdx(\"p\",null,\"A: Disolver.\"),mdx(\"h3\",e({},{id:\"fase-3-geoestad\\xEDstica-interpolaci\\xF3n-estimaci\\xF3n-de-datos-faltantes\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#fase-3-geoestad\\xEDstica-interpolaci\\xF3n-estimaci\\xF3n-de-datos-faltantes\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Fase 3: Geoestad\\xEDstica. Interpolaci\\xF3n: estimaci\\xF3n de datos faltantes\"),mdx(\"p\",null,\"La \\xFAltima fase del m\\xF3dulo de datos vectoriales introduce el concepto de estimaci\\xF3n de datos. Estamos acostumbrados a estimar casi a diario sobre diversos temas, por ejemplo, cu\\xE1nto tiempo se tarda en llegar de casa al trabajo en determinadas condiciones. Estamos acostumbrados a dar lo mejor de nosotros, bas\\xE1ndonos en experiencias y corazonadas previas. Sin embargo, al estimar los datos faltantes, la mejor suposici\\xF3n se reemplaza por ecuaciones matem\\xE1ticas muy bien definidas con limitaciones bien conocidas.\"),mdx(\"p\",null,\"El tema requiere un conocimiento significativo en estad\\xEDstica y los resultados siempre deben ser considerados a la luz de sus limitaciones.\"),mdx(\"p\",null,\"Dicho esto, presentaremos un breve ejemplo de estimaci\\xF3n de datos que har\\xE1 la transici\\xF3n al siguiente m\\xF3dulo: procesamiento de datos r\\xE1ster.\"),mdx(\"p\",null,'La interpolaci\\xF3n es un proceso matem\\xE1tico mediante el cual se pueden estimar los valores que faltan bas\\xE1ndose en un n\\xFAmero limitado de valores que existen. Y esas situaciones son comunes, imagine informaci\\xF3n meteorol\\xF3gica. Los datos sobre las temperaturas de la superficie y la cantidad de lluvia que ha ca\\xEDdo se pueden medir solo en puntos espec\\xEDficos en estaciones meteorol\\xF3gicas calibradas, y no en la totalidad de la superficie. Sin embargo, no tenemos \"puntos ciegos\" sin temperaturas en los mapas que vemos en la secci\\xF3n meteo. As\\xED, el resto de valores - como para construir los fen\\xF3menos sin fisuras - se obtienen por interpolaci\\xF3n. El supuesto en el que se basa la interpolaci\\xF3n es que los objetos distribuidos espacialmente est\\xE1n correlacionados espacialmente; en otras palabras, las cosas que est\\xE1n juntas tienden a tener caracter\\xEDsticas similares.'),mdx(\"p\",null,\"Hay muchos m\\xE9todos de interpolaci\\xF3n implementados en los paquetes de software GIS, decidir cu\\xE1l es el mejor en cada caso particular depende de la especificidad de los datos, lo que representan y la comprensi\\xF3n geoestad\\xEDstica del usuario que realiza la interpolaci\\xF3n.\"),mdx(\"p\",null,\"Para comprobar r\\xE1pidamente qu\\xE9 m\\xE9todos de interpolaci\\xF3n est\\xE1n disponibles en QGIS, vaya a la Caja de herramientas de procesamiento y escriba en la barra de b\\xFAsqueda la interpolaci\\xF3n de palabras clave. El resultado deber\\xEDa verse como en la figura 8.41.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig841.png\",alt:\"Interpolation methods available in QGIS\",title:\"Interpolation methods available in QGIS\"}))),mdx(\"p\",null,\"Figura 8.41 - M\\xE9todos de interpolaci\\xF3n disponibles en QGIS\"),mdx(\"p\",null,\"Como se puede observar, a trav\\xE9s de QGIS el usuario tiene acceso a otros algoritmos, implementados en GRASS o SAGA, como resultado de la integraci\\xF3n en QGIS de estas (y otras) soluciones de software muy potentes.\"),mdx(\"p\",null,\"Profundizar en las matem\\xE1ticas detr\\xE1s de cada algoritmo de interpolaci\\xF3n est\\xE1 m\\xE1s all\\xE1 del alcance de este m\\xF3dulo. Sin embargo, con fines de demostraci\\xF3n, simularemos la interpolaci\\xF3n de datos de precipitaci\\xF3n para obtener un conjunto de datos transparente sobre la cantidad de precipitaciones ca\\xEDdas en nuestra \\xE1rea de inter\\xE9s, el Departamento de Rosario.\"),mdx(\"p\",null,\"Como el ejercicio es puramente para mostrar, crearemos nuestro propio conjunto de datos de puntos, para representar las estaciones meteorol\\xF3gicas donde se han registrado los valores de precipitaci\\xF3n durante el transcurso de una semana.\"),mdx(\"p\",null,\"Por lo tanto, el primer paso es crear una nueva capa vectorial - tipo de punto - con puntos asignados aleatoriamente dentro de la extensi\\xF3n del Departamento de Rosario. Hay varias formas de hacerlo, ya sea con el algoritmo de Puntos aleatorios en pol\\xEDgonos ... o con el algoritmo Puntos aleatorios en l\\xEDmites de capa ... Ir a Vector \\u2023 Herramientas de investigaci\\xF3n \\u2023 Puntos aleatorios en pol\\xEDgonos\\u2026. Tambi\\xE9n puede buscar el algoritmo en la caja de herramientas de procesamiento o en la barra de localizaci\\xF3n. Elegir como par\\xE1metros:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"93 puntos\"),mdx(\"li\",{parentName:\"ul\"},\"m\\xEDnimo 5 km.\")),mdx(\"p\",null,\"El resultado deber\\xEDa verse como en la figura 8.42.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig842.png\",alt:\"Creating random points inside a polygon layer\",title:\"Creating random points inside a polygon layer\"}))),mdx(\"p\",null,\"Figura 8.42 - Creaci\\xF3n de puntos aleatorios dentro de una capa de pol\\xEDgono\"),mdx(\"p\",null,\"La capa de puntos resultante se ver\\xE1 aproximadamente como en la figura 8.43.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig843.png\",alt:\"Point data layer - randomly created within specified polygons\",title:\"Point data layer - randomly created within specified polygons\"}))),mdx(\"p\",null,\"Figura 8.43 - Capa de datos de puntos: creada aleatoriamente dentro de pol\\xEDgonos especificados.\"),mdx(\"p\",null,\"Ahora que tenemos nuestras estaciones meteorol\\xF3gicas imaginarias que miden las precipitaciones en el Departamento de Rosario, continuaremos agregando medidas ficticias en el transcurso de 7 d\\xEDas.\"),mdx(\"p\",null,\"Para hacer eso, podemos usar la funci\\xF3n aleatoria proporcionada por QGIS. Abra la tabla de atributos de la capa de datos de puntos creada y la calculadora de campo. En un campo reci\\xE9n creado (entero entero), inserte la siguiente f\\xF3rmula rand (min, max), donde min y max ser\\xE1n reemplazados por el siguiente par de n\\xFAmeros para los 7 d\\xEDas correspondientes (ver figura 8.44):\"),mdx(\"ol\",null,mdx(\"li\",{parentName:\"ol\"},\"0 - 59;\"),mdx(\"li\",{parentName:\"ol\"},\"2 - 35;\"),mdx(\"li\",{parentName:\"ol\"},\"10 - 45;\"),mdx(\"li\",{parentName:\"ol\"},\"0 - 21;\"),mdx(\"li\",{parentName:\"ol\"},\"5 - 63;\"),mdx(\"li\",{parentName:\"ol\"},\"0 - 10;\"),mdx(\"li\",{parentName:\"ol\"},\"0 - 21.\")),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig844.png\",alt:\"Creating random values within specified limits\",title:\"Creating random values within specified limits\"}))),mdx(\"p\",null,\"Figura 8.44 - Creaci\\xF3n de valores aleatorios dentro de los l\\xEDmites especificados\"),mdx(\"p\",null,\"Despu\\xE9s de agregar las 7 columnas, su tabla de atributos deber\\xEDa verse como en la figura 8.45.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig845.png\",alt:\"Fictitious precipitation data for the 93 fictitious meteo stations in Colombo district\",title:\"Fictitious precipitation data for the 93 fictitious meteo stations in Colombo district\"}))),mdx(\"p\",null,\"Figura 8.45 - Datos de precipitaci\\xF3n ficticios para las 93 estaciones meteorol\\xF3gicas ficticias en el Departamento de Rosario.\"),mdx(\"p\",null,\"A continuaci\\xF3n, interpolamos estos valores para cada uno de los 7 d\\xEDas para obtener una capa perfecta que cubra todo el territorio del departamento. Dado que la operaci\\xF3n es repetitiva, usaremos procesamiento por lotes. El m\\xE9todo de interpolaci\\xF3n seleccionado, \\xA1estrictamente para fines de demostraci\\xF3n! - es IDW - ponderado por distancia inversa.\"),mdx(\"p\",null,\"Establezca los siguientes par\\xE1metros:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"coeficiente de distancia: 2\"),mdx(\"li\",{parentName:\"ul\"},\"extensi\\xF3n: limite_departamental_rosario\"),mdx(\"li\",{parentName:\"ul\"},\"tama\\xF1o del r\\xE1ster de salida: 50.\")),mdx(\"p\",null,\"Sus par\\xE1metros deben verse como en la siguiente figura 8.46.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig846.png\",alt:\"Setting up the batch processing window to interpolate the precipitation values for all 7 days\",title:\"Setting up the batch processing window to interpolate the precipitation values for all 7 days\"}))),mdx(\"p\",null,\"Figura 8.46 - Configuraci\\xF3n de la ventana de procesamiento por lotes para interpolar los valores de precipitaci\\xF3n para los 7 d\\xEDas.\"),mdx(\"p\",null,\"El resultado de la interpolaci\\xF3n se ver\\xE1 aproximadamente como en la figura 8.47.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig847.png\",alt:\"Interpolated datasets\",title:\"Interpolated datasets\"}))),mdx(\"p\",null,\"Figura 8.47 - Conjuntos de datos interpolados\"),mdx(\"p\",null,\"Las estaciones meteorol\\xF3gicas son visibles en el lienzo del mapa y en el TOC puede ver los 7 conjuntos de datos r\\xE1ster reci\\xE9n creados que representan los valores de precipitaci\\xF3n para cada d\\xEDa en el Departamento de Rosario.\"),mdx(\"p\",null,\"A continuaci\\xF3n, cambiemos la simbolog\\xEDa de las 7 capas a una m\\xE1s colorida (Propiedades \\u2023 Simbolog\\xEDa \\u2023 Pseudocolor de banda \\xFAnica \\u2023 Magma).\"),mdx(\"p\",null,\"Al observar los datos de puntos y los conjunto de datos r\\xE1ster creados a partir de ellos, podemos notar que ahora tenemos valores para toda la regi\\xF3n y no solo en la ubicaci\\xF3n medida. Hay muchos algoritmos de procesamiento que se pueden aplicar a estos r\\xE1steres para extraer informaci\\xF3n, pero m\\xE1s sobre eso en el siguiente m\\xF3dulo: procesamiento y visualizaci\\xF3n de datos r\\xE1ster.\"),mdx(\"p\",null,\"Sin embargo, como hemos interpolado valores para 7 d\\xEDas, preparemos una breve animaci\\xF3n sobre c\\xF3mo han evolucionado los valores de precipitaci\\xF3n para el Departamento de Rosario.\"),mdx(\"p\",null,\"Para hacer eso, abra el di\\xE1logo Propiedades de test_meteo_estacion_1 r\\xE1ster \\u2023 haga clic en la pesta\\xF1a Temporal \\u2023 marque la opci\\xF3n Temporal \\u2023 seleccione la fecha de inicio y finalizaci\\xF3n, como en la figura 8.48. Haga lo mismo con las 7 capas r\\xE1ster.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig848_a.png\",alt:\"Setting temporal information to the raster dataset (1)\",title:\"Setting temporal information to the raster dataset (1)\"}))),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig848_b.png\",alt:\"Setting temporal information to the raster dataset (2)\",title:\"Setting temporal information to the raster dataset (2)\"}))),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig848_c.png\",alt:\"Setting temporal information to the raster dataset (7)\",title:\"Setting temporal information to the raster dataset (7)\"}))),mdx(\"p\",null,\"Figura 8.48 - Configuraci\\xF3n de informaci\\xF3n temporal para el dataset r\\xE1ster (1, 2, 7).\"),mdx(\"p\",null,\"Abra el Panel del controlador temporal (se puede encontrar en Ver \\u2023 Paneles \\u2023 Panel del controlador temporal) y configure los par\\xE1metros como en la figura 8.49.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig849.png\",alt:\"Set the parameters of the Time Controller Panel\",title:\"Set the parameters of the Time Controller Panel\"}))),mdx(\"p\",null,\"Figura 8.49 - Configure los par\\xE1metros del Panel de controlador de tiempo.\"),mdx(\"p\",null,\"Haga clic en el bot\\xF3n de reproducci\\xF3n \",mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/play-btn.png\",alt:\"Play button\",title:\"Play button\"})),\" y vea c\\xF3mo cambian los valores. Puede elegir qu\\xE9 otras capas ser\\xE1n visibles. En la figura 8.50, agregamos la capa vectorial de edificios.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/open-geodata-curriculum/images/es/argentina/module8/media/fig850.png\",alt:\"Selecting other layers to be visible in the temporal animation\",title:\"Selecting other layers to be visible in the temporal animation\"}))),mdx(\"p\",null,\"Figura 8.50 - Selecci\\xF3n de otras capas para que sean visibles en la animaci\\xF3n temporal.\"),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"Preguntas del cuestionario\")),mdx(\"ol\",null,mdx(\"li\",{parentName:\"ol\"},\"\\xBFExiste un algoritmo para interpolar datos en QGIS o m\\xE1s?\")),mdx(\"p\",null,\"Hay m\\xE1s algoritmos implementados.\"),mdx(\"ol\",e({},{start:2}),mdx(\"li\",{parentName:\"ol\"},\"\\xBFPara qu\\xE9 es \\xFAtil la interpolaci\\xF3n?\")),mdx(\"p\",null,\"La interpolaci\\xF3n es \\xFAtil para estimar datos basados \\u200B\\u200Ben datos conocidos.\"),mdx(\"h2\",e({},{id:\"notes\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#notes\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Notes\"),mdx(\"div\",e({},{className:\"footnotes\"}),mdx(\"hr\",{parentName:\"div\"}),mdx(\"ol\",{parentName:\"div\"},mdx(\"li\",e({parentName:\"ol\"},{id:\"fn-1\"}),\" la capa debe estar proyectada (en metros)\",mdx(\"a\",e({parentName:\"li\"},{href:\"#fnref-1\",className:\"footnote-backref\"}),\"\\u21A9\")))))}MDXContent.isMDXComponent=!0;\n","scope":{"slug":"argentina","title":"argentina","language":"spanish","description":"Mdulo 8 - Procesamiento y anlisis de vectores","date":"","author":"Ben Hur","prev":"/es/argentina/module/module7","next":"/es/argentina/module/module9","mods":["Introduccin suave a los conceptos de SIG (Sistema de Informacin Geogrfica)[/es/argentina/module/module0]","Introduccin to QGIS[/es/argentina/module/module1]","Capas en QGIS[/es/argentina/module/module2]","OpenStreetMap y la Capa de Alta Resolucin de Asentamientos[/es/argentina/module/module3]","Estilo de Capas (Styling Layers)[/es/argentina/module/module4]","Creacin de mapas[/es/argentina/module/module5]","Atributos de capa[/es/argentina/module/module6]","Creacin y edicin de capas[/es/argentina/module/module7]","Procesamiento y anlisis de vectores[/es/argentina/module/module8]","Procesamiento y anlisis de rster[/es/argentina/module/module9]"]}},"frontMatter":{"slug":"argentina","title":"argentina","language":"spanish","description":"Mdulo 8 - Procesamiento y anlisis de vectores","date":"","author":"Ben Hur","prev":"/es/argentina/module/module7","next":"/es/argentina/module/module9","mods":["Introduccin suave a los conceptos de SIG (Sistema de Informacin Geogrfica)[/es/argentina/module/module0]","Introduccin to QGIS[/es/argentina/module/module1]","Capas en QGIS[/es/argentina/module/module2]","OpenStreetMap y la Capa de Alta Resolucin de Asentamientos[/es/argentina/module/module3]","Estilo de Capas (Styling Layers)[/es/argentina/module/module4]","Creacin de mapas[/es/argentina/module/module5]","Atributos de capa[/es/argentina/module/module6]","Creacin y edicin de capas[/es/argentina/module/module7]","Procesamiento y anlisis de vectores[/es/argentina/module/module8]","Procesamiento y anlisis de rster[/es/argentina/module/module9]"]},"isInRequestedLanguage":true,"_nextI18Next":{"initialI18nStore":{"es":{"countrylevel":{"language":"IDIOMA","region":"REGIN","next":"Prximo","back":"Atrs","content_page":"Pagina de contenido","outlines":"Contornos","content_menu":"Men de contenido","back_to_home":"Volver a la pgina de inicio"}},"en":{"countrylevel":{"language":"LANGUAGE","region":"REGION","next":"Next","back":"Back","content_page":"Contents Page","outlines":"Outlines","content_menu":"Content Menu","back_to_home":"Back to Home Page"}}},"initialLocale":"es","userConfig":{"i18n":{"defaultLocale":"en","locales":["en","ar","es"],"defaultCountry":"philippines","countries":["argentina","ethiopia","kenya","mexico","philippines","united-arab-emirates"]},"reloadOnPrerender":true,"default":{"i18n":{"defaultLocale":"en","locales":["en","ar","es"],"defaultCountry":"philippines","countries":["argentina","ethiopia","kenya","mexico","philippines","united-arab-emirates"]},"reloadOnPrerender":true}}}},"__N_SSG":true}